[
    {
        "title": "Timeliner",
        "dict_description": "The movie titled \"Timeliner\" is identified by the ID 2437383 and was produced in the year 2019. It is classified under the kind \"movie\" and has a phonetic code of T5456. The md5sum associated with this title is eca94534f3f05ec0b56089951be1b0d4.\n\nThe movie \"Timeliner\" is an English-language film with a budget of $50,000,000. It is based on several books by Richard C. Meredith, including \"Run, come see Jerusalem,\" \"The Awakening,\" \"The sky is filled with ships,\" and \"We all died at Breakaway Station.\" The plot, noted by Robert H. Gwinn, involves a message of an impending alien invasion that threatens to annihilate all life on Earth, prompting the formation of a special paramilitary team capable of traversing parallel realities to prepare for the attack. A \"timeliner\" named Eric Mathers learns that the pan-dimensional beings known as the Krith might have a hidden agenda, leading him to question whether the war he has been fighting for fourteen years is truly for the greater good or part of the \"greatest lie.\" The film is presented in color, produced in the USA, and falls under the genres of Action and Sci-Fi.\n\nThe movie titled \"Timeliner\" is categorized as a movie. Robert H. Gwinn, identified as male, is associated with this film in multiple capacities, specifically as a producer, writer, and director. His roles are further detailed with notes indicating his involvement as a producer and in the screenplay. The cast information includes these notes: \"(producer)\" and \"(screenplay)\", with an additional unspecified entry. The movie titled \"Timeliner\" is categorized as a \"movie\" and features Joy Meredith in the role of a \"producer.\" The cast information specifies her contribution as an \"(associate producer).\" The movie titled \"Timeliner\" features Richard C. Meredith as a writer, with his contribution noted as \"(novel)\".\n\nThe movie \"Timeliner\" is associated with several keywords that define its thematic and narrative elements. These keywords include \"alternative-timeline,\" indicating a storyline involving different timelines, and \"based-on-novel,\" suggesting that the film is adapted from a literary work. The keyword \"fiction\" categorizes the movie within the fictional genre. Additionally, the keywords \"krith\" and \"meredith\" are linked to the film, possibly referencing characters, themes, or other significant elements. Lastly, the keyword \"timeliner\" directly relates to the movie's title, reinforcing its central concept.\n\nThe movie \"Timeliner\" involves the company Rampant Entertainment in two distinct roles: as a distributor and as a production company.\n\n"
    },
    {
        "title": "Battle Angel",
        "dict_description": "The movie titled \"Battle Angel\" is identified by the ID 1715711 and was produced in the year 2017. It is categorized under the kind \"movie\" and has a phonetic code of B3452. The md5sum associated with this title is 6655082b903dec23d64223829f578dc9.\n\n\"Battle Angel\" is a film released in the USA in 2017, with a budget of $200,000,000. It is an English-language movie produced in the USA and Canada, featuring genres such as Action, Adventure, Romance, Sci-Fi, and Thriller. The film is presented in color and utilizes advanced technology formats including OFM:Digital, PCS:Digital Intermediate (master format), PCS:HDCAM SR (source format), and PFM:D-Cinema. The plot, contributed by Anthony Harmon, revolves around Alita, a cyborg with an organic human brain and an artificial body, found by Dr. Ido in a post-apocalyptic 26th-century world. She is a powerful being with a forgotten past, destined to break a cycle of destruction. TermlnatriX adds that the story is set 300 years after a societal collapse, where cyborg technology is prevalent. The film includes approximately 1,500 visual effects shots and features a main character created with CG animation, shot in 3D using a stereo imaging system developed by James Cameron. It is based on the Japanese manga \"Gunnm,\" known in North America as \"Battle Angel Alita.\" James Cameron confirmed it combines the first three books of Yukito Kishiro's graphic novels and expressed hopes for sequels if successful. A casting call mix-up occurred in 2005, mistakenly posted for \"Avatar\" instead.\n\nThe movie titled \"Battle Angel\" features James Cameron, a male, who contributed as a producer, writer, and director. His roles are specified with notes: \"(producer)\" and \"(screenplay)\", while the director role is noted without additional specification. The movie titled \"Battle Angel\" features Jon Landau, a male, who is involved in the production of the film. His role is specified as a producer, with a note indicating \"(producer)\". The movie titled \"Battle Angel\" features Laeta Kalogridis, a female, in the role of a writer. Her contribution to the film is noted as \"(screenplay)\". The movie titled \"Battle Angel\" features contributions from Yukito Kishiro, who is credited as a writer in two capacities. The roles attributed to Kishiro include \"writer\" and \"writer,\" with specific notes indicating his involvement with \"(characters)\" and \"(graphic novels).\" The cast information further specifies that the note \"(graphic novels)\" is associated with an order number of 0. The movie titled \"Battle Angel\" features Emma Watts, a female, in the role of miscellaneous crew. Her specific contribution is noted as a production executive. The movie titled \"Battle Angel\" features Martin Laing, a male, who contributed as a production designer.\n\nThe movie \"Battle Angel\" is set in the 26th-century and features 3-dimensional elements. It is based on a comic, a graphic novel, and a manga. The film includes themes of a bounty hunter and utilizes CGI animation. It prominently features a cyborg, specifically a female cyborg.\n\nThe movie \"Battle Angel\" involves several companies in its production and distribution. Twentieth Century Fox Film Corporation is listed both as a distributor and a production company. Additionally, Lightstorm Entertainment is also credited as a production company.\n\n"
    },
    {
        "title": "Zero Tolerance",
        "dict_description": "The movie titled \"Zero Tolerance\" is identified by the ID 2518849 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of Z6346. The md5sum associated with this title is e839d5615b662a0343dc6a7f2c5381cb.\n\nThe movie \"Zero Tolerance\" is a documentary, family, and reality-TV film produced in both the UK and USA, with a budget of $50,000. It was released on June 4, 2016, in both the UK and USA. The film is in English and was shot in locations including Kendal, Cumbria, England, UK, and New York, USA. It features the taglines \"Stamp out bullying in schools\" and \"Let down by the administration.\" The movie is presented in color.\n\nThe movie titled \"Zero Tolerance\" features Rick McLeod, a male, who contributed as a producer, writer, and director. His role as a producer is specifically noted as a co-producer. The movie titled \"Zero Tolerance\" is categorized as a movie. A person involved in this film is Mcleod, Charlotte Elizabeth, who is female. Her role in the movie is listed as a writer. The cast information provided is empty, denoted by an empty dictionary.\n\nThe movie \"Zero Tolerance\" explores themes centered around anti-bullying, anxiety, and the consequences of turning a blind eye. It delves into the experiences of children in educational settings, specifically high school and primary school, within the region of Cumbria and the Lake District. The narrative addresses issues such as bullying, name-calling, physical abuse, verbal abuse, social exclusion, and the severe impact these can have, including hospitalization and suicide. The film also touches on themes of denial and victimization, emphasizing a zero-tolerance approach to these problems.\n\nThe movie \"Zero Tolerance\" involves the company Celtic Storm Films, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Dawgtown",
        "dict_description": "The movie titled \"Dawgtown\" is identified by the ID 1808171 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of D235. The MD5 checksum associated with this title is 77601b4227bd2010e46d3d2fdad3b8c6.\n\nThe movie \"Dawgtown\" is an animated film from the USA, released in 2016. It is presented in English and has a runtime of 70 minutes. The film is available in color and features a 16:9 HD aspect ratio. The taglines for \"Dawgtown\" include \"To be free, they must fight.\", \"Throwdown! Showdown! Money down! Dawgtown!\", and \"Break the Chains.\"\n\nThe movie titled \"Dawgtown\" is categorized as a \"movie.\" Bruce Bullock is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Dawgtown\" is categorized as a movie. The person associated with this film is Justin Murphy, identified as male. He is credited with multiple roles, specifically as a producer, writer, and director. The cast information includes a note indicating his role as a producer.\n\nThe movie \"Dawgtown\" features several key elements as indicated by its associated keywords. It includes \"2d-animation,\" suggesting a traditional animation style. The film is described as an \"allegory,\" indicating a deeper symbolic meaning. The presence of \"animal\" and \"cartoon\" keywords highlights its animated nature and focus on non-human characters. Specifically, the story involves a \"dog,\" with a particular emphasis on a \"pitbull.\" These keywords collectively define the thematic and stylistic aspects of \"Dawgtown.\"\n\nThe movie \"Dawgtown\" involves two production companies: Off Center Pictures and Rebellyunz Chylde Animation. Both are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Star Trek 3",
        "dict_description": "The movie titled \"Star Trek 3\" is identified by the ID 2310404 and was produced in the year 2016. It is classified under the kind \"movie\" and has a phonetic code of \"S3636\". The MD5 checksum associated with this title is \"2ff89620c4d8ac97eb77619fceff7c83\".\n\nThe movie \"Star Trek 3\" is presented in English and was released in the USA in 2016. It is a color film produced in the USA. The movie falls under the genres of Action, Adventure, and Sci-Fi.\n\nThe movie titled \"Star Trek 3\" features J.J. Abrams, a male, in the role of a producer. The cast information includes a note indicating his role as \"(producer)\". The movie titled \"Star Trek 3\" features Gene Roddenberry, a male, as a writer. His contribution is noted specifically for the characters.\n\nThe movie \"Star Trek 3\" is associated with several keywords that highlight its connections and context. It is described as \"based-on-cult-tv-series,\" \"based-on-tv-series,\" and \"based-on-tv-show,\" indicating its origins from television. It is also identified as a \"sequel\" and specifically a \"sequel-to-a-reboot,\" suggesting its place in a continuing storyline. The keyword \"star-trek\" directly ties it to the iconic franchise. Additionally, it is noted as the \"third-part\" and the \"thirteenth-part,\" reflecting its position within a larger series.\n\nThe movie titled \"Star Trek 3\" features involvement from the company Paramount Pictures, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "How to Train Your Dragon 3",
        "dict_description": "The movie titled \"How to Train Your Dragon 3\" is identified by the ID 1961996. It was produced in the year 2016 and is classified under the kind \"movie.\" The phonetic code associated with this title is H3656, and it has an MD5 checksum of da0e8dcbc1b4056250cc20bdb4250f97.\n\nThe movie \"How to Train Your Dragon 3\" is an English-language film released in the USA on 18 June 2016. It is presented in color and originates from the USA. The film belongs to the genres of Animation and Family.\n\nThe movie titled \"How to Train Your Dragon 3\" features Jay Baruchel, a male actor, who plays the character Hiccup Horrendous Haddock III. His role is specified as an actor, and he provides the voice for the character, as noted in the cast info with the detail \"(voice)\". The movie titled \"How to Train Your Dragon 3\" is categorized as a \"movie.\" Michael A. Connolly is associated with this film in the role of \"producer.\" His specific contribution is noted as \"(co-producer).\" The movie titled \"How to Train Your Dragon 3\" is categorized as a movie. A person involved in this film is Roy Lee, who is male. He contributed to the film in the role of a producer, specifically noted as a co-producer. The movie titled \"How to Train Your Dragon 3\" is categorized as a movie. In this production, John Powell, a male, contributed in the role of composer. The cast information section is provided but contains no additional details. The movie titled \"How to Train Your Dragon 3\" is categorized as a movie. Dean DeBlois, identified as male, is associated with this film in the role of director. The cast information section is provided but contains no additional details.\n\nThe movie \"How to Train Your Dragon 3\" is associated with the following keywords: \"sequel,\" \"third-part,\" and \"viking.\"\n\nThe movie \"How to Train Your Dragon 3\" involves two key companies in its production and distribution. DreamWorks Animation is listed as a distributor, while Mad Hatter Entertainment is identified as a production company.\n\n"
    },
    {
        "title": "The Wanderer King",
        "dict_description": "The movie titled \"The Wanderer King\" is identified by the ID 2425149 and was produced in the year 2016. It is classified under the kind \"movie\" and has a phonetic code of W5362. The md5sum associated with this title is d53d9a4b9e11813368eb5dec5512305e.\n\n\"The Wanderer King\" is an animated fantasy film in English, produced in the USA with a budget of $500,000. It was released in the USA on 17 December 2016, with a subsequent release in Los Angeles, California, on 25 December 2016. Filming took place from 15 January 2015, with no specified end date. The movie is presented in color and in the RAT:16:9 HD format. The plot, crafted by Larry Longstreth, follows a young elf boy named Dante, destined to be king, and his protector, Landon Wanderer, a noble warrior-turned-outlaw. Dante's kingship is part of a larger, sinister scheme, leading to his transformation into something wicked, prompting Landon to vow to stop him. The film features fantasy creatures like goblins, trolls, dwarves, and elves, offering a dark re-imagining of the \"boy who would be king\" tale, yet includes moments of humor and wonder. The genre is animation.\n\nThe movie titled \"The Wanderer King\" features Vince Bruno, a male actor, in the role of a character named \"Soldier.\" His involvement in the film is noted as \"(rumored).\" The movie titled \"The Wanderer King\" is categorized as a movie. In this film, Travis Fritz, a male actor, plays the role of \"Goblin Clerk.\" The cast information is provided without additional details. The movie titled \"The Wanderer King\" is categorized as a \"movie.\" In this film, Noah Hathaway, identified as male, is associated with the role of \"actor.\" He is linked to the character \"King Dante\" in the movie. The cast information includes a note indicating that this role is \"(rumored).\" The movie titled \"The Wanderer King\" features Aaron Longstreth, a male actor, in the role of a character named Troll. The movie titled \"The Wanderer King\" is a film in which Larry Longstreth, a male, is involved in multiple capacities. He plays the character Wilbur and fulfills the roles of actor, producer, writer, director, and editor. His involvement in the movie is noted with specific mentions: \"(attached)\" and \"(producer)\". The movie titled \"The Wanderer King\" is categorized as a \"movie.\" In this film, Jason Miller, identified as male, is associated with the role of \"actor.\" He is linked to the character named \"Lythos.\" Notably, his involvement in this role is marked as \"(rumored).\" The movie titled \"The Wanderer King\" features Teal Sherer, a female actress, who plays the character named Naga. The movie titled \"The Wanderer King\" is categorized as a movie. In this film, Marisa Zakaria, identified as female, is credited as an actress. She portrays the character \"Young Marta.\" The cast information is provided but contains no additional details. The movie titled \"The Wanderer King\" is categorized as a \"movie.\" Involved in its production is Mark Ordesky, identified as male, who contributed in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"The Wanderer King\" is categorized as a \"movie.\" In this production, Mark D'Errico is credited as a composer. The cast information section is provided but contains no additional details. The movie titled \"The Wanderer King\" features Jacob Ruby in the role of editor. The cast information provided is currently empty.\n\nThe movie titled \"The Wanderer King\" is associated with the following keywords: \"dungeons-and-dragons,\" \"epic,\" and \"world-of-warcraft.\"\n\nThe movie titled \"The Wanderer King\" involves two key companies in its production and distribution. \"Maverick Entertainment\" is responsible for distribution, while \"Eddy Spaghetti Productions\" serves as the production company.\n\n"
    },
    {
        "title": "The Tribe",
        "dict_description": "The movie titled \"The Tribe\" is identified by the ID 2421394 and was produced in the year 2016. It has a phonetic code of \"T61\" and an MD5 checksum of \"6f07a34c143c4f46750b363854dc5a1a\". This entry is categorized under the kind \"movie\".\n\nThe movie titled \"The Tribe\" is associated with the country USA and falls under the genre of Drama.\n\nThe movie titled \"The Tribe\" features Jason Durdon, a male, who is involved in the production of the film. His role is specified as a producer, with the cast info noting this role explicitly as \"(producer)\". The movie titled \"The Tribe\" features James Duval, a male, who contributed to the film as a producer. His specific role is noted as an executive producer. The movie titled \"The Tribe\" features Toby Joynt in the role of a producer. Additionally, the cast info notes that Toby Joynt served as a development executive. The movie titled \"The Tribe\" features Danny Torres, who is credited as a producer. The role associated with Danny Torres is listed as [\"producer\"], and the cast info includes a note specifying \"(producer)\". The movie titled \"The Tribe\" is categorized as a \"movie.\" Michael James Canales is associated with this film in the role of \"writer.\" The cast information is provided as an empty list, denoted by [{}].\n\nThe movie \"The Tribe\" is associated with several keywords that encapsulate its themes and setting. These keywords are: \"africa,\" \"escape,\" \"redemption,\" \"return,\" and \"slavery.\" Each keyword highlights a significant aspect of the film's narrative or backdrop, providing insight into its core elements.\n\nThe movie titled \"The Tribe\" involves the company Continuum Motion Pictures in two distinct roles. It serves as a distributor and also functions as one of the production companies.\n\n"
    },
    {
        "title": "Guns, Hookers & a Pound of Coke",
        "dict_description": "The movie titled \"Guns, Hookers & a Pound of Coke\" is identified by the ID 1931339 and was produced in the year 2016. It is classified under the kind \"movie\" and has a phonetic code of \"G5262\". The MD5 checksum associated with this title is \"48c7d6c0b4f4b70a45b1557e28b307e1\".\n\nThe movie \"Guns, Hookers & a Pound of Coke\" was released in the USA in 2016. It is associated with the country USA and falls under the genres of Action, Adventure, and Crime.\n\nThe movie titled \"Guns, Hookers & a Pound of Coke\" features Ford Austin, a male, who is involved in multiple roles including actor, producer, and writer. In the film, he portrays the character named Steve. His contributions to the movie are further detailed with notes indicating his roles as a producer and for the story. The movie titled \"Guns, Hookers & a Pound of Coke\" features Marc Wasserman, a male, who is involved in the project as both an actor and a producer. In the film, he portrays the character named Johnny. His role as a producer is specifically noted as an executive producer. The movie titled \"Guns, Hookers & a Pound of Coke\" is categorized as a movie. A person involved in this film is Dave Cohen, who is male. His role in the production is listed as a producer, with a specific note indicating he served as the Executive producer. The movie titled \"Guns, Hookers & a Pound of Coke\" features Brad Paulson, a male, who contributed as a writer. The cast information section is currently empty, indicating no additional details are provided about the cast.\n\nThe movie \"Guns, Hookers & a Pound of Coke\" features several notable elements as indicated by its keywords. The title includes both an ampersand and a comma, highlighting the presence of punctuation in the title. The film is based on a true story and involves themes such as a blow-job, cocaine, goons, guns, and prostitutes. These keywords collectively paint a vivid picture of the movie's content and thematic focus.\n\nThe movie \"Guns, Hookers & a Pound of Coke\" involves several companies in its production and distribution. The distributor for the film is UBFilm.com. The production companies include Angry Baby Monkey Pictures, Ford Austin Company, Res Ipsa Productions (II), and Res Ipsa Productions.\n\n"
    },
    {
        "title": "Cranium Intel",
        "dict_description": "The movie titled \"Cranium Intel\" is identified by the ID 1791810 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of C6534. The md5sum associated with this title is f03dedac22ee542cf20b9ffbcdd8a404.\n\nThe movie \"Cranium Intel\" is an English-language film set in locations including Washington DC, USA; St. Louis, Missouri, USA; and Pontoon Beach, Illinois, USA. It was filmed using CAM: Red Epic and OFM: Redcode RAW technology, with an aspect ratio of 1.85:1. The film premiered in the USA on 22 May 2016 in St. Louis, Missouri, and in New Zealand on 24 June 2016. Its tagline is \"The Final Execution,\" and it had a budget of $2,400,000. The movie is an adaptation of Aeneas Middleton's \"Cranium Intel: Gateway 2020,\" published by Royal Middleton Publishing on 1 May 2012, as part of The Military Execution Saga. The plot involves a President wanting a military/scientist named Micheal W. Logan dead after discovering the Gateway Arch in St. Louis is a portal to Planet >X<, with future events in 3040 AD revealing top secret Cranium Intel from 2020 AD. The film is in color, produced in the USA, and spans genres including Action, Adventure, Animation, Sci-Fi, and Thriller.\n\nThe movie titled \"Cranium Intel\" is categorized as a movie. In this film, Christopher 'FreeSol' Anderson, a male, is involved in the role of an actor. He portrays the character named \"Special Operations Officer.\" The cast information is provided but contains no additional details. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Jayson Koko Bridges, a male actor, plays two roles: Micheal W. Logan and Agent# 1. The cast information includes two entries, both of which are empty. The movie titled \"Cranium Intel\" features a cast member named Everett Carter, who is male. He plays the role of an actor, specifically portraying the character \"Drunk Man #1\" in the film. The cast information is provided in the structured data. The movie titled \"Cranium Intel\" features Hardley Davidson, a male, who contributes as both an actor and a composer. In the film, he portrays the character President Scott Collins, with his role noted as \"(voice).\" Additionally, Davidson is credited for the \"(original score)\" of the movie. The movie titled \"Cranium Intel\" features Alexandre Duong, a male actor, in two roles. He portrays the characters Jin Huo and Agent# 3.5. The cast information includes two entries, both associated with his roles as an actor. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Leon Fleisher, a male actor, plays the character \"Red Falcon - EXTeam.\" The cast information is provided without additional details. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Michael Fletcher, a male actor, plays the role of Peyton Mitchell Fletcher, who is the Vice President of the United States. The cast information is provided without additional details. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, James Hargrove II, identified as male, is involved in the role of an actor. He portrays the character named \"Agent# 2\". The cast information is provided but contains no additional details. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Kyjuan, a male actor, plays the character named Weazel. The cast information provided is currently empty. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, David Masterson, a male actor, plays dual roles. He portrays the character Adam Steinberg, who is the Secretary of Defense, and also takes on the role of Helicopter Operator C5. The cast information is provided in two entries, corresponding to these roles. The movie \"Cranium Intel\" features Aeneas Middleton, a male actor, in dual roles as James Whitaker, the President of the United States, and Henry Blades, the Leader of EXTeam. Middleton's involvement extends beyond acting; he is also credited as a producer (executive producer), writer (novel and screenplay), director (attached), editor, and production designer. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Todd Senofonte, identified as male, is involved in the role of an actor. He portrays the character named Paul Excalibur. The cast information is provided but contains no additional details. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Clinton Sparks, a male, is involved in the role of an actor. He portrays the character named Captain Harris. The cast information provided is currently empty. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Adi Spektor, a male, is credited as an actor. He portrays the character Xavier Street, who is the President of the Circle District of America. The cast information is provided without additional details. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Eric Vidal, a male actor, plays the character named \"Dj# 2\". The cast information is provided but contains no additional details. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Nick Vidal, a male actor, plays the character named \"Dj# 1\". The cast information is provided but contains no additional details. The movie titled \"Cranium Intel\" is categorized as a movie. Joanne Jeffers, identified as female, is involved in this film as an actress. She portrays the character \"First Lady - The Circle District of America.\" The cast information is provided but contains no additional details. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Romie von Klinger, a female, is credited as an actress. She portrays the character named Jennifer Lee Johansson. The cast information is provided, but no additional details are specified. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Denise Moreno, identified as female, is credited as an actress. She portrays the character \"Neo-Machine Agent# 2.0\". The cast information is provided but contains no additional details. The movie titled \"Cranium Intel\" features Amy Lee Palmer, a female actress, in the role of Natasha - EXTeam. The movie titled \"Cranium Intel\" is categorized as a \"movie\" and features Kevin Gundaker in the role of a producer. Specifically, he is noted as an \"executive producer\" in the cast information. The movie titled \"Cranium Intel\" features John Honoré, a male, who contributed as a cinematographer. His role is specifically noted as the \"director of photography.\" The movie titled \"Cranium Intel\" features Sterling, Shae, a male, who contributed as miscellaneous crew. His specific role was as the location manager in New Zealand.\n\nThe movie \"Cranium Intel\" features a rich array of themes and elements, including 3-dimensional and 3D visuals, and is based on a novel. It involves intense scenarios such as assassination, assault, chase, and escape attempts. The narrative unfolds in a dystopian setting with a focus on a commander-in-chief, corporate executives, and a megacorporation. The plot includes futuristic technology like concept cars, genetic engineering, holograms, and power suits, alongside military elements such as marines, military officers, and weapons like machine guns and gatling guns. The story also explores space and outer-space travel, with scenes set in locations like St. Louis and the White House. Additional features include an electronic music score, virtual sets, and suspended animation, with action sequences involving flying, exploding ships, and fight-to-the-death scenarios. The presence of robots, machines, and intelligence further enriches the universe depicted in the film, which also includes a nightclub and a gateway.\n\nThe movie \"Cranium Intel\" involves several production companies, specifically \"Burnin Rubber Music Publishing / Royal Middleton Publishing,\" \"Coldwell Banker Gundaker,\" and \"Tri-City Speedway - Illinois.\" Each of these entities is categorized under the type \"production companies.\"\n\nThe movie \"Cranium Intel\" has an alternate title, \"Cranium Intel: Gateway 2020,\" which is identified by the ID 74532 and associated with the movie ID 1791810. This title is categorized under kind ID 1 and was produced in the year 2016. It carries the phonetic code C6534 and is noted as an \"(International: English title) (alternative title).\" The MD5 checksum for this entry is daba8b916be259da498645ccfbaa1864.\n\n"
    },
    {
        "title": "Drug Lord",
        "dict_description": "The movie titled \"Drug Lord\" is identified by the ID 1847064 and was produced in the year 2016. It is classified under the kind \"movie\" and has a phonetic code of D6246. The md5sum associated with this title is 6d11efc6f0174199ae8e952f6d39542b.\n\nThe movie \"Drug Lord\" is set in locations including Texas, USA, and New Mexico, USA. It is based on the Pulitzer Prize-nominated book \"Drug Lord: The Life & Death of a Mexican Kingpin - A True Story\" by Terrence E. Poppa. The plot, noted anonymously, follows a drug trafficker fleeing U.S. law who takes over crime in a Mexican border town, transforming it into a battleground of terror, treachery, and vengeance as he fights rivals to retain control. The film is produced in the USA and falls under the genres of Crime, Drama, and Thriller.\n\nThe movie titled \"Drug Lord\" is categorized as a movie. Michael Gianfriddo is associated with this film in the role of a producer. Specifically, he is noted as an executive producer. The movie titled \"Drug Lord\" features Diana Kemp, a female, in the role of a producer. Her specific contribution to the film is noted as an executive producer. The movie titled \"Drug Lord\" is categorized as a movie. Mina Zavoda is associated with this film, contributing as both a producer and a writer. The cast information includes a note specifying her role as a producer. The movie titled \"Drug Lord\" features Terrence E. Poppa as a person involved in the project, specifically in the role of a writer. The cast information includes a note indicating that the contribution is based on a book.\n\nThe movie titled \"Drug Lord\" is associated with the keyword \"based-on-book\" according to the structured IMDb data.\n\nThe movie \"Drug Lord\" involves the company Dominant Entertainment in two distinct roles. Dominant Entertainment serves as both a distributor and a production company for the film.\n\n"
    },
    {
        "title": "Hurricane Kid",
        "dict_description": "The movie titled \"Hurricane Kid\" is identified by the ID 1964522 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of \"H6252\". The MD5 checksum associated with this title is \"d4cf2e56957108c21731f84573e2f5c0\".\n\nThe movie \"Hurricane Kid\" is an action film from the USA, released in 2016, with a runtime of 96 minutes. It is presented in color and has a budget of $15,000,000. The film is in English and features a technical aspect ratio of 1.85:1. The tagline for the movie is \"Be Somebody!\" The plot centers on Todd Lawrence, a former Mixed Martial Arts star whose glory days are behind him. He is given a chance for redemption when his adopted and estranged son brings him back to the ring as a trainer.\n\nThe movie titled \"Hurricane Kid\" is categorized as a movie. Jon Lee Brody, a male, is involved in this film as an actor, producer, and writer. He portrays the character Charlie Gold. His contributions to the film include acting, producing, noted as \"(producer),\" and writing, noted as \"(story).\" The movie titled \"Hurricane Kid\" is categorized as a \"movie.\" In this film, Shad Gaspard, a male, is involved in the role of an \"actor.\" He is associated with the character named \"Mike 'The Mangler' Miller.\" The cast information includes a note indicating that this involvement is \"(rumored).\" The movie titled \"Hurricane Kid\" is categorized as a \"movie.\" In this film, Stephen Kramer Glickman, identified as male, is involved in the role of an \"actor.\" He is associated with the character named \"Eddie,\" although this casting is noted as \"(rumored).\" The movie titled \"Hurricane Kid\" is categorized as a movie. In this film, Gonzalo Menendez, identified as male, is associated with the role of an actor. He is linked to the character named Danny Wright. The cast information includes a note indicating that his involvement is rumored. The movie titled \"Hurricane Kid\" is categorized as a \"movie.\" John Edward Betancourt is associated with this film as a \"writer,\" specifically credited for the \"(screenplay).\"\n\nThe movie titled \"Hurricane Kid\" is associated with the keyword \"mixed-martial-arts\" according to the structured IMDb data.\n\nThe movie \"Hurricane Kid\" involves two production companies: Aquarius Entertainment and Iron Will Productions. Both companies are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Agent 47",
        "dict_description": "The movie titled \"Agent 47\" is identified by the ID 1669098 and was produced in the year 2016. It has a phonetic code of A253 and an MD5 checksum of 18e7adecca768d5ab7b207096b420312. This entry is categorized under the kind \"movie.\"\n\nThe movie \"Agent 47\" is an action film produced in the USA, featuring English as its language. It was filmed in locations including Berlin, Germany, and Singapore. The movie was released in the USA in 2016 and is presented in color.\n\nThe movie titled \"Agent 47\" features Daniel Alter, a male, in the role of a producer. His specific contribution to the film is noted as an executive producer. The movie titled \"Agent 47\" is categorized as a \"movie.\" Adrian Askarieh is associated with this film in the role of \"producer.\" The cast information specifies that Adrian Askarieh holds the position of \"(executive producer).\" The movie titled \"Agent 47\" features Charles Gordon, a male, in the role of a producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"Agent 47\" is categorized as a \"movie.\" Involved in its production is Alex Young, a male, who is credited in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Agent 47\" is categorized as a movie. Michael Finch is associated with this title in the role of a writer. The cast information is provided but contains no additional details. The movie titled \"Agent 47\" is categorized as a \"movie.\" The person associated with this title is Woods, Skip, who is credited in the role of \"writer.\" The cast information provided is currently empty, as indicated by the empty dictionary in the \"cast info\" section. The movie titled \"Agent 47\" is categorized as a \"movie\" and features Aleksander Bach in the role of \"director.\" The cast information includes a note stating \"(attached).\"\n\nThe movie \"Agent 47\" is associated with several keywords: \"assassin,\" \"bald,\" \"hired-killer,\" \"money,\" and \"video-game.\" These keywords encapsulate the thematic elements and characteristics present in the film.\n\nThe movie \"Agent 47\" involves several companies in its production and distribution. Twentieth Century Fox Film Corporation is responsible for distributing the film. The production companies include 20th Century Fox Film Corporation and Dune Entertainment.\n\n"
    },
    {
        "title": "Angry Birds",
        "dict_description": "The movie titled \"Angry Birds\" is identified by the ID 1688430 and was produced in the year 2016. It has a phonetic code of A5261 and an md5sum of 89e216aecd8b163b30fb02db5c656699. This entry is categorized under the kind \"movie.\"\n\nThe movie \"Angry Birds\" was released in the USA in 2016, as indicated by the release date information \"USA:2016\". It is categorized under the genre \"Animation\" and was produced in the country \"USA\".\n\nThe movie titled \"Angry Birds\" is categorized as a \"movie.\" John Cohen is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Angry Birds\" features David Maisel in the role of a producer. His involvement is specifically noted as a consulting producer.\n\nThe movie titled \"Angry Birds\" is associated with the keyword \"based-on-video-game\" according to the structured IMDb data from the keyword_info section.\n\nThe movie titled \"Angry Birds\" involves the company Rovio Mobile, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Army of Darkness 2",
        "dict_description": "The movie titled \"Army of Darkness 2\" is identified by the ID 1695344 and was produced in the year 2016. It is classified under the kind \"movie\" and has a phonetic code of \"A6513\". The md5sum associated with this title is \"0a472caa7dc87b0fdb34c933403ae256\".\n\nThe movie \"Army of Darkness 2\" is an English-language film released in the USA in 2016. It is presented in color and originates from the USA. The film spans multiple genres, including Action, Comedy, Fantasy, and Horror.\n\nThe movie titled \"Army of Darkness 2\" features Robert G. Tapert, a male, in the role of producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"Army of Darkness 2\" features Ivan Raimi, a male, in the role of writer. The cast information provided is currently empty. The movie titled \"Army of Darkness 2\" features Sam Raimi, a male, who is credited as a writer. The cast information is currently unspecified.\n\nThe movie \"Army of Darkness 2\" is associated with several keywords, including \"book-of-the-dead,\" \"necronomicon,\" and \"sequel.\"\n\nThe movie \"Army of Darkness 2\" involves the company Ghost House Pictures, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Ocean Planet 3D",
        "dict_description": "The movie titled \"Ocean Planet 3D\" has an IMDb title ID of 2168207 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of \"O2514\". The md5sum associated with this title is \"5bb5158fac1659ef6451d8c8de1ea9c0\".\n\nThe movie \"Ocean Planet 3D\" is a documentary produced in the USA, with its release date in the USA being February 2016. The film is presented in English and is available in color.\n\nThe movie titled \"Ocean Planet 3D\" is categorized as a movie. Greg MacGillivray, identified as male, is associated with this film in the roles of producer and director. The cast information includes a note specifying \"(producer)\" for one of the roles, while the other entry remains unspecified.\n\nThe movie \"Ocean Planet 3D\" is associated with the following keywords: \"marine-life,\" \"number-in-title,\" and \"ocean.\"\n\nThe movie \"Ocean Planet 3D\" involves the company MacGillivray Freeman Films, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Through the Glass",
        "dict_description": "The movie titled \"Through the Glass\" is identified by the ID 2434310 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of T6232. The md5sum associated with this title is 56891c52be044aab3dee1c8dabfc2d63.\n\nThe movie \"Through the Glass\" was released in the USA in 2016. It is categorized under the genre of Drama and was produced in the USA.\n\nThe movie titled \"Through the Glass\" features Fabien Hameline, a male, who contributed as both a producer and a writer. His roles are specifically noted as \"(producer)\" and \"(written by)\".\n\nThe movie titled \"Through the Glass\" is associated with the keyword \"based-on-true-story\" according to the structured IMDb data from the keyword_info section.\n\nThe movie \"Through the Glass\" involves the company Garance Pictures, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Bond 24",
        "dict_description": "The movie titled \"Bond 24\" is identified by the ID 1739896 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of \"B53\". The md5sum associated with this title is \"0c6bcf5efe85a4ac53af6f0a137fe2bd\".\n\n\"Bond 24\" is the 24th James Bond movie in the EON Productions official series, and the 26th theatrically released James Bond film overall, or 27th if including the TV episode tele-movie \"Climax!\" (1954). It is an action, adventure, crime, and thriller film, produced in color, and released in the UK in 2016. The movie is in English and was produced in the USA and UK. Pre-production began during the making and release of \"Skyfall\" (2012), similar to how \"Quantum of Solace\" (2008) began before \"Casino Royale\" (2006) started filming. This film marks Daniel Craig's fourth appearance as James Bond, with a contract for a fifth in \"Bond 25.\" Director Sam Mendes considered directing \"Bond 24\" if \"Skyfall\" was successful, potentially opening a role for Kevin Spacey. Financing and distribution arrangements for \"Bond 24\" and \"Bond 25\" suggest a two-year cycle. If using an original Ian Fleming story title, only four remain: \"The Property of a Lady,\" \"The Hildebrand Rarity,\" \"Risico,\" and \"007 in New York.\" A story outline exists, known only to select personnel. John Logan writes the script solo, his second Bond screenplay after \"Skyfall.\" This is the first Bond film in 15 years not co-authored by Purvis and Wade, who worked on Bond scripts since \"The World Is Not Enough\" (1999). In late October 2012, pre-production was reported with principal photography planned for October 2013 and a release in Autumn 2014. \"Bond 24\" and \"Bond 25\" are designed with a multi-film arc, marking the second time two Bond movies are directly connected, the first being \"Casino Royale\" and \"Quantum of Solace.\" Christopher Nolan is considered for directing, with associate producer Gregg Wilson expressing interest. The film and \"Bond 25\" are reportedly not based on any original Ian Fleming story. The next Bond film, \"Bond 25,\" is expected about two years after \"Bond 24.\"\n\nThe movie titled \"Bond 24\" is categorized as a \"movie.\" In this film, Daniel Craig, a male actor, plays the character James Bond. The cast information provided is currently empty. The movie titled \"Bond 24\" is categorized as a \"movie.\" In the cast, Ralph Fiennes, identified as male, is associated with the role of \"actor.\" His involvement in the film is noted as \"(rumored).\" The movie titled \"Bond 24\" is categorized as a \"movie.\" In this film, Ben Whishaw, identified as male, is involved in the role of an \"actor.\" He portrays the character \"Q\" in the movie. The cast information provided is currently empty. The movie titled \"Bond 24\" is categorized as a \"movie.\" In the cast, Naomie Harris, identified as female, is associated with the role of \"actress.\" Her involvement in the film is noted as \"(rumored).\" The movie titled \"Bond 24\" is categorized as a movie. Barbara Broccoli, identified as female, is associated with this film in the role of a producer. The cast information includes a note specifying her role as \"(producer)\". The movie titled \"Bond 24\" features Michael G. Wilson, a male, in the role of producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"Bond 24\" features Ian Fleming, a male, as a writer. His contribution is noted as \"(characters)\". The movie titled \"Bond 24\" is categorized as a \"movie.\" A person associated with this film is John Logan, identified as male, who contributed in the role of \"writer.\" The cast information provided is currently empty, as indicated by the empty dictionary in the \"cast info\" section. The movie titled \"Bond 24\" is categorized as a \"movie.\" Involved in its production is Dennis Gassner, a male, who contributed as a \"production designer.\" The cast information section is currently empty, as indicated by the provided data.\n\nThe movie titled \"Bond 24\" is associated with several keywords: \"espionage,\" \"sequel,\" \"spy,\" and \"twentyfourth-part.\" These keywords highlight the film's themes and its position in a series.\n\nThe movie titled \"Bond 24\" involves several companies in its distribution and production. The distributors for this film include Columbia Pictures, Sony Pictures Entertainment, and Sony Pictures. Additionally, Eon Productions is listed as the production company.\n\n"
    },
    {
        "title": "Great Au Pair",
        "dict_description": "The movie titled \"Great Au Pair\" is identified by the ID 1927546 and was produced in the year 2015. It has a phonetic code of G6316 and an md5sum of 531e7b5038f77002866b68c51fd23a9d. This entry is categorized under the kind \"movie.\"\n\nThe movie \"Great Au Pair\" was filmed in Los Angeles, California, USA, and Philadelphia, Pennsylvania, USA. It features a Dolby Digital sound mix with RCA Sound Recording and utilized CAM: Panavision Cameras and Lenses. The tagline for the film is \"You never know who to fall in love...\". The production had a budget of $15,000 and was shot in color. It was produced in the USA and falls under the genres of Adventure, Drama, and Romance.\n\nThe movie titled \"Great Au Pair\" features Deniz Sahin in the role of a producer. Additionally, Sahin is noted as a production executive in the cast information. The movie titled \"Great Au Pair\" features Hakan Yildiz, a male, who contributed as both a producer and a writer. His roles are specified with notes indicating he served as an executive producer and was responsible for writing, as denoted by \"(executive producer)\" and \"(written by)\" respectively.\n\nThe movie \"Great Au Pair\" is characterized by several key elements: it is based on a story, and it includes themes of being gay, love, and relationships. The narrative also involves a nanny and features aspects of travel.\n\nThe movie \"Great Au Pair\" involves several companies in its distribution and production. It is distributed by Amazon.com, Indieflix Distribution, and Sweet Dreams Production. Notably, Sweet Dreams Production is listed twice as a distributor. Additionally, Sweet Dreams Production also serves as the production company for the film.\n\n"
    },
    {
        "title": "The Marriage Plot",
        "dict_description": "The movie titled \"The Marriage Plot\" is identified by the ID 2392423 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of M6214. The md5sum associated with this title is 872fe33f900d7f5e964de1a3e53c3fe2.\n\nThe movie titled \"The Marriage Plot\" is associated with the country of origin, USA, and falls under the genre of Drama.\n\nThe movie titled \"The Marriage Plot\" features Scott Rudin, a male, in the role of producer. His involvement is noted specifically as \"(producer)\". The movie titled \"The Marriage Plot\" features Jeffrey Eugenides, a male, as a writer. His contribution is noted as \"(novel)\". The movie titled \"The Marriage Plot\" features Greg Mottola, a male, in the role of a writer. His contribution to the film is noted as \"(screenplay)\".\n\nThe movie titled \"The Marriage Plot\" is associated with several keywords that define its thematic elements. These keywords include \"college-friend,\" indicating a connection to friendships formed in a college setting, \"love-triangle,\" suggesting a romantic entanglement involving three individuals, and \"three-word-title,\" which describes the structure of the movie's title. Each keyword provides insight into the film's narrative and thematic focus.\n\nThe movie titled \"The Marriage Plot\" involves two key companies in its production and distribution. Sony Pictures is responsible for distribution, while Scott Rudin Productions is involved as a production company.\n\n"
    },
    {
        "title": "Jose, 1823",
        "dict_description": "The movie titled \"Jose, 1823\" is identified by the ID 2003728 and was produced in the year 2015. It has a phonetic code of \"J2\" and an MD5 checksum of \"fab8474b8bdea3e5169addcbde45c210\". This production is categorized as a \"movie\".\n\n\"Jose, 1823\" is a historical fiction film set in February 1824, focusing on Jose de San Martin, the General in Chief of the liberating armies of Argentina, Chile, and Peru, as he departs for Europe, never to return to his homeland. The film explores the challenges faced by San Martin amidst political turmoil and personal struggles. It is a biography shot in color, with a budget of $3,750,000. The movie was released in Argentina on 25 February 2015. Filming locations include Peru, Chile, and Mendoza, Argentina. The language of the film is Spanish, and it was produced in Argentina. The plot was noted by Alex Peli.\n\nThe movie titled \"Jose, 1823\" is categorized as a movie. Marcelo Lopez Alvarez is associated with this film in the role of a producer. His involvement is specifically noted as a co-producer. The movie titled \"Jose, 1823\" features Diego Conejero in the role of a producer. His involvement in the film is specified with two distinct roles: \"producer\" and \"producer,\" with additional notes indicating his responsibilities as \"(executive producer)\" and \"(producer).\" The movie titled \"Jose, 1823\" is categorized as a movie. The person involved is Lasserre, Juan Pablo, who is associated with the role of producer. The cast info includes a note indicating \"(producer)\". The movie titled \"Jose, 1823\" is categorized as a movie. Alejandro Levi is associated with this film in the role of a producer. Additionally, the cast information notes that Alejandro Levi served as a consulting producer. The movie titled \"Jose, 1823\" features Marcelo Ortega in the role of a producer. His involvement is specifically noted as a co-producer. The movie titled \"Jose, 1823\" is categorized as a movie. Cristina Raschia is associated with this film, fulfilling the roles of both writer and director. The cast information includes two entries, both of which are empty. The movie titled \"Jose, 1823\" is categorized as a \"movie.\" Marcelo Salvioli is associated with this film in the role of \"production designer.\" The cast information section is provided but contains no additional details.\n\nThe movie titled \"Jose, 1823\" is associated with the keyword \"independence-war\" according to the structured IMDb data from the keyword_info section.\n\nThe movie \"Jose, 1823\" involves two production companies: Dimecom Films and Tango Films. Both companies are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Adam's Perfection",
        "dict_description": "The movie titled \"Adam's Perfection\" is identified by the ID 1665547 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of A3521. The md5sum associated with this title is f39410d8598fff41b90fbde1563da12e.\n\n\"Adam's Perfection\" is a film produced by HHG Film Company, featuring a plot where Adam, possessing the looks of a movie star, the mind of a genius, and a seven-figure salary, seeks a perfect partner through a dangerous experiment involving oriental spiritual practice. This partner, unseen by others, is his alone to enjoy, but leaving her may not be an option if things go awry. The movie is a blend of Drama, Fantasy, Mystery, and Thriller genres, presented in Color. It is a collaborative production between the USA and Russia, with English as the language.\n\nThe movie titled \"Adam's Perfection\" is categorized as a movie. Vladislav Pasternak is associated with this film, fulfilling the roles of both producer and writer. The cast information specifies his contributions with notes indicating \"(producer)\" and \"(story)\" with a numerical order of 1001 for the latter. The movie titled \"Adam's Perfection\" features Alexander Talal as a key contributor, taking on multiple roles. He is credited as a producer, specifically noted as an executive producer, and as a writer. His writing contributions are detailed with two distinct roles: one for the story, marked with a note and an order of 1, and another for the screenplay, noted as written by, with an order of 0. The movie titled \"Adam's Perfection\" is categorized as a \"movie.\" Involved in its production is José Luis Alcaine, identified as male, who contributed in the role of a cinematographer. The cast information is provided as an empty list.\n\nThe movie \"Adam's Perfection\" features a diverse array of themes and elements, including a businesswoman, career, and a character-name-in-title. It delves into the world of a computer genius and a corporate executive, exploring corporate secrets and the dynamics of a female boss. The narrative touches on emotions like frustration and concepts such as genius, ghost, and guru. It incorporates hallucination, invisibility, and love, alongside meditation and mental challenges. The film is a mindbender, involving murder, a nerd, and a sex scene. Shadows, software, and the subconscious play significant roles, as do themes of success, a succubus, and a tulpa. Vanity and wealth are also central to the storyline.\n\nThe movie \"Adam's Perfection\" involves the company HHG Film Company, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "The Incredible Shrinking Man",
        "dict_description": "The movie titled \"The Incredible Shrinking Man\" is identified by the ID 2380090 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"I5263\". The MD5 checksum associated with this title is \"e47fc6be6fd583b5d2dab8049b17089f\".\n\n\"The Incredible Shrinking Man\" is a film released in the USA on 6 November 2015. The movie is presented in color and is primarily in English. It is set in the USA and spans the genres of Action, Comedy, and Sci-Fi. The plot follows Scott Carey, who has shrunk to a size where he is forgotten by his family and the world, trapped in his own basement. He struggles daily to survive in this new reality, facing threats and reflecting on his life changes, anticipating his eventual disappearance. This plot summary is provided by an anonymous source.\n\nThe movie titled \"The Incredible Shrinking Man\" features Alan Gasmer in the role of a producer. The cast information includes a note specifying \"(producer)\". The movie titled \"The Incredible Shrinking Man\" features Stan Lee, a male, in the role of a producer. His specific contribution is noted as \"(executive producer)\" in the cast information. The movie titled \"The Incredible Shrinking Man\" features Matheson Jr., Richard in the role of a producer. The cast information includes a note specifying \"(producer)\". The movie titled \"The Incredible Shrinking Man\" features contributions from Richard Matheson, a male, who played multiple roles in its creation. He was involved as a producer, specifically noted as a \"(co-producer),\" and as a writer in two capacities: \"(based on the novel by)\" and \"(screenplay).\" The movie titled \"The Incredible Shrinking Man\" features Edgar Wright, a male, in the role of producer. His involvement is specifically noted as an executive producer.\n\nThe movie titled \"The Incredible Shrinking Man\" is associated with the keywords: \"based-on-novel\" and \"remake\".\n\nThe movie \"The Incredible Shrinking Man\" involves several companies in its production and distribution. Metro-Goldwyn-Mayer (MGM) is responsible for distributing the film. The production companies include Marvel Studios and Matheson Entertainment.\n\n"
    },
    {
        "title": "My Immortal: The Vampires of Berlin",
        "dict_description": "The movie titled \"My Immortal: The Vampires of Berlin\" is identified by the ID 2138648 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"M5634\". The MD5 checksum associated with this title is \"bc156132ca4669a7fdf0bf94fb1307b4\".\n\nThe movie \"My Immortal: The Vampires of Berlin\" is presented in English and was released in the USA in 2015. It is based on the novel \"My Immortal - The Vampires Of Berlin\" by Lee Rudnicki, published by 23 House on February 9, 2012, and spans 306 pages with the ISBN-13: 9780984645817. The film is in color and originates from the USA. It spans multiple genres, including Action, Adventure, History, Horror, and Thriller.\n\nThe movie titled \"My Immortal: The Vampires of Berlin\" is categorized as a movie. Melitta Fitzer is associated with this film in the role of a producer. The cast information includes a note specifying her role as \"(producer)\". The movie titled \"My Immortal: The Vampires of Berlin\" is categorized as a movie. Involved in its production is a person named Mori, Ko, who is male. Mori, Ko holds the role of producer, as indicated by the cast info note \"(producer)\". The movie titled \"My Immortal: The Vampires of Berlin\" is categorized as a movie. Lee Rudnicki is associated with this film as both a producer and a writer. The cast information includes a note indicating Rudnicki's role as a producer.\n\nThe movie titled \"My Immortal: The Vampires of Berlin\" is associated with the keyword \"two-word-title\" according to the structured IMDb data.\n\nThe movie \"My Immortal: The Vampires of Berlin\" involves the company Eleven Arts, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "My Eyes Through Carnage",
        "dict_description": "The movie titled \"My Eyes Through Carnage\" is identified by the ID 2137928 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of M2362. The md5sum associated with this title is 6c4bf96fd18cd7183bae55fdb9d057c0.\n\nThe movie \"My Eyes Through Carnage\" is categorized under the genres of Sci-Fi, Thriller, and Western.\n\nThe movie titled \"My Eyes Through Carnage\" is categorized as a movie. Rania Ajami, identified as female, is associated with this film in multiple capacities, specifically as a writer, writer, and director. Her contributions to the film include writing the screenplay, crafting the story, and directing, as indicated by the notes \"(screenplay)\" and \"(story)\" in the cast information. The movie titled \"My Eyes Through Carnage\" is categorized as a movie. Kurt Lustgarten is associated with this film as a writer, specifically credited for the screenplay.\n\nThe movie titled \"My Eyes Through Carnage\" is associated with the keyword \"neo-noir\" as per the structured IMDb data.\n\nThe movie \"My Eyes Through Carnage\" involves the company Cipher Productions, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Star Wars: Episode VII",
        "dict_description": "The movie titled \"Star Wars: Episode VII\" is identified by the ID 2310583 and was produced in the year 2015. It has a phonetic code of \"S3621\" and an MD5 checksum of \"de986a41f1680a47bc666705baaee9ea\". This entry is categorized under the kind \"movie\".\n\n\"Star Wars: Episode VII\" is an English-language film released in 2015 in Australia, Canada, New Zealand, Peru, the UK, and the USA. The movie, distributed by Walt Disney Pictures, marks the first \"Star Wars\" film to have more than one producer, with J.J. Abrams and Bryan Burk at the helm. Initially, directors like Matthew Vaughn, Steven Spielberg, Guillermo del Toro, Peter Jackson, Christopher Nolan, Ben Affleck, Joss Whedon, Rian Johnson, and James Cameron were considered before J.J. Abrams was selected. Despite initially declining, Abrams was persuaded by Kathleen Kennedy after a month of negotiations. Abrams, who previously worked with Harrison Ford on \"Regarding Henry,\" shares a connection with original \"Star Wars\" director George Lucas, who also directed Ford in \"American Graffiti.\" Lucas described the transition of Lucasfilm to Disney as a way to pass \"Star Wars\" to a new generation of filmmakers. Although the sale of Lucasfilm to Disney was announced in November 2012, Mark Hamill and Carrie Fisher had already discussed their involvement in Episode VII with Lucas in the summer of 2012. The film is categorized under the genres of Action, Adventure, Fantasy, and Sci-Fi, and is presented in color. It is noted in \"NewsVille\" by Carlo Carrasco that the film was set to show in 2015. The movie is a product of the USA.\n\nThe movie titled \"Star Wars: Episode VII\" features Anthony Daniels, a male actor, in the role of C-3PO. His involvement in the film is noted as \"(rumored)\". The movie titled \"Star Wars: Episode VII\" is categorized as a movie. In this film, the person named Ford, Harrison, who is male, is involved in the role of an actor. He portrays the character named Han Solo. The cast information includes a note indicating that this involvement is rumored. The movie titled \"Star Wars: Episode VII\" is categorized as a \"movie.\" In this film, Mark Hamill, identified as male, is involved in the role of an \"actor.\" He is associated with the character \"Luke Skywalker,\" with the cast information noting this as \"(rumored).\" The movie titled \"Star Wars: Episode VII\" features Billy Dee Williams, a male actor, in the role of Lando Calrissian. His involvement in the film is noted as \"(rumored)\". The movie titled \"Star Wars: Episode VII\" features Carrie Fisher, a female actress, in the role of Leia Solo. Her involvement in the film is noted as \"(rumored)\". The movie titled \"Star Wars: Episode VII\" is categorized as a \"movie.\" The person associated with this title is Abrams, J.J., identified as male. His roles in this production include \"producer\" and \"director.\" The cast information includes a note indicating \"(producer)\" and an additional unspecified entry. The movie titled \"Star Wars: Episode VII\" features Bryan Burk, a male, in the role of a producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"Star Wars: Episode VII\" features Kathleen Kennedy, a female, in the role of a producer. Her involvement is specifically noted as an executive producer. The movie titled \"Star Wars: Episode VII\" features Michael Arndt, a male, in the role of writer. The cast information provided is currently empty. The movie titled \"Star Wars: Episode VII\" features George Lucas, a male, who contributed as a writer and miscellaneous crew. His roles are specified with notes indicating \"(characters)\" and \"(creative consultant)\". The movie titled \"Star Wars: Episode VII\" is categorized as a \"movie.\" In the cast information, Maryann Brandon is associated with this title. She is identified with the role of \"editor.\" The cast info section contains an empty dictionary, indicating no additional details are provided. The movie titled \"Star Wars: Episode VII\" is categorized as a movie. Involved in its production is Mary Jo Markey, identified as female, who contributed in the role of an editor. The cast information section is provided but contains no additional details. The movie titled \"Star Wars: Episode VII\" features Lawrence Kasdan, a male, as part of the miscellaneous crew. His role is specifically noted as a \"creative consultant.\" The movie titled \"Star Wars: Episode VII\" features Simon Kinberg, a male, as part of the miscellaneous crew. His specific role is noted as a \"creative consultant.\"\n\nThe movie \"Star Wars: Episode VII\" is associated with the following keywords: \"roman-numeral-in-title,\" \"sequel,\" and \"seventh-part.\" These keywords highlight that the film features a title with a roman numeral, is a continuation in a series, and represents the seventh installment.\n\nThe movie \"Star Wars: Episode VII\" involves several companies in its production and distribution. The distributors for this film are Walt Disney Studios Motion Pictures, listed twice. The production companies include Bad Robot, Lucasfilm, and Walt Disney Pictures.\n\n"
    },
    {
        "title": "Bay of Fires",
        "dict_description": "The movie titled \"Bay of Fires\" is identified by the ID 1716315 and was produced in the year 2015. It has a phonetic code of B162 and an MD5 checksum of 08b5c8974f04af2da69284e847098038. This entry is categorized under the kind \"movie\".\n\nThe movie \"Bay of Fires\" was released in the USA in 2015. It is associated with the country Ireland and falls under the genre of Drama.\n\nThe movie titled \"Bay of Fires\" features Ned Dowd, a male, in the role of a producer. His specific contribution to the film is noted as an executive producer. The movie titled \"Bay of Fires\" features Howard Gibbins, a male, in the role of a producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"Bay of Fires\" features Stephen Lourdes in the role of a writer. The cast information provided is currently empty, as indicated by the structured data. The movie titled \"Bay of Fires\" features Sherry Perkov, a female, who is credited in the role of miscellaneous crew. Her specific contribution is noted as production staff.\n\nThe movie \"Bay of Fires\" features several key elements, including an \"air-battle,\" a \"concentration-camp,\" and is set in \"Ireland.\" Additionally, it explores the theme of \"love-against-the-odds.\"\n\nThe movie titled \"Bay of Fires\" involves the company Peachy Vision, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "The Doberman Gang",
        "dict_description": "The movie titled \"The Doberman Gang\" is identified by the ID 2363341 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of D1652. The md5sum associated with this title is 7b493a0462e658ec60ec700bc6eb1dd0.\n\n\"The Doberman Gang\" is a film that was released in the USA in 2015. It is a remake of the classic '70s film series. The movie is presented in color and is primarily in English. It originates from the USA and spans multiple genres, including Action, Adventure, Comedy, and Crime.\n\nThe movie titled \"The Doberman Gang\" features Darren Reagan in the role of a producer. The cast information includes a note specifying \"(producer)\". The movie titled \"The Doberman Gang\" is categorized as a \"movie.\" Louis Garfinkle is associated with this film in the role of \"writer.\" The cast information includes a note specifying \"(original screenplay).\"\n\nThe movie \"The Doberman Gang\" is associated with the following keywords: \"doberman,\" \"dog,\" \"heist,\" and \"robbery.\" These keywords encapsulate the central themes and elements of the film, highlighting its focus on dobermans and dogs, as well as its involvement with a heist and a robbery.\n\nThe movie titled \"The Doberman Gang\" involves the company 11Eleven Entertainment, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Conflicting Interests",
        "dict_description": "The movie titled \"Conflicting Interests\" has an IMDb ID of 1786545 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of C5142. The MD5 checksum associated with this title is 7f809b3c8977268ddce75f0090bc4be6.\n\nThe movie \"Conflicting Interests\" was filmed in Cape May, New Jersey, USA; Philadelphia, Pennsylvania, USA; and West Chester, Pennsylvania, USA. It was released in the USA in 2015. The plot centers on biotech entrepreneur Lauren Mason, who, along with her company and son, becomes entangled in a web of conflicting interests involving Big Pharmaceuticals, the Federal Government, and rogue FBI agent Matthew Danisi, all of whom are after the revolutionary product NOVA that she helped develop. The film is categorized under the genres of Action, Crime, and Thriller, and it was produced in the USA.\n\nThe movie titled \"Conflicting Interests\" is categorized as a \"movie.\" Alexander Emmert, identified as male, is associated with this film in the roles of \"producer\" and \"writer.\" The cast information includes a note specifying \"(producer)\" for his involvement. The movie titled \"Conflicting Interests\" is categorized as a \"movie.\" Involved in its production is Zaughn Elizabeth Ivins, identified as female, who contributed in the role of \"producer.\" Her specific contribution is noted as \"(assistant producer).\" The movie titled \"Conflicting Interests\" features Daria Walsh, who is involved in the production as a producer. Her role is specifically noted as an assistant producer. The movie titled \"Conflicting Interests\" features Eric Siegel as a writer. The cast info notes that the role is associated with a novel. The movie titled \"Conflicting Interests\" is categorized as a \"movie.\" The person associated with this title is Jim Waltzer, who is credited in the role of \"writer.\" The cast information section is provided but contains no additional details.\n\nThe movie titled \"Conflicting Interests\" is associated with the keyword \"based-on-novel\" according to the structured IMDb data.\n\nThe movie \"Conflicting Interests\" involves two production companies: Invictus Films and Paddock Pictures. Both are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "The Westies",
        "dict_description": "The movie titled \"The Westies\" is identified by the ID 2426264 and was produced in the year 2015. It has a phonetic code of \"W232\" and an MD5 checksum of \"7b1be0627e45e91e97bde0514855a326\". This entry is categorized under the kind \"movie\".\n\nThe movie \"The Westies\" was released in the USA in 2015, with its production taking place from 2013 to 2013. It is a drama film originating from the USA.\n\nThe movie titled \"The Westies\" features Gilbert Adler, a male, in the role of a producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"The Westies\" is categorized as a \"movie.\" Frank Baldwin is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"The Westies\" is categorized as a \"movie\" and features David Guillod in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"The Westies\" is categorized as a movie. Cole Hauser, identified as male, is associated with this film in multiple capacities, specifically as a producer and director. The cast information includes a note indicating his role as a producer. The movie titled \"The Westies\" features Logan Levy in the role of a producer. The cast information specifies Levy's involvement with the note \"(producer).\" The movie titled \"The Westies\" features Shane McCarthy, a male, who contributed as both a producer and a writer. His roles are specifically noted as \"(producer)\" and \"(screenplay)\" in the cast information. The movie titled \"The Westies\" is categorized as a \"movie.\" Holly Wiersma is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"The Westies\" features T.J. English, a male, in the role of a writer. The cast information notes that his contribution is based on a novel.\n\nThe movie titled \"The Westies\" is associated with the keyword \"based-on-novel\" according to the structured IMDb data.\n\nThe movie titled \"The Westies\" involves the company Blue Engine Pictures, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Tiananmen Square",
        "dict_description": "The movie titled \"Tiananmen Square\" is identified by the ID 2435180 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"T526\". The MD5 checksum associated with this title is \"a3616f1fdefb8fbc877c2bcf28800208\".\n\nThe movie \"Tiananmen Square\" is a thriller produced by Running Waters Productions, with a budget of $30,000,000. The film is adapted from Kriss Perras Running Waters' work titled \"Tiananmen Square,\" published by Ruptured Media on 1 May 2014. The plot centers on a Chinese woman who falls in love with an MI6 agent embedded in Beijing society. Their attempt to escape Communist China is thwarted by the Premier's jealousy and political will. The film is set in the USA.\n\nThe movie titled \"Tiananmen Square\" features Scott Tallal in the role of a producer. His involvement is specifically noted as a line producer. The movie titled \"Tiananmen Square\" features Perras Running Waters, Kriss, a female, as both the writer and director. Her contributions include the story and screenplay. The movie titled \"Tiananmen Square\" features Richard Kosinski as a person involved in the production. His role in the movie is listed as a composer, with a specific note indicating that he contributed \"original music by.\"\n\nThe movie titled \"Tiananmen Square\" is associated with several keywords that provide insight into its themes and setting. These keywords include \"beijing-china,\" \"china,\" \"flies,\" \"tiananmen-square-beijing,\" and \"torture.\" Each keyword highlights a specific aspect or element related to the film, such as its geographical context with \"beijing-china\" and \"tiananmen-square-beijing,\" the broader national setting with \"china,\" and thematic elements like \"flies\" and \"torture.\"\n\nThe movie titled \"Tiananmen Square\" involves the company Running Waters Productions, which is categorized under production companies.\n\n"
    },
    {
        "title": "Mermaid",
        "dict_description": "The movie titled \"Mermaid\" is identified by the ID 2114321 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"M653\". The md5sum associated with this title is \"5b3c7c39d7268dfee3ecdf1f0a106702\".\n\nThe movie \"Mermaid\" features languages Czech and English, and was filmed in Prague, Czech Republic. It was released in the USA in 2015. The tagline for the film is \"She's Real.\" Notably, it is the first American feature-length movie to be shot on Super 8 film. The budget for the film was $400,000, and it is presented in color. The country associated with the film is the USA.\n\nThe movie titled \"Mermaid\" is categorized as a movie. Rachel Noël Jackson is associated with this film as both a producer and a writer. Her contributions are specifically noted as \"(producer)\" and \"(story)\" in the cast information. The movie titled \"Mermaid\" is categorized as a \"movie.\" Marika Jaksova is associated with this film in the role of a producer. The cast information includes a note specifying her role as \"(producer).\" The movie titled \"Mermaid\" is categorized as a movie. Joshua Brandon Pancer is associated with this film in multiple capacities, specifically as a producer, writer, and director. His roles are further detailed with notes indicating his contributions as a producer and in the screenplay & story. The movie titled \"Mermaid\" is categorized as a \"movie.\" Melissa Dowd Figueroa is associated with this film as a \"writer,\" specifically credited with the \"(story).\" The movie titled \"Mermaid\" is categorized as a \"movie\" and features Paul Edwardson, who is credited as the cinematographer. The cast information section is present but contains no additional details.\n\nThe movie titled \"Mermaid\" is associated with the keywords \"sirenomelia\" and \"super-8\".\n\nThe movie \"Mermaid\" features involvement from the company Some Velvet Morning, which is categorized under production companies.\n\n"
    },
    {
        "title": "The Drowned World",
        "dict_description": "The movie titled \"The Drowned World\" is identified by the ID 2364298 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of D6536. The md5sum associated with this title is 1e615efb31e702d9be98d17c95c78ea2.\n\nThe movie titled \"The Drowned World\" is associated with the country USA. It falls under the genres of Sci-Fi and Thriller.\n\nThe movie titled \"The Drowned World\" features Jon Berg, a male, in the role of producer. His involvement is noted as \"(production executive).\" The movie titled \"The Drowned World\" features Jeffrey Clifford in the role of a producer. The cast information includes a note specifying \"(producer)\". The movie titled \"The Drowned World\" features David Heyman, a male, in the role of producer. His involvement is noted specifically as \"(producer)\". The movie titled \"The Drowned World\" features J.G. Ballard, a male, in the role of writer. The cast information includes a note indicating that the movie is based on the novel by J.G. Ballard, with a numerical order of 0.\n\nThe movie titled \"The Drowned World\" is associated with the keyword \"based-on-novel\" according to the structured IMDb data.\n\nThe movie \"The Drowned World\" involves several companies in its production and distribution. Warner Bros is listed both as a distributor and a production company. Additionally, Heyday Films is also credited as a production company.\n\n"
    },
    {
        "title": "The Spy Princess",
        "dict_description": "The movie titled \"The Spy Princess\" is identified by the ID 2415644 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of S1652. The md5sum associated with this title is e34e5f7e595303cd83ba69f99c30afab.\n\n\"The Spy Princess\" is a drama film from the UK, released in the USA in 2015. The movie is in English and presented in color. It tells the remarkable story of Noor Inayat Khan, codenamed \"Madeleine,\" a heroic woman trained by Britain's Special Operations Executive. She became the first female wireless operator flown into occupied France during WWII. Infiltrated into the Paris area, her circuit was almost entirely arrested by the Gestapo shortly after her arrival, making 'poste-Madeleine' the last radio link between France and England. The plot spans from Noor's birth in 1914 in Moscow to an American mother and an Indian Muslim father, who founded the first Sufi Order in the West, to her death at the hands of the Gestapo in 1944.\n\nThe movie titled \"The Spy Princess\" is categorized as a \"movie.\" Involved in its production is a person named \"Hai, Zafar,\" who holds the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"The Spy Princess\" is categorized as a \"movie.\" A person involved in this project is Tabrez Noorani, identified as male. His role in the film is listed as a \"producer,\" with a specific note indicating \"(producer).\" The movie titled \"The Spy Princess\" is categorized as a \"movie\" and features the involvement of Shrabani Basu, who is credited as a \"writer.\" The cast information includes a note indicating that the work is based on a \"(novel).\"\n\nThe movie titled \"The Spy Princess\" is associated with the keyword \"based-on-novel\" according to the structured IMDb data.\n\nThe movie titled \"The Spy Princess\" involves two production companies. These companies are Haimark Films International and Tamasha Talkies, both categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Mission: Impossible 5",
        "dict_description": "The movie titled \"Mission: Impossible 5\" is identified by the ID 2122828 and was released in the production year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"M2512\". The md5sum associated with this title is \"1cf66ae603245edccf85ed6a5de11bc0\".\n\nThe movie \"Mission: Impossible 5\" is presented in English and was released in the USA in 2015. It is produced in color and originates from the USA. The film belongs to the genres of Action, Adventure, and Thriller.\n\nThe movie titled \"Mission: Impossible 5\" is categorized as a \"movie.\" In this film, Tom Cruise, a male, is involved in dual roles as both an \"actor\" and a \"producer.\" He portrays the character \"Ethan Hunt\" in the movie. The cast information includes a note indicating his role as a \"(producer).\" The movie titled \"Mission: Impossible 5\" is categorized as a \"movie.\" In this film, Jeremy Renner, a male actor, is associated with the role of \"William Brandt.\" His involvement in the movie is noted as \"(rumored).\" The movie titled \"Mission: Impossible 5\" is categorized as a \"movie.\" In this film, Ving Rhames, a male actor, is involved in the role of \"actor.\" He portrays the character named \"Luther Stickell.\" The cast information includes a note indicating that his involvement is \"(rumored).\" The movie titled \"Mission: Impossible 5\" features a person named Patton, Paula, who is female. She is listed in the role of an actress and is associated with the character named Jane Carter in the movie. The cast information includes a note indicating her involvement is rumored. The movie titled \"Mission: Impossible 5\" is categorized as a \"movie.\" Involved in its production is J.J. Abrams, a male, who is credited in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Mission: Impossible 5\" is categorized as a \"movie.\" Involved in its production is David Ellison, a male, who is listed under the role of \"producer.\" The cast information includes a note specifying his role as \"(producer).\" The movie titled \"Mission: Impossible 5\" is categorized as a \"movie.\" Bruce Geller, identified as male, is associated with this film in the role of \"writer.\" His contribution is specifically noted as \"(characters).\" The movie titled \"Mission: Impossible 5\" features contributions from Drew Pearce, a male, who is credited in the roles of \"writer\" and \"writer.\" His involvement is further detailed with notes specifying \"(screenplay)\" and \"(written by).\"\n\nThe movie \"Mission: Impossible 5\" is associated with the following keywords: \"fifth-part,\" \"sequel,\" and \"spy.\"\n\nThe movie \"Mission: Impossible 5\" involves several companies in its production and distribution. Paramount Pictures is listed twice as a distributor, indicating its significant role in distributing the film. Additionally, Skydance Productions is identified as a production company, contributing to the creation of the movie.\n\nThe movie titled \"Mission: Impossible 5\" has an alternate title entry with the ID 208588, associated with the movie ID 2122828. This alternate title is \"M:i 5,\" categorized under kind ID 1, and was produced in the year 2015. It carries a phonetic code \"M\" and is noted as \"(USA) (informal title).\" The md5sum for this entry is \"19727db1e735c5169bd30a2ee767ec83.\"\n\n"
    },
    {
        "title": "Warcraft",
        "dict_description": "The movie titled \"Warcraft\" is identified by the ID 2487978 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"W6261\". The md5sum associated with this title is \"834f39c1956ad10c74fa4a20433b1b2f\".\n\nThe movie \"Warcraft\" is presented in English and is produced in the USA. It is characterized by its color format and spans the genres of Action, Adventure, Fantasy, and War. Notably, Gary Whitta wrote an initial script for the film, which was later discarded when Sam Raimi took over. Additionally, director Uwe Boll reached out to Blizzard to direct the film, but Blizzard declined. According to MTV news, Uwe Boll quoted Paul Sams of Blizzard saying, \"We will not sell the movie rights, not to you... especially not to you. Because it's such a big online game success, maybe a bad movie would destroy that ongoing income, what the company has with it.\"\n\nThe movie titled \"Warcraft\" features Stuart Fenegan, who is credited as a producer. His specific role is noted as an executive producer. The movie titled \"Warcraft\" features Alex Gartner, a male, in the role of producer. His involvement is noted specifically as \"(producer)\". The movie titled \"Warcraft\" features Jon Jashni, a male, in the role of a producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"Warcraft\" features Chris Metzen, a male, who contributed as both a producer and a writer. His roles are specified with notes indicating he served as a \"(co-producer)\" and was involved in \"(story and characters)\". The movie titled \"Warcraft\" features Michael Morhaime, a male, in the role of a producer. His specific contribution to the film is noted as an executive producer. The movie titled \"Warcraft\" features Brent O'Connor in the role of a producer. His specific contribution to the film is noted as an executive producer. The movie titled \"Warcraft\" is categorized as a \"movie.\" Involved in its production is Charles Roven, a male, who served in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Warcraft\" features Paul Sams in the role of a producer. His involvement is specifically noted as an executive producer. The movie titled \"Warcraft\" features Thomas Tull, a male, in the role of a producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"Warcraft\" features Charles Leavitt as a writer, with his role specifically noted as \"(screenplay)\". The movie titled \"Warcraft\" is categorized as a \"movie.\" The person associated with this title is Duncan Jones, identified as male, who fulfills the role of \"director.\" The cast information is provided as an empty list, denoted by [{}].\n\nThe movie \"Warcraft\" is associated with the following keywords: \"based-on-video-game,\" \"fictional-war,\" and \"one-word-title.\"\n\nThe movie \"Warcraft\" involves several production companies. These include Atlas Entertainment, Blizzard Entertainment, Legendary Pictures, and Warner Bros, all categorized under the type \"production companies.\"\n\nThe movie titled \"Warcraft\" has an alternate title entry with the ID 336096, associated with the movie ID 2487978. This alternate title is \"World of Warcraft,\" classified under kind ID 1. It was used as a working title in the USA, with the production year noted as 2015. The phonetic code for this title is \"W6431,\" and it is identified by the MD5 checksum \"6b31be1d4dedd72afa3f8b72720a3d25.\"\n\n"
    },
    {
        "title": "Truckers",
        "dict_description": "The movie titled \"Truckers\" has an IMDb ID of 2451656 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"T6262\". The md5sum associated with this title is \"3004a8a360e0dbb218804dfce694a2db\".\n\nThe movie \"Truckers\" is an animated fantasy film released in the USA in March 2015. It is based on the novel \"Truckers\" by Terry Pratchett. The film is presented in color and is in the English language. The country of origin is the USA.\n\nThe movie titled \"Truckers\" is categorized as a \"movie.\" Andrew Adamson, identified as male, is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Truckers\" is categorized as a \"movie.\" A person involved in this film is Aron Warner, identified as male. His role in the production is listed as [\"producer\"], with a specific note indicating \"(producer)\" in the cast info. The movie titled \"Truckers\" features John Orloff as a writer, with his role specifically noted as \"(screenplay)\". The movie titled \"Truckers\" is categorized as a movie. The person associated with this title is Terry Pratchett, who is male. His role in the movie is as a writer, specifically noted for \"(books)\". The movie titled \"Truckers\" features Michael Andrews, who is credited in the role of editor. The cast information section is provided but contains no additional details. The movie titled \"Truckers\" is categorized as a \"movie.\" Jessie Carbonaro is associated with this film in the capacity of \"miscellaneous crew.\" Specifically, Carbonaro's role includes being a \"(pre-production supervisor).\" The movie titled \"Truckers\" is categorized as a \"movie.\" In the cast information, Sean Kamath is listed under the name \"Kamath, Sean\" and is associated with the role of \"miscellaneous crew.\" Additionally, there is a specific note indicating his position as \"(supervisor).\" The movie titled \"Truckers\" features Margaret Whitman, who is credited in the role of miscellaneous crew. Her specific contribution is noted as \"(assistant to producer/director)\".\n\nThe movie \"Truckers\" is associated with the following keywords: \"based-on-novel\" and \"one-word-title\".\n\nThe movie \"Truckers\" involves the company DreamWorks Animation, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "The Hunger Games: Mockingjay - Part 2",
        "dict_description": "The movie titled \"The Hunger Games: Mockingjay - Part 2\" is identified by the ID 2379300 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of H5262. The MD5 checksum associated with this title is 53c564ec3ff5714e57ca6cfcbac80c1a.\n\n\"The Hunger Games: Mockingjay - Part 2\" was filmed in locations including Boston, Massachusetts, USA, and Atlanta, Georgia, USA. The film's aspect ratio is RAT:2.35 : 1. It was released on 20 November 2015 in Mexico, Sweden, the UK, and the USA, with a later release in Germany on 26 November 2015. Filming took place from 16 September 2013 to May 2014. The movie is from the USA and spans multiple genres: Action, Adventure, Drama, Sci-Fi, and Thriller.\n\nThe movie titled \"The Hunger Games: Mockingjay - Part 2\" features a contribution from a person named Jacobson, Nina, who is identified as female. She played the role of a producer, as noted in the cast info with the specification \"(producer)\". The movie titled \"The Hunger Games: Mockingjay - Part 2\" is categorized as a movie. Jon Kilik, identified as male, is associated with this film in the role of a producer. The cast information includes a note specifying his role as \"(producer)\". The movie titled \"The Hunger Games: Mockingjay - Part 2\" is categorized as a movie. The person associated with this title is Collins, Suzanne, who is credited in the role of writer. The cast info includes a note indicating \"(novel)\". The movie titled \"The Hunger Games: Mockingjay - Part 2\" features Danny Strong, a male, in the role of a writer. His contribution to the film is noted as \"(screenplay)\". The movie titled \"The Hunger Games: Mockingjay - Part 2\" is categorized as a movie. It was directed by Francis Lawrence, who is identified as male. The role associated with Francis Lawrence is \"director.\" The cast information section is provided but contains no additional details.\n\nThe movie \"The Hunger Games: Mockingjay - Part 2\" is associated with several keywords that capture its thematic and narrative elements. These keywords include \"dystopia,\" \"dystopian,\" and \"dystopic-future,\" highlighting the film's setting in a bleak and oppressive world. Additionally, the keyword \"fourth-part\" indicates its position as the fourth installment in its series. The term \"post-apocalypse\" suggests a storyline set after a catastrophic event, while \"sequel\" confirms it continues the narrative from a preceding film.\n\nThe movie \"The Hunger Games: Mockingjay - Part 2\" involves several companies in its production and distribution. Lionsgate is listed as both a distributor and a production company. Additionally, Color Force is identified as a production company.\n\nThe movie titled \"The Hunger Games: Mockingjay - Part 2\" has an alternate title \"Hunger Games - Il canto della rivolta: parte 2\" with the ID 298162, associated with the movie ID 2379300. This title is categorized under kind ID 1 and was produced in the year 2015. It is noted as the \"(Italy) (imdb display title)\" and has a phonetic code of \"H5262\". The MD5 checksum for this entry is \"e71af50ca425503ad99a352e3a7221b0\".\n\n"
    },
    {
        "title": "Gilgamesh: In Search of Immortality",
        "dict_description": "The movie titled \"Gilgamesh: In Search of Immortality\" is identified by the ID 1917534 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of G4252. The md5sum associated with this title is 45eb78dcdcac89aa65f2ddd7ab4ed785.\n\n\"Gilgamesh: In Search of Immortality\" was released in the USA on 1 December 2015. The film is inspired by the epic poem \"Gilgamesh,\" the oldest-known literature, originally etched on clay tablets in Sumer/Mesopotamia using Cuneiform, mankind's first written language. Despite being mostly ruined by war and age, the remaining fragments were deciphered by George Smith in 1872 at the British Museum in London. This movie draws from these surviving fragments and is set amid the Sumerian Civilization, known for the \"39 Firsts\" that advanced humankind's civilization. It is a sequel to the first movie, \"Gilgamesh,\" and explores themes of Courage, Passion, and the adventurous Quest to find the meaning of Life and Death, marking man's first Odyssey in search of Immortality. Directed by J.J. Alani, the film belongs to the genres of Action, Adventure, Fantasy, and Romance, and was produced in the USA.\n\nThe movie titled \"Gilgamesh: In Search of Immortality\" is categorized as a movie. J.J. Alani is associated with this film as both a producer and a writer. In the cast information, J.J. Alani is noted as a producer and is credited as the writer under the name J. Jonroy Alani. The movie titled \"Gilgamesh: In Search of Immortality\" features Holland, Gill, a male, in the role of a producer. His involvement is specifically noted as a co-producer. The movie titled \"Gilgamesh: In Search of Immortality\" features Bianca Bezdek-Goodloe, a female, as part of the miscellaneous crew. Her specific role is noted as \"(legal counsel)\". The movie titled \"Gilgamesh: In Search of Immortality\" features Jonathan Gray, a male, as part of the miscellaneous crew. His specific role is noted as \"(legal representation)\".\n\nThe movie \"Gilgamesh: In Search of Immortality\" is rich with themes and elements such as the abyss, adventure-hero, and adventurer, exploring concepts like the afterlife and ancient civilization. It features battles, character-name-in-title, and children, while delving into civilization, courage, and dance. Themes of death, demi-god, and demon are present, alongside desire, destiny, and determination. The narrative includes a dog, epic, and erotic-dance, with elements of erotica, family-relationships, and female-nudity. A femme-fatale, flood, and garden-of-delights appear, as well as the garden-of-eden, ghost, and goddess. The story involves gods, grief, and hand-to-hand-combat, with a harp, heart-broken characters, and a horse. Immortality, Ishtar, and jealousy are explored, with a king, lion, and love. Love-for-animals, magic, and male-nudity are depicted, along with a man-crying, marriage, and Mesopotamia. The setting includes the Middle East, monster, and myth, with nature, Noah, and Noah's-ark. Nudity, odyssey, and paradise are themes, alongside passion, philosophy, and a queen. Rivalry, second-part, and seduction are present, with a sequel, sexual-attraction, and sexuality. A song, Sumer, and sun are featured, with a surprise-ending, transformation, and tunnel. The story includes a warrior, wine, and wisdom.\n\nThe movie \"Gilgamesh: In Search of Immortality\" involves several production companies. These include \"David & Layla,\" \"Films International Corporation,\" \"Gray Krauss Des Rochers,\" \"Group Entertainment, The,\" and \"Newroz Films.\" Each of these entities is categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "The Miracle Man",
        "dict_description": "The movie titled \"The Miracle Man\" is identified by the ID 2394231 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"M6245\". The md5sum associated with this title is \"ad5904a84060cb8e0a297f0057d4cfe3\".\n\n\"The Miracle Man\" is a biography and drama film released in the USA in 2015. The movie is in English and presented in color. Its tagline, \"To live was only the first step...\", encapsulates the inspiring story of Morris Goodman, a successful insurance salesman who, after a plane crash on March 10, 1981, was left unable to walk, talk, swallow, breathe, or move any part of his body except his eyes. Despite doctors' grim predictions, Morris used his mind and faith to set a goal of walking again, achieving a full recovery by Thanksgiving of the same year. This remarkable journey is highlighted in the trivia that Morris E. Goodman was featured in \"The Secret (2006) (V)\" where he shared his recovery story. The film is set in the USA and belongs to the genres of Biography and Drama.\n\nThe movie titled \"The Miracle Man\" features Nancy Jenkins, a female, in the role of a producer. Her involvement is specifically noted as an associate producer. The movie titled \"The Miracle Man\" features Brian Jude, a male, who contributed as both a producer and a writer. His roles are specifically noted as \"(producer)\" and \"(screenplay)\" in the cast information. The movie titled \"The Miracle Man\" is categorized as a \"movie.\" Richard Legon is associated with this film in the role of \"producer.\" His specific contribution is noted as \"(associate producer).\" The movie titled \"The Miracle Man\" features Isen Robbins, a male, in the role of a producer. The cast information includes a note specifying \"(producer)\". The movie titled \"The Miracle Man\" is categorized as a \"movie.\" Aimee Schoof is associated with this film in the role of a producer. The cast information includes a note specifying her role as \"(producer).\" The movie titled \"The Miracle Man\" is categorized as a movie. A person involved in this project is Walker, Tom, who contributed as both a producer and a composer. The cast information includes a note specifying \"(producer)\" for Walker, Tom, while another entry is left unspecified. The movie titled \"The Miracle Man\" features Morris E. Goodman, a male, who contributed as a writer. His role is specifically noted as \"(book)\".\n\nThe movie titled \"The Miracle Man\" is associated with the keyword \"based-on-true-story\" according to the structured IMDb data from the keyword_info section.\n\nThe movie titled \"The Miracle Man\" involves two production companies: Dragon Rider Productions and Intrinsic Value Films. Both are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Ant-Man",
        "dict_description": "The movie titled \"Ant-Man\" has an IMDb ID of 1690673 and was released in the production year 2015. It is categorized under the kind \"movie\" and has a phonetic code of A535. The md5sum associated with this title is 9cd6df69237e32afae6df833ff5e8568.\n\nThe movie \"Ant-Man\" is presented in the English language and was released in the USA on 6 November 2015. It is produced in color and originates from the USA. The film falls under the genres of Action and Sci-Fi.\n\nThe movie titled \"Ant-Man\" is categorized as a \"movie.\" Kevin Feige, identified as male, is associated with this film in the role of a producer. The cast information includes a note specifying \"(producer).\" The movie titled \"Ant-Man\" features Park, Nira, a female, in the role of a producer. Her involvement is specifically noted as a co-producer. The movie titled \"Ant-Man\" features Edgar Wright, a male, who contributed as a producer, writer, and director. His roles include being a co-producer, working on the screenplay, and directing. The movie titled \"Ant-Man\" features Joe Cornish, a male, in the role of a writer. His contribution to the film is noted as \"(screenplay)\". The movie titled \"Ant-Man\" features Jack Kirby, a male, in the role of a writer. His contribution is noted as \"(comic book)\" in the cast information. The movie titled \"Ant-Man\" features contributions from Stan Lee, a male writer, whose involvement is noted specifically as \"(comic book).\" The movie titled \"Ant-Man\" features Larry Lieber, a male, who contributed as a writer. His involvement is noted specifically as \"(comic book)\" in the cast information. The movie titled \"Ant-Man\" is categorized as a \"movie.\" In the cast information, a person named \"Thompson, Leo\" is listed under the role of \"miscellaneous crew.\" Additionally, there is a note specifying \"(assistant: Edgar Wright).\"\n\nThe movie \"Ant-Man\" is associated with several keywords that highlight its thematic and narrative elements. It is \"based-on-comic\" and \"based-on-comic-book,\" indicating its origins in graphic literature. The film involves \"biochemistry,\" suggesting a scientific aspect to its plot. The \"character-name-in-title\" keyword points to the titular character's significance. It is part of the \"marvel-cinematic-universe\" and is linked to \"marvel-comic,\" \"marvel-comics,\" and \"marvel-entertainment,\" underscoring its connection to the broader Marvel franchise. Lastly, the keyword \"superhero\" categorizes the film within the superhero genre.\n\nThe movie \"Ant-Man\" involves several production companies. These include Big Talk Productions, Marvel Enterprises, and Marvel Studios, all categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Dead Trust 2",
        "dict_description": "The movie titled \"Dead Trust 2\" is identified by the ID 1811514 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"D3623\". The MD5 checksum associated with this title is \"2738857035074a055d0fc6e40d03569f\".\n\nThe movie \"Dead Trust 2\" is a crime film produced in the UK, featuring dialogue in English. It was filmed in locations including Home Counties, England, and Italy. The film is presented in color.\n\nThe movie titled \"Dead Trust 2\" is categorized as a movie. Involved in its production is Ian Murray, a male, who served in the role of producer. His specific contribution is noted as a co-producer. The movie titled \"Dead Trust 2\" is categorized as a movie. The person associated with this title is Gertzen, Scott, who is credited in the role of writer. The cast information provided is currently empty, as indicated by an empty dictionary. The movie titled \"Dead Trust 2\" is categorized as a movie. Rick McLeod, identified as male, is associated with this film in the roles of both writer and director. The cast information includes two entries, though specific details about these entries are not provided.\n\nThe movie \"Dead Trust 2\" features a series of intense and action-packed elements, including an \"armed-stand-off,\" a thrilling \"car-chase,\" and a dramatic \"fist-fight.\" Set against the backdrop of the \"Italian Alps,\" the film delves into the world of the \"mafia\" and revolves around the theme of \"stolen-cash.\"\n\nThe movie \"Dead Trust 2\" involves the company Celtic Storm Films, which is categorized under production companies.\n\n"
    },
    {
        "title": "Cirkeln",
        "dict_description": "The movie titled \"Cirkeln\" is identified by the ID 1777091 and was released in the production year 2015. It is classified under the kind \"movie\" and has a phonetic code of C6245. The md5sum associated with this title is 3b72e3b90c0850bd12097ca5fe39fcd6.\n\nThe movie \"Cirkeln\" is a Swedish-language film released in Sweden in 2015. It is presented in color and originates from Sweden. The film belongs to the genres of Fantasy, Horror, and Mystery.\n\nThe movie titled \"Cirkeln\" features Andersson, Benny, a male, who contributed to the film in the role of a producer. His involvement is specifically noted as \"(producer)\" in the cast information. The movie titled \"Cirkeln\" is categorized as a \"movie.\" Involved in its production is Ludvig Andersson, a male, who is credited in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Cirkeln\" is categorized as a \"movie.\" Cecilia Norman is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Cirkeln\" is categorized as a movie. It involves Levan Akin, a male, who contributed as both a writer and a director. The cast information includes a note indicating \"(screenplay)\" and an additional unspecified entry. The movie titled \"Cirkeln\" features contributions from Sara Bergmark Elfgren, who is credited as a writer. Her roles include writing the novel, noted as \"(novel),\" and contributing to the screenplay, noted as \"(screenplay).\" The movie titled \"Cirkeln\" is categorized as a \"movie\" and features Mats Strandberg in the role of \"writer.\" The cast information includes a note specifying \"(novel).\"\n\nThe movie \"Cirkeln\" is associated with several keywords that define its thematic elements and setting. These keywords include \"demon,\" \"evil,\" and \"witch,\" suggesting supernatural and dark themes. The film also features the keyword \"suicide,\" indicating a potentially serious and dramatic plot point. Additionally, \"Cirkeln\" is set in \"Sweden,\" providing a geographical context. The title is characterized by the keyword \"one-word-title,\" highlighting its succinct nature.\n\nThe movie \"Cirkeln\" involves the company RMV Film, which is listed under the category of production companies.\n\nThe movie titled \"Cirkeln\" has alternate titles listed in the IMDb data. The first alternate title is \"The Circle,\" with an ID of 70639 and a movie ID of 1777091. It is categorized under kind ID 1 and was produced in the year 2015. The phonetic code for this title is C624, and it is noted as the \"(International: English title) (imdb display title).\" The md5sum associated with this entry is \"b9a9dc2809ac99f01e9d3944ad660d5f.\" The second alternate title is \"Der Zirkel,\" with an ID of 70638 and the same movie ID of 1777091. It also falls under kind ID 1 and shares the production year of 2015. The phonetic code for this title is Z624, and it is noted as \"(Germany) (imdb display title).\" The md5sum for this entry is \"9e24178996965b45548634a85ef0c548.\"\n\n"
    },
    {
        "title": "The Scorpio Races",
        "dict_description": "The movie titled \"The Scorpio Races\" is identified by the ID 2410645 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of S2616. The md5sum associated with this title is 049817b2a5b57c95d8eaabd96e3a2ea3.\n\nThe movie titled \"The Scorpio Races\" is associated with the country: USA. It falls under the genre: Fantasy.\n\nThe movie titled \"The Scorpio Races\" features Grahame-Smith, Seth, a male, in the role of producer. The cast information notes his involvement specifically as a producer. The movie titled \"The Scorpio Races\" features David Katzenberg in the role of a producer. The cast information includes a note specifying \"(producer)\". The movie titled \"The Scorpio Races\" features Maggie Stiefvater as a person involved in the project, specifically in the role of a writer. The cast info includes a note indicating \"(novel)\".\n\nThe movie titled \"The Scorpio Races\" is associated with the following keywords: \"animal-in-title,\" \"race,\" and \"three-word-title.\"\n\nThe movie \"The Scorpio Races\" involves two production companies: KatzSmith Productions and Warner Bros. Both are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Bunyan and Babe",
        "dict_description": "The movie titled \"Bunyan and Babe\" is identified by the ID 1750993 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"B531\". The md5sum associated with this title is \"b81e5e2a0990df8025f58e10113f6915\".\n\nThe movie \"Bunyan and Babe\" is an English-language film released in the USA in 2015, with a runtime of 80 minutes. It is presented in color and falls under the genres of Adventure, Animation, Comedy, Family, and Fantasy. The plot follows 12-year-old Travis Barclay and his sister Whitney, who visit their grandparents' farm in Delbert County. They encounter a greedy land developer, Norm Blandsford, who is buying up the town. Travis discovers a magic portal to Paul Bunyan's hidden world, where Bunyan has been in exile for 100 years. Bunyan, along with Babe the blue ox, helps Travis and Whitney save the town, learning that size doesn't determine one's ability to make a difference. The film's development was discussed in The Hollywood Reporter articles by Liza Foreman on September 9 and 22, 2004.\n\nThe movie titled \"Bunyan and Babe\" is categorized as a movie. In this film, Jeff Foxworthy, a male actor, provides the voice for the character Babe the Blue Ox. The cast information notes that his role is performed as a voice actor. The movie titled \"Bunyan and Babe\" is categorized as a \"movie.\" In this film, John Goodman, identified as male, is involved in the role of an \"actor.\" He provides the voice for the character \"Paul Bunyan,\" as noted in the cast information with the specification \"(voice).\" The movie titled \"Bunyan and Babe\" features Kelsey Grammer, a male actor, who plays the character Norm Blandsford. The movie titled \"Bunyan and Babe\" features Bridger Zadina, a male actor, who plays the character named Travis. The movie titled \"Bunyan and Babe\" is categorized as a movie. In this film, Dorien Davies, identified as female, is credited as an actress. She portrays the character named Iris. The cast information is provided but contains no additional details. The movie titled \"Bunyan and Babe\" features Jamée Deruso, a female, in the role of a producer. Her specific contribution to the film is noted as an associate producer. The movie titled \"Bunyan and Babe\" is categorized as a \"movie.\" John D. Eraklis, identified as male, is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Bunyan and Babe\" is categorized as a \"movie.\" Involved in its production is Max Howard, a male, who is credited with the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Bunyan and Babe\" features Darius A. Kamali, a male, in the role of a producer. His specific contribution to the film is noted as a co-executive producer. The movie titled \"Bunyan and Babe\" is categorized as a \"movie.\" John McKenna is associated with this film in the role of \"producer.\" Additionally, the cast information includes a note specifying \"(line producer).\" The movie titled \"Bunyan and Babe\" is categorized as a \"movie.\" Matthew J. Parker is associated with this film in the role of a \"producer.\" Specifically, his contribution is noted as \"(associate producer).\" The movie titled \"Bunyan and Babe\" is categorized as a \"movie.\" Michael A. Nickles, identified as male, is associated with this film in the role of \"writer.\" His contribution is noted as \"(original story and screenplay).\" The movie titled \"Bunyan and Babe\" features Julia Wall, a female, in the role of a writer. Her contribution is noted specifically as \"(screenplay)\". The movie titled \"Bunyan and Babe\" is categorized as a \"movie.\" It involves Tony Bancroft, a male, who is associated with the role of \"director.\" The cast information is provided but contains no additional details. The movie titled \"Bunyan and Babe\" features Bradley IV, Robert L. as part of the miscellaneous crew. His involvement is noted specifically as \"(video reference & epk)\". The movie titled \"Bunyan and Babe\" features Jared Chatelain, who is credited in the role of miscellaneous crew. His specific contribution is noted as \"(finance executive)\". The movie titled \"Bunyan and Babe\" features Philip A. Cruden, a male, who contributed as a production designer. The cast information section is currently empty, as indicated by the provided data.\n\nThe movie \"Bunyan and Babe\" features a variety of themes and elements as indicated by its keywords. These include \"character-name-in-title,\" highlighting the presence of a character's name in the movie's title. The film explores the concept of a \"giant,\" and delves into \"legend\" and \"myth,\" suggesting a narrative rooted in folklore. The keyword \"lumberjack\" points to a central character or theme related to this profession, while \"ox\" indicates the presence of this animal, likely significant to the story. \"Paul Bunyan\" is specifically mentioned, tying the film to this legendary figure. The inclusion of \"surrealism\" suggests an artistic or dreamlike quality to the film's presentation. Lastly, \"tall-tale\" implies a story characterized by exaggerated elements, further emphasizing the film's mythic and legendary aspects.\n\nThe movie \"Bunyan and Babe\" involves the company Exodus Film Group, which is listed under the category of production companies.\n\nThe movie \"Bunyan and Babe\" has an alternate title listed as \"Paul Bunyan,\" which is associated with the ID 61120 and the movie ID 1750993. This title is categorized under kind ID 1 and was used as a working title in the USA in the production year 2003. The phonetic code for this title is P415, and it is accompanied by the note \"(USA) (working title).\" The MD5 checksum for this entry is c264dcb41f30bcbb0bfff2c3d04b6cf7.\n\n"
    },
    {
        "title": "The Five Hundred",
        "dict_description": "The movie titled \"The Five Hundred\" is identified by the ID 2369381 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of F1536. The md5sum associated with this title is a7fdffa472fd64e0d6588c84157be201.\n\nThe movie titled \"The Five Hundred\" is associated with the country \"USA\" and falls under the genre \"Drama\".\n\nThe movie titled \"The Five Hundred\" features Matthew Quirk as a person involved in the project, specifically in the role of a writer. The cast info includes a note indicating that the work is based on a novel.\n\nThe movie \"The Five Hundred\" is associated with the keywords \"based-on-novel\" and \"number-in-title\".\n\nThe movie titled \"The Five Hundred\" involves the company Twentieth Century Fox Film Corporation, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "A Thousand Splendid Suns",
        "dict_description": "The movie titled \"A Thousand Splendid Suns\" is identified by the ID 1658768 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of T2532. The MD5 checksum associated with this title is afe2e25903ee6206ff8b611f53782bbf.\n\nThe movie \"A Thousand Splendid Suns\" has a budget of $15,000,000. It is categorized under the genre of Drama and is associated with the country USA.\n\nThe movie titled \"A Thousand Splendid Suns\" is categorized as a \"movie.\" Involved in its production is Scott Rudin, identified as male, who is listed in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"A Thousand Splendid Suns\" is categorized as a \"movie.\" Khaled Hosseini, identified as male, is associated with this film in the role of \"writer.\" His contribution is noted as \"(novel)\" with a numerical order of 0 in the cast information. The movie titled \"A Thousand Splendid Suns\" features Steven Zaillian, a male, in the roles of writer and director. The cast information includes a note indicating \"(screenplay)\".\n\nThe movie \"A Thousand Splendid Suns\" is associated with several keywords: \"afghanistan,\" \"based-on-novel,\" \"muslim,\" and \"number-in-title.\" These keywords provide insight into the film's themes and setting, indicating a connection to Afghanistan, an adaptation from a novel, elements related to Muslim culture, and a title that includes a number.\n\nThe movie \"A Thousand Splendid Suns\" involves several companies in its production and distribution. Columbia Pictures serves as the distributor. The production companies include Film Rites, Scott Rudin Productions, and Xingu Films.\n\n"
    },
    {
        "title": "Mist",
        "dict_description": "The movie titled \"Mist\" is identified by the ID 2122971 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"M23\". The md5sum associated with this title is \"48e26feb4d42959f0b611a438288141f\".\n\nThe movie \"Mist\" features the tagline \"Something is coming out of the mist.\" It is associated with the book \"Kathryn James. 'Mist'. Hodder Children's Books, 2011, (BK), 13: 978 1 444 90306 5.\" The film is produced in the UK and falls under the Family genre.\n\nThe movie titled \"Mist\" is categorized as a \"movie.\" Jez Freedman is associated with this film as a \"producer.\" Additionally, the cast information includes a note indicating \"(story editor).\" The movie titled \"Mist\" is categorized as a \"movie.\" John Goldschmidt is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Mist\" features Kathryn James as a person involved in the project, specifically in the role of a writer. The cast information includes a note indicating that the work is based on a novel.\n\nThe movie titled \"Mist\" is associated with the keyword \"based-on-novel\" according to the structured IMDb data.\n\nThe movie titled \"Mist\" involves the company Viva Films, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Cure",
        "dict_description": "The movie titled \"Cure\" is identified by the ID 1797082 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"C6\". The md5sum associated with this title is \"9f3bb761302c63554731c7457e54ef11\".\n\nThe movie \"Cure\" has a release date listed as \"USA:2015\" and falls under the genre \"Horror\".\n\nThe movie titled \"Cure\" features Michael A. Connolly in the role of a producer. The cast information includes a note indicating his role as \"(producer)\". The movie titled \"Cure\" is categorized as a \"movie\" and features Lawrence Grey, whose full name is \"Grey, Lawrence,\" in the role of a producer. The cast information includes a note specifying \"(producer)\" for his role. The movie titled \"Cure\" is categorized as a \"movie.\" A person involved in this film is Roy Lee, identified as male, who contributed in the role of a producer. The cast information includes a note specifying \"(producer).\" The movie titled \"Cure\" is categorized as a \"movie.\" John Powers Middleton is associated with this film in the role of \"producer.\" His specific contribution is noted as \"(executive producer).\" The movie titled \"Cure\" is categorized as a \"movie.\" The person associated with this title is Thorne, Beau, who is credited in the role of \"writer.\" The cast information provided is an empty list, denoted as [{}].\n\nThe movie titled \"Cure\" is associated with the keyword \"one-word-title\" according to the structured IMDb data.\n\nThe movie \"Cure\" involves two key companies: Warner Bros, which serves as a distributor, and Mad Hatter Entertainment, which functions as a production company.\n\n"
    },
    {
        "title": "Rock Your Baby",
        "dict_description": "The movie titled \"Rock Your Baby\" is identified by the ID 2247772 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"R261\". The md5sum associated with this title is \"3334f84284d90e6bc8df083b589ba436\".\n\nThe movie \"Rock Your Baby\" is a documentary filmed in Miami, Florida, USA, and is presented in English. It has a runtime of 90 minutes in the USA. The film is produced in the USA and is presented in color. The technical specifications include a high-definition aspect ratio of 1.78:1.\n\nThe movie titled \"Rock Your Baby\" is categorized as a movie. In this film, Harry Wayne Casey, a male, is credited as an actor. He plays the character \"Himself\" in the movie. The cast information is provided but contains no additional details. The movie titled \"Rock Your Baby\" features a person named Reid, Clarence, who is male. He is involved in the movie as an actor, playing the character \"Himself.\" The cast information is provided but contains no additional details. The movie titled \"Rock Your Baby\" is categorized as a \"movie.\" In this film, Henry Stone, a male, is credited as an actor. He portrays the character \"Himself.\" The cast information is provided, but no additional details are specified. The movie titled \"Rock Your Baby\" features Egber, Debra in the role of a producer. The cast info includes a note indicating her role as \"(producer)\". The movie titled \"Rock Your Baby\" features Egber, Mitchell in the role of a producer. The cast info includes a note indicating \"(producer)\". The movie titled \"Rock Your Baby\" is categorized as a movie. Mark Moormann is associated with this film, fulfilling multiple roles including producer, cinematographer, and director. The cast information specifies a note indicating his role as a producer. The movie titled \"Rock Your Baby\" features Brian Bayerl, a male, who contributed to the film as a cinematographer. The cast information provided is empty. The movie titled \"Rock Your Baby\" is categorized as a \"movie.\" Involved in its production is David Chaskes, who is credited in the role of \"editor.\" The cast information provided is currently empty, as indicated by the empty dictionary in the \"cast info\" section. The movie titled \"Rock Your Baby\" is categorized as a \"movie.\" Giovanni Costa is associated with this film in the capacity of an \"editor.\" The cast information section is provided but contains no additional details.\n\nThe movie \"Rock Your Baby\" is associated with the following keywords: \"70s-music,\" \"disco,\" and \"miami.\"\n\nThe movie \"Rock Your Baby\" involves the company Beacon Films LLC, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Fighting Back",
        "dict_description": "The movie titled \"Fighting Back\" is identified by the ID 1889249 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of F2352. The md5sum associated with this title is afa3b106369e8525f293b891af444aec.\n\n\"Fighting Back\" is an action, crime, and thriller film with a plot centered around war veteran Tom Hicks, who returns home to find his cousin murdered due to organized crime in his neighborhood. With no police leads, Tom embarks on a personal mission to confront those responsible, only to find himself in a new urban war. The movie was filmed in various locations, including Wilmington, North Carolina (2nd unit), New Mexico, Los Angeles, California (2nd unit), New Orleans, Louisiana, Santa Monica, California, and South Carolina, USA. Filming took place from May 5, 2014, to August 31, 2014. The film was released in the USA on April 24, 2015. It was shot using the Arri Alexa camera. The movie's taglines include \"Fight for what's right or brawl for it all,\" \"As one war ends, another begins,\" \"It's time to stop the rot,\" and \"A new dark urban epic saga, where Karma comes back to collect!\" The film is associated with the UK and USA.\n\nThe movie titled \"Fighting Back\" features Howy Bratherton, a male actor, who plays the character named Six. The movie titled \"Fighting Back\" features Dale Comstock, a male actor, who plays the character Cyril. The cast information is provided without additional details. The movie titled \"Fighting Back\" features Tony Graimes, a male actor, who plays the character named Stallion. The movie titled \"Fighting Back\" is categorized as a movie. In this film, Kye Loren, a male, is involved in the role of an actor. He portrays the character named Joel. The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" features Alex Martin, a male actor, in the role of Todger. The movie titled \"Fighting Back\" is categorized as a \"movie.\" In this film, Eric Martinez, a male, is involved in the role of an \"actor.\" He portrays the character named \"Bang Bang.\" The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" is categorized as a \"movie.\" In this film, Darren Matthews, identified as male, is involved in the role of an \"actor.\" He portrays the character \"Senator Dean S. Blake.\" The cast information is provided as an empty object. The movie titled \"Fighting Back\" is categorized as a \"movie.\" In this film, Mark N. Nairn, identified as male, is credited in the role of an \"actor.\" He portrays the character named \"Rizzla's Henchman.\" The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" is categorized as a \"movie.\" In this film, Thorsten Nickel, a male actor, plays the character named \"Skinhead.\" The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" features Thom Peek, a male actor, in the role of Albert. The movie titled \"Fighting Back\" features Michael Sani, a male actor, who plays the character Jeremy. The cast information is provided without additional details. The movie titled \"Fighting Back\" is categorized as a movie. In this film, Mike Sheelan, a male actor, plays the character named Kiddie. The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" is categorized as a \"movie.\" In this film, Ranjit Singh Shubh, a male, is credited in the role of an \"actor.\" He portrays the character named \"Rizzla's Henchman.\" The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" features Matt Sigloch, a male, who is involved in the production as both an actor and miscellaneous crew. In his acting role, he portrays the character named \"Gripper.\" Additionally, he contributes to the film as a military advisor, as noted in the cast information. The movie titled \"Fighting Back\" is categorized as a \"movie.\" In this film, Celine Abrahams, identified as female, is involved in the role of an \"actress.\" The cast information provided is currently empty. The movie titled \"Fighting Back\" features Jenna Goodwin, a female actress, in the role of Gail. The cast information provided is minimal, with no additional details specified. The movie titled \"Fighting Back\" is categorized as a movie. In this film, Sonita Henry, a female, is credited as an actress. She portrays the character named Cassie. The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" is categorized as a movie. In this film, Joanna King, identified as female, is credited as an actress. She portrays the character named Gabby. The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" features Eaddy Mays, a female actress, who plays the character named Stephanie. The movie titled \"Fighting Back\" is categorized as a movie. Angela Peters, identified as female, is involved in this film as an actress. She portrays the character named Janine. The cast information is provided but contains no additional details. The movie titled \"Fighting Back\" features Marian Zapico, a female actress, in the role of \"Actress.\" The structured data includes the title information with the kind specified as \"movie,\" and the person details listing Marian Zapico's name and gender as \"f.\" Her role is identified as \"actress,\" and she portrays a character named \"Actress\" in the movie. The cast info section is provided but contains no additional details. The movie titled \"Fighting Back\" is categorized as a \"movie.\" Alexander Poroso Cuenca is associated with this film in the role of \"producer.\" Specifically, he is noted as an \"(associate producer)\" in the cast information. The movie titled \"Fighting Back\" features Mark Ken Goodwin in the role of a producer. His specific contribution to the film is noted as an associate producer. The movie titled \"Fighting Back\" is categorized as a \"movie.\" Isaac Hawkins is associated with this film in the role of \"producer.\" Specifically, his contribution is noted as \"(associate producer).\" The movie titled \"Fighting Back\" is categorized as a \"movie.\" A person involved in this film is Andrew Slade, identified as male. He contributed to the film in the role of a producer, specifically noted as a \"(co-producer).\" The movie titled \"Fighting Back\" features Martin J. Thomas, a male, who contributed significantly to the film in multiple capacities. He served as a producer, writer, and director. Specifically, his roles included being a producer, writing the screenplay, contributing to the story, and directing the film. The movie titled \"Fighting Back\" is categorized as a movie. Misha Segal, identified as male, is associated with this film in the role of composer. The cast information section is provided but contains no additional details. The movie titled \"Fighting Back\" features Kelly Maracin Krieg, a female, who contributed as part of the miscellaneous crew. Her specific role was that of a script supervisor. The movie titled \"Fighting Back\" is categorized as a \"movie.\" Rachel Lippert is associated with this film in the capacity of \"miscellaneous crew,\" specifically noted as a \"production assistant.\" The movie titled \"Fighting Back\" features Martin Workman, who is credited in the role of miscellaneous crew. His specific contribution to the film is noted as a martial arts trainer.\n\nThe movie \"Fighting Back\" is rich with intense and diverse themes, featuring elements such as a \"911-telephone-call,\" \"abseiling,\" and \"action-violence.\" It explores complex characters, including an \"african-american\" and an \"anti-hero,\" and delves into issues like \"alcoholism\" and \"corruption.\" The narrative includes dramatic events like \"assassination,\" \"attempted-rape,\" and \"exploding-building,\" set against backdrops like a \"bar,\" \"cafe,\" and \"alleyway.\" The film portrays \"brutality\" and \"chaos,\" with scenes involving \"brawls,\" \"fist-fights,\" and \"hand-to-hand-combat.\" It features a \"corrupt-cop,\" \"crime-fighter,\" and \"gangster,\" with a storyline involving \"organized-crime,\" \"prison-escape,\" and \"vigilantism.\" The plot is driven by \"friendship,\" \"mother-son-relationship,\" and \"extramarital-affair,\" with a \"dark-hero\" navigating \"death,\" \"destruction,\" and \"multiple-murders.\" The setting includes \"los-angeles-california,\" with action sequences involving \"helicopter,\" \"motorcycle,\" and \"humvee.\" The film's arsenal includes \"bazooka,\" \"machine-gun,\" \"shotgun,\" and \"uzi,\" with characters like \"hitman,\" \"mob-boss,\" and \"villain.\" Themes of \"racial-prejudice,\" \"politics,\" and \"terrorism\" are explored, with a \"surprise-ending\" and \"voice-over-narration\" enhancing the narrative. The film's atmosphere is charged with \"black-humor,\" \"mercilessness,\" and \"violence,\" featuring \"police-raid,\" \"standoff,\" and \"showdown.\" The story is punctuated by \"flashback,\" \"interrogation,\" and \"torture,\" with a \"detective\" and \"doctor\" involved in the unfolding drama. The film's visual style includes \"long-take\" and \"slide-show,\" with settings like \"stadium,\" \"village,\" and \"tent.\" The narrative is further enriched by \"tv-news,\" \"tv-anchorman,\" and \"tv-monitor,\" with a \"scene-of-the-crime\" and \"morgue\" adding to the tension. The film's characters experience \"head-injury,\" \"broken-glass,\" and \"thrown-through-a-window,\" with \"cocaine-use,\" \"cigar-smoking,\" and \"alcohol\" contributing to the gritty realism. The story involves \"framed-for-murder,\" \"cover-up,\" and \"execution,\" with a \"cop-killer\" and \"sociopath\" adding to the intrigue. The film's action is heightened by \"jumping-from-height,\" \"kicked-in-the-face,\" and \"lifting-someone-into-the-air,\" with \"jiu-jitsu,\" \"kung-fu,\" and \"mixed-martial-arts\" showcasing the physical prowess of its characters. The narrative is driven by \"money,\" \"robbery,\" and \"prison,\" with \"police-internal-affairs,\" \"police-chief,\" and \"senator\" adding layers of complexity. The film's emotional depth is conveyed through \"crying,\" \"jealous-wife,\" and \"death-of-loved-one,\" with \"friendship-between-men\" and \"tough-guy\" dynamics. The story's tension is heightened by \"held-at-gunpoint,\" \"shot-multiple-times,\" and \"shot-to-death,\" with \"grenade,\" \"rpg,\" and \"silencer\" adding to the arsenal. The film's style is marked by \"leather-jacket,\" \"high-heels,\" and \"tattoo,\" with \"obscene-finger-gesture\" and \"gay-slur\" reflecting its raw edge. The narrative's complexity is enhanced by \"flashback-within-a-flashback,\" \"one-against-many,\" and \"one-man-army,\" with \"right-wing,\" \"president,\" and \"senator\" adding political intrigue. The film's setting includes \"police-station,\" \"hospital,\" and \"prison,\" with \"bouncer,\" \"henchman,\" and \"enforcer\" populating its world. The story's climax involves \"showdown,\" \"standoff,\" and \"surprise-ending,\" with \"chaos,\" \"destruction,\" and \"violence\" driving the narrative to its conclusion.\n\nThe movie \"Fighting Back\" involves several production companies, specifically Goliath Studios, Reaching For Stars, Service Man Movie, and We-Dat Management. Each of these entities is categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Amorous",
        "dict_description": "The movie titled \"Amorous\" is identified by the ID 1682650 and was produced in the year 2015. It has a phonetic code of A562 and an md5sum of a89f31fd3891f58c401ff9d2cbcaea86. This entry is categorized under the kind \"movie.\"\n\nThe movie \"Amorous\" is categorized under the genre of Drama and is produced in the USA.\n\nThe movie titled \"Amorous\" is a film where J.J. Alani is credited as a producer, writer, and director. The cast information specifies J.J. Alani's roles with notes indicating \"(producer)\" and \"(written by)\" for the respective roles, while the director role is noted without additional specification. The movie titled \"Amorous\" features Jennifer Nash, a female, in the role of a producer. Her involvement in the film is specifically noted as a co-producer. The movie titled \"Amorous\" features Sandra Valde-Hansen, who contributed as both a producer and a cinematographer. Her role as a producer is specifically noted as \"(associate producer)\". The movie titled \"Amorous\" is categorized as a \"movie.\" Involved in its production is Phillip J. Bartell, identified as male, who contributed in the role of \"editor.\" The cast information is provided as an empty list.\n\nThe movie \"Amorous\" explores a wide array of intense and complex themes. It delves into relationships, highlighting a \"best-buddy-relationship\" and the dynamics of \"love,\" \"jealousy,\" and \"passion.\" The narrative is marked by \"betrayal,\" \"grief,\" and \"prejudice,\" with characters facing challenges such as being a \"cancer-patient\" and dealing with \"mistaken-identity.\" The film includes elements of \"dance,\" \"music\" with a \"musician,\" and a \"magic-lamp,\" adding a \"surreal\" touch. It addresses dark themes like \"murder,\" \"rape,\" \"gang-rape,\" \"honor-killing,\" \"sorocide,\" \"violence,\" and \"violent-abuse,\" with a \"vigilante\" aspect. The story also involves \"incest,\" \"voyeur\" behavior, and \"voyeurism,\" with scenes of \"female-nudity,\" \"male-nudity,\" and \"partial-nudity.\" An \"old-man-in-wheelchair\" and a \"reference-to-superman\" add unique character elements. The film's exploration of \"violent-abuse\" and \"voyeur\" behavior further intensifies its dramatic narrative.\n\nThe movie \"Amorous\" involves several production companies. These include \"Films International Corporation,\" \"Group Entertainment, The,\" and \"Newroz Films,\" all categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Payne & Redemption",
        "dict_description": "The movie titled \"Payne & Redemption\" is identified by the ID 2195066 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of P5635. The MD5 checksum associated with this title is 92f28f98cb2d6f780547728e22046c89.\n\n\"Payne & Redemption\" is an independent film by Fergle Gibson, released in the UK on July 1, 2015, in London. The film, shot in Surrey, England, UK, is in English and runs for 120 minutes. It was filmed using CAM: Arriflex D-20 and CAM: Red Epic, with a 2.39:1 aspect ratio. The movie, distributed for free online, explores the psychological trauma of a weathered New York Detective seeking redemption. Initially conceived as a 20-minute short, it was expanded to six short films before financial issues led to a single feature-length piece. The production faced challenges, including a cease and desist from 20th Century Fox over the use of the \"Max Payne\" name, leading to its removal. Approximately 1260 hours were spent on storyboards, which were condensed from 350 to 150 shots, none of which were used in the final shoot. The original storyboard artist, Roger Williams, left after finding the script \"sick and perverted.\" The film's budget was £200,000. It falls under the genres of Action, Crime, Drama, Horror, and Thriller, and is inspired by the creative works of Sam Lake. The tagline highlights \"One Cop, a Full Clip, and a Whole Lotta Painkillers.\" The film is in color and originates from the UK.\n\nThe movie titled \"Payne & Redemption\" features Nigel Billing, a male actor, in the role of \"The Detective.\" In the cast list, he is listed with a numerical order of 1. The movie titled \"Payne & Redemption\" features Nigel Billing, a male actor, in the role of \"The Detective.\" The movie titled \"Payne & Redemption\" features Richard Brake, a male actor, who is rumored to play the character Lenny. His role is listed with a note indicating \"(rumored)\" and is ordered sixth in the cast information. The movie titled \"Payne & Redemption\" features John Mangan, a male, who contributes as both an actor and a producer. In the film, he portrays the character Dr. Clarence Volpé. His involvement in the cast is noted with a numerical order of 3, and he holds the additional role of a consulting producer. The movie titled \"Payne & Redemption\" features James McCaffrey, a male actor, in the role of \"The Voice.\" His involvement in the film is noted as \"(rumored)\" and he appears fifth in the order of cast listing. The movie titled \"Payne & Redemption\" is categorized as a movie. In this film, Bill Nighy, a male actor, is associated with the role of \"Coroner.\" His involvement is noted as \"(rumored)\" and he appears in the cast with a numerical order of 7. The movie titled \"Payne & Redemption\" is categorized as a movie. In the cast, David Soul, a male actor, is associated with the role of Deputy Chief Jim Coraggio. His involvement in this role is noted as \"(rumored)\" and he appears fourth in the order of cast listing. The movie titled \"Payne & Redemption\" features Kylie Cushman, a female actress, in the role of Detective Jessica Logan. In the cast list, her order number is 2. The movie titled \"Payne & Redemption\" is categorized as a movie. Fergle Gibson is associated with this film in multiple capacities, including as a producer, producer, writer, cinematographer, director, and production designer. Specifically, his roles as a producer are further detailed with notes indicating he served as an executive producer and a producer. The movie titled \"Payne & Redemption\" is categorized as a \"movie.\" Dewi Morgan is associated with this film in the role of \"producer.\" Specifically, Dewi Morgan's contribution is noted as \"(associate producer).\" The movie titled \"Payne & Redemption\" is categorized as a \"movie.\" A person involved in this project is Luke Morgan-Rowe, who is credited as a \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Payne & Redemption\" is categorized as a \"movie.\" Piers Leigh is associated with this film in the role of \"cinematographer.\" The cast information provided is currently empty, as indicated by the empty dictionary in the \"cast info\" section. The movie titled \"Payne & Redemption\" is categorized as a \"movie.\" Involved in this project is Justin R. Durban, a male, who contributed in the role of \"composer.\" The cast information section is currently empty, as indicated by the presence of an empty dictionary. The movie titled \"Payne & Redemption\" is categorized as a \"movie.\" Matteo Pizzarello is associated with this film in the role of \"editor.\" The cast information section is provided but contains no additional details. The movie titled \"Payne & Redemption\" features Tanith Gibson, who is credited in the role of miscellaneous crew. Her specific contribution to the film is noted as a caterer. The movie titled \"Payne & Redemption\" features Anthony Southby, who is credited in the role of miscellaneous crew. His specific contribution is noted as \"(handyman)\".\n\nThe movie \"Payne & Redemption\" is associated with several distinct keywords that define its thematic and stylistic elements. These keywords include \"anti-hero,\" highlighting a protagonist with unconventional moral qualities; \"detective,\" indicating a focus on investigative elements; and \"hard-boiled,\" suggesting a gritty, tough narrative style. It is categorized as an \"independent-film,\" emphasizing its production outside the major studio system, and \"neo-noir,\" reflecting a modern take on the classic film noir genre. The setting is \"New York,\" providing a specific urban backdrop, and the theme of \"revenge\" is central to its plot.\n\nThe movie \"Payne & Redemption\" involves the company Visual Fizzle, which is categorized under production companies.\n\nThe movie titled \"Payne & Redemption\" has an alternate title, \"Max Payne: Payne & Redemption,\" with the ID 234237 and is associated with the movie ID 2195066. This title is categorized under kind ID 1 and was part of the production year 2012. It carries the phonetic code M2151 and is noted as the \"(UK) (original script title).\" The MD5 checksum for this entry is 7ca6af37f38221fd44ca760dfe03919a.\n\n"
    },
    {
        "title": "Breath of God",
        "dict_description": "The movie titled \"Breath of God\" is identified by the ID 1745213 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of B6312. The MD5 checksum associated with this title is 2a0c5868d534e516a9c8dd96b881c41c.\n\n\"Breath of God\" is a film released in the USA in 2015, presented in English and in color. It falls under the genres of Biography, Drama, and History. The movie's tagline is \"In a time when men ruled the earth, she brought power from the Heavens...\" The plot centers on Hildegard von Bingen, a revolutionary thinker from 1098-1179, who was tithed to a Catholic monastery at age eight. She led a community of nuns, authored theological and scientific books, including the first treatises by a woman on feminine sexuality, and composed over seventy-seven songs and poems. Hildegard founded two Benedictine monasteries and maintained complex relationships with popes, kings, and bishops, while sharing a spiritual bond with her teacher, Volmar. The screenplay, written by Jeanne Marie Spicuzza, was inspired by her encounter with Hildegard while working at a classical music store. It took seven years of research and three years of writing to complete. \"Breath of God\" was blessed by Pope John Paul II, honored by the Vatican Division of Arts and Culture, and was a semifinalist in the Academy of Motion Picture Arts and Sciences Nicholl Fellowships. Segments of the film are permanently exhibited at the Brooklyn Museum's Elizabeth A. Sackler Center for Feminist Art, alongside Judy Chicago's \"The Dinner Party.\"\n\nThe movie titled \"Breath of God\" features Jeanne Marie Spicuzza, a female, who is involved in multiple roles including actress, producer, and writer. In the film, she portrays the character Hildegard. The cast information includes her roles as an actress, a producer (noted as \"(producer)\"), and a writer. The movie titled \"Breath of God\" is categorized as a movie. The person associated with this title is von Bingen, Hildegard, who is credited in the role of composer. The cast information provided is currently empty, as indicated by the empty dictionary in the cast info section. The movie titled \"Breath of God\" features Heidrun Reshöft as part of the miscellaneous crew. Her specific role is noted as a production consultant.\n\nThe movie \"Breath of God\" is associated with several keywords that encapsulate its themes and setting. These keywords include \"bingen,\" \"catholic,\" and \"divine,\" suggesting a religious or spiritual context. The narrative may involve a \"hero's-journey,\" possibly centered around a character named \"hildegard.\" Themes of \"love\" and \"passion\" are also prominent, set against the backdrop of \"medieval-times.\" Each keyword provides a glimpse into the film's core elements and narrative focus.\n\nThe movie \"Breath of God\" involves two production companies: Balzer International Films (BIF) Ltd. and seasons & a muse. Both companies are listed under the type \"production companies.\"\n\n"
    },
    {
        "title": "Mean Gene",
        "dict_description": "The movie titled \"Mean Gene\" is identified by the ID 2109682 and was produced in the year 2015. It has a phonetic code of \"M525\" and an md5sum of \"77cba616e4d90ef0d6604397e942e666\". This entry is categorized under the kind \"movie\".\n\n\"Mean Gene\" is a film set in the USA and Australia, exploring a small rural town during societal collapse. The plot follows a man named Gene, who battles personal demons and faces an uncertain future while confronting his past. A newfound thirst for justice propels him into a perilous journey against a crazed cult involved in crystal meth and alternative fuel production. Chaos ensues when the cult liberates their veteran psychopath leader from a prison transport, prompting Gene to aid the law in quelling the violence. Captured and forced into a gladiatorial demolition derby event, Gene collaborates with a veteran and a stranger to survive. The film, categorized under the genres of Action, Drama, and Fantasy, is set in the USA.\n\nThe movie titled \"Mean Gene\" features Gar Rogala, a male actor, in the role of Gene Russet. His involvement in the film is noted as \"(rumored)\".\n\nThe movie \"Mean Gene\" is associated with the keywords \"independent-film\" and \"unknown\" according to the structured IMDb data.\n\nThe movie \"Mean Gene\" involves the company Brigade Pictures, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Bad Girls",
        "dict_description": "The movie titled \"Bad Girls\" is identified by the ID 1708838 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"B3264\". The md5sum associated with this title is \"9181b9a17acb83cf3453cba39016db0c\".\n\nThe movie \"Bad Girls\" was released in the USA in 2015. It falls under the genre of Thriller.\n\nThe movie titled \"Bad Girls\" is categorized as a \"movie.\" Involved in its production is Adam Goldworm, who is listed under the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Bad Girls\" features contributions from Alex McAulay, who is credited as a writer in two distinct roles. The first role is noted as \"(novel)\" and the second as \"(screenplay)\".\n\nThe movie \"Bad Girls\" features a variety of themes and settings, including a \"drug-dealer,\" a \"killer,\" and a \"reform-school.\" The narrative unfolds on a \"remote-island\" and involves elements of \"school\" life. Central to the story are \"teenage-girl\" characters, with a focus on \"teenager\" experiences.\n\nThe movie titled \"Bad Girls\" involves two production companies: Aperture Entertainment and Inferno Entertainment. Both companies are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "The Jane Austen Marriage Manual",
        "dict_description": "The movie titled \"The Jane Austen Marriage Manual\" is identified by the ID 2381398 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"J5235\". The MD5 checksum associated with this title is \"c9c87fd8f98d891bac73d39909d122d6\".\n\n\"The Jane Austen Marriage Manual\" is a comedy and romance film from Canada. The plot revolves around Kate Shaw, an acting beauty editor for a fashion magazine, who faces unemployment as she approaches forty due to cutbacks. Suddenly single and homeless, she must support her family through financial and emotional turmoil. Known for her passion for Jane Austen, Kate lands a freelance assignment to explore the feasibility of marrying well in modern times and at her age. This task evolves into a personal journey, taking her from West Palm Beach's polo fields to London's high society. Mistaken for an aristocrat, she pursues a sophisticated older financier but frequently encounters Griffith Saunderson, a brooding Englishman at an Austenesque estate. Torn between wealth and potential true love, Kate must decide whether to marry for money or risk everything for love. This plot is noted by HarperCollins Publishers Ltd.\n\nThe movie titled \"The Jane Austen Marriage Manual\" features Don Carmody, a male, in the role of a producer. His specific contribution to the film is noted as an executive producer. The movie titled \"The Jane Austen Marriage Manual\" features David Cormican, a male, in the role of a producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"The Jane Austen Marriage Manual\" features Tonya Lee Williams, a female, in the role of a producer. Her involvement in the film is specifically noted as an executive producer. The movie titled \"The Jane Austen Marriage Manual\" features Kim Izzo in the role of a writer. The cast information includes a note specifying \"(writer)\".\n\nThe movie \"The Jane Austen Marriage Manual\" is associated with several keywords: \"based-on-novel,\" \"chick-flick,\" \"economic-recession,\" and \"jane-austen.\" These keywords highlight the film's literary origins, its appeal to a specific audience, its thematic exploration of financial challenges, and its connection to the renowned author Jane Austen.\n\nThe movie titled \"The Jane Austen Marriage Manual\" involves two production companies: Don Carmody Productions and Up, Up, And Away. Both are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "Soldier of the Legion",
        "dict_description": "The movie titled \"Soldier of the Legion\" is identified by the ID 2298764 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"S4361\". The md5sum associated with this title is \"62e5ccaccee53bf96e835a5bac80f3ba\".\n\n\"Soldier of the Legion\" is a Sci-Fi and War film produced in the USA, presented in English and in color. The movie utilizes CAM: Arriflex Cameras and Lenses, noted for its 3D capabilities, and is formatted in PCS: IMAX 3-D. The plot, anonymously contributed, describes a galaxy divided between the System, the Slave Empire, and the Confederation of Free Worlds (ConFree), with the Legion as the sole hope for peace amidst looming extinction. The story is based on the novel \"Soldier of the Legion\" by Marshall S. Thomas, published by Ridan Publishing on 2 May 2010, with ISBN-10: 0982514565.\n\nThe movie titled \"Soldier of the Legion\" features Josh Monkarsh in the role of a producer. The cast information includes a note specifying \"(producer)\". The movie titled \"Soldier of the Legion\" is categorized as a \"movie.\" The person associated with this film is K. Asher Levin, identified as male, who contributed as a writer. The cast information specifies that Levin's role included writing the screenplay, as noted by \"(screenplay).\" The movie titled \"Soldier of the Legion\" features Marshall S. Thomas as a person involved in the project, specifically in the role of a writer. The cast information includes a note indicating \"(novel)\" with an order number of 1. The movie titled \"Soldier of the Legion\" is categorized as a movie. Michael Polish, identified as male, is associated with this film in the role of director. The cast information includes a note indicating \"(attached)\".\n\nThe movie \"Soldier of the Legion\" is associated with the keyword \"based-on-novel\" according to the structured IMDb data.\n\nThe movie \"Soldier of the Legion\" involves the company Traffic City Productions, which is categorized under production companies.\n\n"
    },
    {
        "title": "Nebulus",
        "dict_description": "The movie titled \"Nebulus\" is identified by the ID 2148250 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"N142\". The MD5 checksum associated with this title is \"e0cc4574e3db7921fb2a3bd43907419e\".\n\n\"Nebulus\" is a film released in the USA in November 2015, with production dates starting from January 10, 2011. The movie is in English and was filmed in Texas, Arizona, and Los Angeles, California, USA. It features a Dolby Digital sound mix with RCA Sound Recording and is presented in color with a technical aspect ratio of 2.35:1. The plot follows an interplanetary expedition uncovering the truth behind their crash landing on a new world after Earth's destruction, while being pursued by familiar alien life forms. The tagline for the movie is \"Mankind is Just a Memory...\" and it belongs to the genres of Action, Adventure, Sci-Fi, and Thriller. The script is a loose adaptation of the public domain short story \"Shell Game\" by Phillip K. Dick. The film is from the USA.\n\nThe movie titled \"Nebulus\" is categorized as a movie. In this film, Frederic Doss, identified as male, is involved in the role of an actor. He portrays the character named Rains. The cast information is provided but contains no additional details. The movie titled \"Nebulus\" is categorized as a \"movie.\" In the cast, Dee Martin, identified as male, is associated with the role of \"actor.\" His involvement in the film is noted as \"(rumored).\" The movie titled \"Nebulus\" features McKnight, Michael, a male actor, in the role of Rolento. His involvement in the film is noted as \"(rumored)\". The movie \"Nebulus\" features Brandon Slagle, a male, who is involved in multiple roles including actor, producer, and writer. In the film, he portrays the character Crowe. His contributions are noted as (producer) and (written by). The movie titled \"Nebulus\" is categorized as a movie. Devanny Pinn, a female, is involved in this film as both an actress and a producer. In her acting role, she portrays a character named Indigenous. Her involvement as a producer is noted in the cast information. The movie titled \"Nebulus\" features Liz Cuppie in the role of a producer. The cast information includes a note specifying her role as \"(producer)\". The movie titled \"Nebulus\" features contributions from Philip K. Dick, a male writer. His involvement is noted for the short story \"Shell Game.\" The movie titled \"Nebulus\" is categorized as a \"movie.\" In the cast information, Isaias Garcia, identified as male, is associated with the role of \"composer.\" Notably, this role is marked with the note \"(rumored).\" The movie titled \"Nebulus\" is categorized as a movie. It involves Brian T. Jaynes, a male, who is associated with the role of director. The cast information is provided but contains no additional details. The movie titled \"Nebulus\" features Jean-Pierre Lefevre in the role of production designer. The structured data includes the title information with the title \"Nebulus\" and kind \"movie\", and the person information with the name \"Lefevre, Jean-Pierre\". The role is listed as [\"production designer\"], and the cast info section is represented by an empty dictionary [{}].\n\nThe movie \"Nebulus\" is associated with a variety of intriguing keywords that paint a vivid picture of its themes and setting. It features elements such as \"alien\" and \"alien-planet,\" suggesting an extraterrestrial backdrop. The narrative seems to delve into catastrophic events with keywords like \"apocalypse,\" \"armageddon,\" and \"end-of-the-world,\" hinting at a storyline involving large-scale destruction and possibly a \"new-beginning.\" The presence of \"atmosphere,\" \"habitat,\" \"ocean,\" \"planet,\" and \"vegetation\" indicates a richly detailed environment, possibly with \"multiple-suns.\" Characters and conflicts are suggested by terms like \"creature,\" \"dictator,\" \"dual-personality,\" \"killer,\" \"monster,\" \"mutant,\" and \"mythic,\" which imply a diverse cast and complex interactions. The plot may involve intense actions such as \"extermination,\" \"kill,\" and \"murder,\" possibly driven by \"nuclear-weapons.\" Themes of \"pregnancy\" and \"settlement\" suggest elements of survival and continuity. Overall, \"Nebulus\" appears to weave a tale of survival and conflict on a richly imagined alien world.\n\nThe movie \"Nebulus\" involves several companies in its production and distribution. Zeroinside Films serves as both a distributor and a production company. Additionally, Pinnovating Productions is involved as a production company.\n\nThe movie titled \"Nebulus\" has alternate titles listed in the IMDb data. One of these is \"Shell Game,\" identified by the ID 217780 and associated with the movie ID 2148250. This title is categorized under kind ID 1 and was produced in the year 2015. It is noted as an alternative title in the USA, with a phonetic code of S425 and an MD5 checksum of bf06b7d1aceb28bdf9ef207025887caa. Another alternate title is \"Glitch,\" with the ID 217779, also linked to the movie ID 2148250. This title falls under the same kind ID 1 and was associated with the production year 2012. It is noted as the original script title in the USA, with a phonetic code of G432 and an MD5 checksum of 401b0784afbd414261d88657b87aebde.\n\n"
    },
    {
        "title": "Automaton Transfusion 2",
        "dict_description": "The movie titled \"Automaton Transfusion 2\" is identified by the ID 1703745 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of A3535. The md5sum associated with this title is 1cfd5a8e6f52ee6155802e66d51dda18.\n\nThe movie \"Automaton Transfusion 2\" is an English-language film released in the USA on 9 November 2015. It was produced with a budget of $15,000,000 and is presented in color. The film originates from the USA and belongs to the genres of Action and Horror.\n\nThe movie titled \"Automaton Transfusion 2\" is categorized as a movie. In this film, Garrett Jones, a male actor, plays the character named Chris. The cast information provided is minimal, with no additional details specified. The movie titled \"Automaton Transfusion 2\" features Juliet Reeves, a female actress, who plays the character named Jackie. The movie titled \"Automaton Transfusion 2\" is categorized as a movie. Involved in its production is William Clevinger, a male, who is credited in the role of producer. The cast information includes a note specifying his role as \"(producer)\". The movie titled \"Automaton Transfusion 2\" is categorized as a movie. Adam Goldworm is associated with this film in the role of a producer. The cast information includes a note specifying his role as \"(producer)\". The movie titled \"Automaton Transfusion 2\" is categorized as a movie. In the production team, Mark Thalman is credited as a producer. Specifically, he holds the role of an executive producer, as noted in the cast information. The movie titled \"Automaton Transfusion 2\" is categorized as a movie. Steven C. Miller, identified as male, is associated with this film as both the writer and director. The cast information includes a note indicating \"(story)\" and an additional unspecified entry.\n\nThe movie titled \"Automaton Transfusion 2\" is associated with the keyword \"sequel\" according to the structured IMDb data.\n\nThe movie \"Automaton Transfusion 2\" involves two production companies: Aperture Entertainment and Through the Heart. Both companies are categorized under the type \"production companies.\"\n\nThe movie titled \"Automaton Transfusion 2\" has an alternate title listed as \"Automaton Transfusion: Contingency.\" This title is associated with the ID 46597 and the movie ID 1703745. It is categorized under kind ID 1 and was produced in the year 2009. The phonetic code for this title is A3535. It is noted as the working title in the USA. The MD5 checksum for this entry is d3b3eb0d28a77ec488161e4bb8992482.\n\n"
    },
    {
        "title": "Kung Fu Panda 3",
        "dict_description": "The movie titled \"Kung Fu Panda 3\" is identified by the ID 2028524 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"K5215\". The md5sum associated with this title is \"724dfda2c6f524bc30abd763034bedce\".\n\nThe movie \"Kung Fu Panda 3\" was released in the USA on 23 December 2015. It is presented in color and is associated with the countries USA and China. The film spans multiple genres, including Action, Adventure, Animation, Comedy, and Family.\n\nThe movie titled \"Kung Fu Panda 3\" features Jack Black, a male actor, who plays the character Po. His role is specified as an actor, and his performance is noted as \"(voice)\". The movie titled \"Kung Fu Panda 3\" is categorized as a \"movie.\" In this film, Bryan Cranston, identified as male, is involved in the role of an \"actor.\" His contribution to the movie is specified with the note \"(voice).\" In the movie \"Kung Fu Panda 3,\" which is categorized as a movie, David Cross, a male, is listed as an actor. He is associated with the character named Crane. The cast information includes a note indicating his role is \"(voice) (rumored).\" The movie titled \"Kung Fu Panda 3\" features Dustin Hoffman, a male actor, who is associated with the character Shifu. His involvement is noted as \"(voice) (rumored)\". The movie titled \"Kung Fu Panda 3\" features Mads Mikkelsen, a male actor, in the cast. His role is specified as an actor, and he provides his voice for the film, as indicated by the note \"(voice)\". The movie titled \"Kung Fu Panda 3\" features Seth Rogen, a male actor, who provides the voice for the character Mantis. His role is noted specifically as \"(voice)\" in the cast information. The movie titled \"Kung Fu Panda 3\" is categorized as a movie. In this film, Angelina Jolie, identified as female, contributes her talent in the role of an actress. She voices the character named Tigress, as noted in the cast information, which specifies her contribution as \"(voice)\". The movie titled \"Kung Fu Panda 3\" is categorized as a movie. In this film, Lucy Liu, a female, is involved as an actress. She portrays the character named Viper. Her participation is noted as \"(voice) (rumored)\" in the cast information. The movie titled \"Kung Fu Panda 3\" is categorized as a \"movie.\" In this film, Rebel Wilson, identified as female, contributes her talent as an \"actress.\" Her role is specified as a voice performance, as indicated by the note \"(voice).\" The movie titled \"Kung Fu Panda 3\" features Melissa Cobb, a female, in the role of a producer. Her involvement is noted specifically as \"(producer)\". The movie titled \"Kung Fu Panda 3\" features Guillermo del Toro, a male, in the role of a producer. His specific contribution to the film is noted as an executive producer. The movie titled \"Kung Fu Panda 3\" features Jonathan Aibel as a writer, with his role specifically noted as \"(screenplay)\". The movie titled \"Kung Fu Panda 3\" features Glenn Berger as a writer. His role is specified with the note \"(screenplay)\". The movie titled \"Kung Fu Panda 3\" is categorized as a \"movie.\" It features Jennifer Yuh, a female, in the role of \"director.\" The cast information section is currently empty, as indicated by the provided data. The movie titled \"Kung Fu Panda 3\" features Katherine Shine Hery as part of the miscellaneous crew. Her role is noted as \"(production staff)\".\n\nThe movie \"Kung Fu Panda 3\" features a variety of elements as indicated by its keywords. Set in \"ancient China,\" it includes \"animal-in-title\" and \"anthropomorphic-animal\" themes, showcasing \"anthropomorphism.\" The setting is \"China,\" and it is a \"DreamWorks animated film.\" The film involves \"fist-fight,\" \"kung-fu,\" and \"martial-arts,\" with a focus on a \"panda.\" It is a \"sequel\" and the \"third-part\" of its series. The character \"Tigress\" is featured, and the film is \"title-directed-by-female.\" Additionally, it incorporates the \"wuxia\" genre.\n\nThe movie \"Kung Fu Panda 3\" involves several companies in its production and distribution. The film is distributed by Twentieth Century Fox Film Corporation. It is produced by two companies: DreamWorks Animation and Oriental DreamWorks.\n\n"
    },
    {
        "title": "Hundred Degrees in the Shade",
        "dict_description": "The movie titled \"Hundred Degrees in the Shade\" is identified by the ID 1963857 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"H5363\". The md5sum associated with this title is \"3cd7990cf4b555ac407b72a9598e931d\".\n\n\"Hundred Degrees in the Shade\" is a film that blends the genres of Comedy, Drama, and Romance. The plot, noted by Drue Johnson Lee, revolves around Whit, who returns to his Alabama hometown thirty years after deliberately losing a high school championship football game, an act that metaphorically castrated the town's spirit. Fleeing from a painful divorce, Whit inadvertently embarks on a journey of self-discovery and rekindles his relationship with his aging father, Pap. The movie is set in the USA.\n\nThe movie titled \"Hundred Degrees in the Shade\" is categorized as a movie. Theule, Shannon, identified as male, is associated with this film in the roles of producer and director. The cast information includes a note specifying \"(producer)\" for one of the roles, while the other role is listed without additional notes. The movie titled \"Hundred Degrees in the Shade\" features Teresa Ledbetter Cammack as a writer. Her role is specified as \"writer\" with a note indicating her contribution as \"(screenplay)\". The movie titled \"Hundred Degrees in the Shade\" is categorized as a \"movie.\" Drue Johnson Lee is associated with this film in the capacity of a \"writer.\" The cast information specifies that the role includes a note indicating \"(screenplay).\" The movie titled \"Hundred Degrees in the Shade\" features James Chambliss, a male, as part of the miscellaneous crew. His specific role is noted as the location manager.\n\nThe movie \"Hundred Degrees in the Shade\" is associated with several keywords that encapsulate its themes and setting. These keywords include \"country,\" highlighting a rural or national aspect, and \"football,\" suggesting a focus on the sport. The keyword \"heat\" indicates a significant temperature element, while \"memory\" and \"past\" suggest themes of recollection and history. The setting is further defined by \"small-town,\" pointing to a localized, intimate environment. Lastly, \"sweat\" emphasizes the physical response to the heat, contributing to the film's atmospheric conditions.\n\nThe movie \"Hundred Degrees in the Shade\" involves two production companies: ImagiCon Entertainment and Magnolialand Entertainment. Both companies are categorized under the type \"production companies.\"\n\n"
    },
    {
        "title": "The Matchup",
        "dict_description": "The movie titled \"The Matchup\" is identified by the ID 2392777 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"M321\". The md5sum associated with this title is \"62269e2b266753b64f0cb85656769280\".\n\n\"The Matchup\" was released in the USA in 2015. The film is based on Jim Waltzer's book, \"The Battle of the Century: Dempsey, Carpentier and the Birth of Modern Promotion,\" published by Praeger. The novel version, also by Jim Waltzer, titled \"The Battle of the Century: Dempsey, Carpentier, and the Birth of Modern Promotion,\" was published in 2011, appearing on page 238, with ISBN-13: 978-0-313-38244-4. The plot, noted by an anonymous source, involves heavyweight champion Jack Dempsey, accused by his prostitute-wife of being a draft dodger during World War I, facing French war hero Georges Carpentier in Tex Rickard's first million-dollar gate, marking a significant event in sports promotion history. The movie is set in France, the UK, and the USA, and spans the genres of Biography, Drama, History, and Sport.\n\nThe movie titled \"The Matchup\" features Chelsea Bishop, who is credited as a producer. Her specific role is noted as \"(assistant producer)\" in the cast information. The movie titled \"The Matchup\" features Alexander Emmert, a male, who contributed as both a producer and a writer. His roles are specified with notes indicating his involvement as a producer and in the story and screenplay. The movie titled \"The Matchup\" features Ivins, Zaughn Elizabeth, a female, in the role of producer. Her specific contribution is noted as \"(assistant producer)\". The movie titled \"The Matchup\" features Daria Walsh in the role of a producer. Her involvement is specifically noted as a co-producer. The movie titled \"The Matchup\" features Jim Waltzer as a key contributor. He is credited in the roles of \"writer\" and \"writer\" for this film. His contributions are specifically noted as \"(book)\" and \"(co-writer)\" in the cast information.\n\nThe movie \"The Matchup\" features a range of themes and elements, including \"boxing,\" \"fight-promoter,\" and \"jack-dempsey.\" It delves into \"sports-history\" and centers around a \"title-fight.\"\n\nThe movie titled \"The Matchup\" involves several companies in its production. Specifically, it is associated with three production companies: Invictus Films, Noir Worldwide, and Paddock Pictures.\n\n"
    },
    {
        "title": "My Duty",
        "dict_description": "The movie titled \"My Duty\" is identified by the ID 2137880 and was produced in the year 2015. It has a phonetic code of \"M3\" and an md5sum of \"88ab0d71112c3bfed0f70885fdbb2263\". This entry is categorized under the kind \"movie\".\n\nThe movie \"My Duty\" is a UK production released in 2015, with a runtime of 185 minutes. It features a plot centered on an old man in a care home who befriends his carer and recounts his life story, detailing his experiences as an infantry soldier during World War II and his challenges in readjusting to civilian life with his family. The film is presented in color and spans multiple genres, including Action, Biography, Drama, and War. It was filmed in various locations such as London, England, UK; Berlin, Germany; Rome, Lazio, Italy; Algeria; and Morocco. The languages spoken in the film are English, German, Italian, and Afrikaans. The tagline for the movie is \"We fought for freedom and democracy...We achieved no such thing,\" and it had a budget of £25,000,000.\n\nThe movie titled \"My Duty\" features Jay Cosme, a male, who is involved in multiple roles including actor, producer, writer, and director. In the film, he portrays the character John Jones. The cast information includes a note indicating his role as a producer and another note stating he is attached to the project. The movie titled \"My Duty\" is categorized as a movie. Charly Mae Nelson, identified as female, is associated with this film in the roles of both producer and director. The cast information includes notes indicating her involvement as a producer and that she is attached to the project.\n\nThe movie \"My Duty\" features a series of intense and action-packed elements, including a \"battle,\" a \"bomb,\" a \"gun,\" and a \"soldier.\" These keywords encapsulate the core themes and pivotal aspects of the film, highlighting its focus on warfare and military engagement.\n\nThe movie \"My Duty\" involves the company ProductiveFilm in two distinct roles: as a distributor and as a production company.\n\n"
    },
    {
        "title": "The Last Day",
        "dict_description": "The movie titled \"The Last Day\" is identified by the ID 2384233 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"L23\". The MD5 checksum associated with this title is \"192999989e22cdd6a383dc4f7bff5ae6\".\n\nThe movie \"The Last Day\" was released in the USA in 2015. It had a budget of $10,000,000. The film belongs to the genres of Action, Horror, and Sci-Fi.\n\nThe movie titled \"The Last Day\" features Bobby Breed in the role of a producer. His involvement is specifically noted as a co-producer. The movie titled \"The Last Day\" features Jimmy Bridges, a male, in the role of producer. His involvement is noted specifically as \"(producer)\" in the cast information. The movie titled \"The Last Day\" features Cassandra Cooper in the role of a producer. Specifically, she is credited as an executive producer. The movie titled \"The Last Day\" features Jason Durdon, a male, in the role of a producer. His involvement is noted specifically as \"(producer)\". The movie titled \"The Last Day\" features James Duval, a male, who contributed as both a producer and a writer. His roles are specified with notes indicating he served as an executive producer and a writer. The movie titled \"The Last Day\" features Shashawnee Hall, a male, in the role of a producer. The cast information includes a note indicating his role as \"(producer)\". The movie titled \"The Last Day\" features Kenneth Nowling, a male, in the role of a producer. His specific contribution is noted as an executive producer. The movie titled \"The Last Day\" features Danny Torres in the role of a producer. The cast information includes a note specifying \"(producer)\". The movie titled \"The Last Day\" is categorized as a movie. Richard Scott, identified as male, is associated with this film in the role of a writer. The cast information includes a note specifying \"(writer)\".\n\nThe movie \"The Last Day\" is associated with the following keywords: \"apocalypse,\" \"neo-noir,\" \"second-coming,\" and \"suspense.\" These keywords encapsulate the thematic elements and genre influences present in the film.\n\nThe movie \"The Last Day\" involves several companies in its distribution and production. As distributors, the film is associated with Continuum Motion Pictures, MCTV, and Matriarch Multimedia Group. In terms of production, Continuum Motion Pictures and Matriarch Multimedia Group are joined by DVFilmworks.\n\n"
    },
    {
        "title": "Dorks & Dice",
        "dict_description": "The movie titled \"Dorks & Dice\" has an IMDb title ID of 1841621 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of D6232. The md5sum associated with this title is 25d45aaf5845593d3306de2e76db8bf9.\n\nThe movie \"Dorks & Dice\" is associated with the country USA. It falls under the genres of Adventure and Fantasy.\n\nThe movie titled \"Dorks & Dice\" is categorized as a \"movie.\" Andy Drummond is associated with this film in the role of \"producer.\" The cast information includes a note specifying \"(producer).\" The movie titled \"Dorks & Dice\" is categorized as a movie. Brett Pierce, identified as male, is associated with this film in the roles of both writer and director. The cast information includes two unspecified entries. The movie titled \"Dorks & Dice\" is categorized as a movie. It involves Drew T. Pierce, a male, who contributed to the film as both a writer and a director. The cast information includes two entries, though specific details about these entries are not provided.\n\nThe movie \"Dorks & Dice\" features several notable elements as indicated by its keywords. The title includes both \"ampersand-in-title\" and \"punctuation-in-title,\" highlighting its unique naming style. The storyline involves themes of \"freshman,\" \"friend,\" \"high-school,\" and \"high-school-friend,\" suggesting a focus on youthful relationships and educational settings. Additionally, the presence of \"role-playing-game\" as a keyword points to an element of gaming within the plot. These keywords collectively provide a structured insight into the thematic and stylistic aspects of the film.\n\nThe movie \"Dorks & Dice\" involves the company FroBro Films, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "The Happy Home of the Murderous Mahones",
        "dict_description": "The movie titled \"The Happy Home of the Murderous Mahones\" is identified by the ID 2376305 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"H1513\". The md5sum associated with this title is \"053927adf13bcb14edbbd769f9a2d8b6\".\n\n\"The movie 'The Happy Home of the Murderous Mahones' was filmed in Topanga, California, USA. It was released in the USA in 2015. The film falls under the genres of Comedy, Horror, and Thriller. Technically, it was shot using a Canon VIXIA hg10 camera and processed with a Digital Intermediate. The output format was Digital, and it was presented in a 2.35:1 aspect ratio.\"\n\nThe movie titled \"The Happy Home of the Murderous Mahones\" features Linden Chiles, a male actor, in the role of Jacob Mahone. The movie titled \"The Happy Home of the Murderous Mahones\" features Annie Waterman, a female actress, in the role of Jessie Mahone. The movie titled \"The Happy Home of the Murderous Mahones\" is a film project where Ansel Faraj, a male, played multiple key roles. He contributed as a producer, writer, cinematographer, director, and editor. Notably, his involvement as a producer is specifically highlighted with a note. The movie titled \"The Happy Home of the Murderous Mahones\" is categorized as a movie. Rosa Taylor-Faraj is associated with this film in the role of a producer. Specifically, she is noted as an executive producer. The movie titled \"The Happy Home of the Murderous Mahones\" features a contribution from Aurick Michaels, who is credited as a production designer. The structured data includes the title information with the kind specified as \"movie\" and the person involved named \"Michaels, Aurick.\" The role associated with this person is listed as [\"production designer\"], and the cast info section is represented by an empty dictionary [{}].\n\nThe movie \"The Happy Home of the Murderous Mahones\" features a blend of themes and elements that include \"accidental-murder,\" \"dark-comedy,\" and \"grand-guignol.\" The plot involves \"murder\" and is set against the backdrop of an \"old-dark-house.\" The story also incorporates characters such as an \"old-couple\" and a \"nosy-neighbor,\" with a subplot involving a \"room-for-rent.\" Additionally, the narrative unfolds amidst a \"storm,\" providing \"shelter\" as a key aspect of the setting.\n\nThe movie titled \"The Happy Home of the Murderous Mahones\" involves the company Hollinsworth Productions, which is listed under the category of production companies.\n\nThe movie titled \"The Happy Home of the Murderous Mahones\" has an alternate title listed as \"American Gothic.\" This title is associated with the ID 297220 and corresponds to the movie ID 2376305. It is classified under kind ID 1 and was produced in the year 2013. The phonetic code for this title is A5625. Notably, \"American Gothic\" was the original script title in the USA, as indicated by the note \"(USA) (original script title).\" The MD5 checksum for this entry is 613fa0da7c3054d4a606ede5b80f4863.\n\n"
    },
    {
        "title": "The Smoker",
        "dict_description": "The movie titled \"The Smoker\" is identified by the ID 2414180 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"S526\". The md5sum associated with this title is \"4041b07abacdade59a6a54ad384eaf8c\".\n\n\"The Smoker\" is a comedy and romance film released in the USA in 2015. The movie is in English and presented in color. It is set in the USA and follows the story of an English teacher at a prestigious all-girls school who is invited to dinner by one of his students. This senior student believes he would be the perfect husband for her, not out of love, but because she thinks they would be a good match. Her eccentric parents support this idea and encourage them to marry.\n\nThe movie titled \"The Smoker\" is categorized as a \"movie.\" Scott Rudin, identified as male, is associated with this film in the role of \"producer.\" His involvement is specifically noted as \"(executive producer).\" The movie titled \"The Smoker\" is categorized as a \"movie\" and features David Schickler in the role of \"writer.\" The cast information includes a note indicating \"(short story).\" The movie titled \"The Smoker\" is categorized as a \"movie.\" The person involved is Peter Tolan, identified as male, who contributed to the film in the role of \"writer.\" The cast information includes a note specifying \"(screenplay).\"\n\nThe movie \"The Smoker\" is characterized by several distinct keywords. It is based on a short story, and features elements such as an English teacher and a girls' school. The film is categorized as an independent film and explores themes of love. Additionally, it involves a professor and delves into a teacher-student relationship.\n\nThe movie titled \"The Smoker\" involves the company Scott Rudin Productions, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "No: 76",
        "dict_description": "The movie titled \"No: 76\" is identified by the ID 2157979 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"N\". The md5sum associated with this title is \"4155f2f5fc2e7865401d8576df73c090\".\n\nThe movie titled \"No: 76\" was released in the UK in 2015. It falls under the genre of Horror.\n\nThe movie titled \"No: 76\" is categorized as a \"movie\" and features Andrew Dennis in the roles of both \"producer\" and \"writer.\" His contributions are specifically noted as \"(producer)\" and \"(screenplay)\" in the cast information. The movie titled \"No: 76\" is categorized as a \"movie.\" Involved in its production is Pete Morgan, a male, who is credited in the role of \"producer.\" The cast information includes a note specifying \"(producer).\"\n\nThe movie titled \"No: 76\" is associated with three specific keywords: \"abbreviation-in-title,\" \"digit-in-title,\" and \"number-in-title.\" These keywords highlight the unique elements present in the movie's title, indicating the use of an abbreviation, the inclusion of a digit, and the presence of a number.\n\nThe movie titled \"No: 76\" involves the company Brit Pack Pictures, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "The Exiles: Ivy and Maxim Litvinov",
        "dict_description": "The movie titled \"The Exiles: Ivy and Maxim Litvinov\" is identified by the ID 2366517 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"E2421\". The md5sum associated with this title is \"1506ea4475d38697428b5242632ab765\".\n\n\"The Exiles: Ivy and Maxim Litvinov\" was released in the USA in 2015. The film's plot, noted by Carolyn Weidell, centers on a high-ranking Russian-Jewish diplomat who risks his career and life to alert political leaders of Hitler's intentions, drawing parallels to \"REDS\" and \"MISSION IMPOSSIBLE.\" This narrative unfolds through the memories of Ivy Low, the widow of Maxim Litvinov, a Bolshevik revolutionary and the only Jew in Stalin's inner circle, focusing on Litvinov's urgent efforts to thwart Hitler. The movie is set in the USA and spans multiple genres, including Biography, Drama, Romance, Thriller, and War.\n\nThe movie titled \"The Exiles: Ivy and Maxim Litvinov\" features Tracy Burns, who is credited in the roles of producer and miscellaneous crew. The cast information notes her involvement as a development executive, with this role being mentioned twice. The movie titled \"The Exiles: Ivy and Maxim Litvinov\" is categorized as a movie. Sheldon Drobny is associated with this film, contributing in the roles of producer and miscellaneous crew. His involvement is specifically noted as a development executive, as indicated twice in the cast information. The movie titled \"The Exiles: Ivy and Maxim Litvinov\" features Carolyn Weidell, a female, in the roles of producer and miscellaneous crew. Her involvement is specifically noted as a development executive, as indicated twice in the cast information. The movie titled \"The Exiles: Ivy and Maxim Litvinov\" is categorized as a \"movie.\" In this production, Charles David Denler is credited as the composer. The cast information section is provided but contains no additional details. The movie titled \"The Exiles: Ivy and Maxim Litvinov\" is categorized as a movie. Tracy Burns is associated with this film in the capacity of miscellaneous crew. Her specific role is noted as a development executive.\n\nThe movie titled \"The Exiles: Ivy and Maxim Litvinov\" is associated with the keywords \"holocaust\" and \"world-war-two\".\n\nThe movie \"The Exiles: Ivy and Maxim Litvinov\" involves the company Six28 Entertainment, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Project Pangea: Dinosaurs Unleashed!",
        "dict_description": "The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is identified by the ID 2220237 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"P6231\". The MD5 checksum associated with this movie is \"5d49a0d10d17fa913f00a365ac6ac85d\".\n\n\"Project Pangea: Dinosaurs Unleashed!\" is a Sci-Fi film released in the USA on 14 April 2015. The movie was filmed in Conroe and Houston, Texas, USA, and is presented in color. It features the tagline \"There's trouble in Paradise\" and was produced with a budget of $450,000. The film is in English and originates from the USA.\n\nThe movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Paul Damon, identified as male, is involved in the role of an actor. He portrays the character Dr. Steve Richards. The cast information is provided but contains no additional details. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. John Paul Faour, identified as male, is involved in this project in multiple capacities, specifically as an actor and a producer. Within the film, he portrays the character Major Chenkov. Additionally, his role as a producer is further specified with the note \"(co-producer).\" The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Don Hampton, a male actor, plays the role of Deputy Smith. The cast information is provided, but no additional details are specified. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Mel House, a male actor, plays the character Phil Bass. The cast information is provided, but no additional details are specified in the cast info section. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. Vance Johnson, a male, is involved in this project as both an actor and a producer. In the film, he portrays the character Minister Korzenevski. Additionally, his role as a producer is specified with the note \"(associate producer)\". The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Calvin Lafiton, identified as male, is involved in the role of an actor. He portrays the character named Jim Bass. The cast information is provided but contains no additional details. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Damon Lipari, identified as male, is involved in the role of an actor. He is associated with the character named Kyle Jones. The cast information includes a note indicating that this involvement is rumored. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Francesco Quinn, identified as male, is involved in the role of an actor. He portrays the character named Sheriff Hicks. The cast information is provided but contains no additional details. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Reioux, Amesti, identified as male, is involved in the role of an actor. He portrays the character named Dr. Petrova. The cast information is provided but contains no additional details. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Reem Al-Hellou, a female, is credited as an actress. She portrays the character Dr. Amir. The cast information is provided but contains no additional details. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. Shelley Boozer, identified as female, is involved in this project as an actress. She portrays the character named Dora in the film. The cast information is provided but contains no additional details. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, the actress Yankie Grant, who is female, plays the character Col. Dr. Petrova. The cast information is provided but contains no additional details. The movie \"Project Pangea: Dinosaurs Unleashed!\" features Melissa L. Nichols, a female, who plays the character Dr. Anastasia Romanskia. Her roles in the film include actress, producer (noted as co-producer and executive producer), writer, costume designer, and production designer. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Debbie Rochon, a female, is involved as an actress. She is associated with the role of an \"FBI Agent,\" although this is noted as \"(rumored)\" in the cast information. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. In this film, Keli Wolfe, identified as female, is credited as an actress. She portrays the character Dr. Leslie Harris. The cast information is provided but contains no additional details. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. A person involved in this project is Brad Gammell, identified as male. He contributed to the film in the role of a producer, specifically noted as an associate producer. The movie titled \"Project Pangea: Dinosaurs Unleashed!\" is categorized as a movie. Phil Nichols, identified as male, is associated with this project in the roles of producer and director. The cast information includes a note indicating his role as a producer.\n\nThe movie \"Project Pangea: Dinosaurs Unleashed!\" is associated with the keyword \"dinosaur\" as indicated in the structured IMDb data.\n\nThe movie \"Project Pangea: Dinosaurs Unleashed!\" involves two key companies. Legacy Distribution serves as the distributor, while Fiendish DRP Productions is responsible as the production company.\n\n"
    },
    {
        "title": "McNeil Island",
        "dict_description": "The movie titled \"McNeil Island\" is identified by the ID 2109208 and was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"M2542\". The md5sum associated with this title is \"6412a319b9fbff88e5dc01a5590d5a8b\".\n\nThe movie \"McNeil Island\" is a drama released in the USA in 2015 and 2016. It is in English and was filmed in locations including Steilacoom, Washington, USA; Puget Sound, Washington, USA; and Tacoma, Washington, USA. The plot, provided by an anonymous source, follows Clare Hart, a former rape crisis counselor who, after experiencing burnout, takes a job at Washington State's McNeil Island Prison treating violent sex offenders. Her determination to prevent future crimes leads her into the disturbing world of rapists, sadists, and child molesters, which ultimately affects her sanity and well-being.\n\nThe movie titled \"McNeil Island\" features Barbara Bruno, a female, in the role of a producer. Her specific contribution to the film is noted as a line producer. The movie titled \"McNeil Island\" features Russell Gilwee, who contributed as both a producer and a writer. His roles are specified with notes indicating \"(producer)\" and \"(written by)\" respectively. The movie titled \"McNeil Island\" is categorized as a movie. Sarah Knight is associated with this film, fulfilling the roles of both producer and director. The cast information includes a note specifying her role as a producer. The movie titled \"McNeil Island\" features Randy Gardell, a male, who contributed as a costume designer. The cast information is provided but contains no additional details.\n\nThe movie \"McNeil Island\" features themes and elements such as burnout, counselor, island-prison, and rapist.\n\nThe movie \"McNeil Island\" involves the company Jo Films, which is listed under the category of production companies.\n\n"
    },
    {
        "title": "Ivan the Fool",
        "dict_description": "The movie titled \"Ivan the Fool\" is identified by the ID 1992883 and was produced in the year 2015. It has a phonetic code of \"I1531\" and an MD5 checksum of \"efb1b5ec8061973dd22bc5085d70ec79\". This production is categorized under the kind \"movie\".\n\n\"Ivan the Fool\" is a 90-minute animated feature film from the UK, released in 2015. The movie is presented in English and was filmed in the UK. It falls under the genres of Animation, Family, and Fantasy, and is presented in color. The plot centers on Ivan, who is initially ridiculed and bullied but eventually finds good fortune through various twists of fate. Those who once mocked him must now depend on him for their success and survival. The film explores themes of ambition, illusion, power, and the triumph of virtue, set against a backdrop of fantasy landscapes and mythical characters. It is noted for its stylish animation and is an updated realization of a classic fairy tale. The production was in negotiation with co-production companies such as BBC/BBC Films, ITV, and C4/C4 Films. The plot and production details are credited to Logos Prds/TMS and Thais Sher, 2008.\n\nThe movie titled \"Ivan the Fool\" features Michael Henbury Ballan, a male actor, who plays the character \"Imp 2\" in a voice role. The movie titled \"Ivan the Fool\" features Mackenzie Crook, a male actor, who is associated with the character Ivan. His involvement in the film is noted as \"(voice) (rumored)\". The movie titled \"Ivan the Fool\" features Timothy Dalton, a male actor, in the role of the character \"Devil.\" His involvement is noted as \"(voice) (rumored).\" The movie titled \"Ivan the Fool\" features Warwick Davis, a male actor, in the role of \"IMP 1 2 3.\" His involvement in the film is noted as \"(rumored).\" The movie titled \"Ivan the Fool\" features Michael Gambon, a male actor, in the role of the Narrator. His contribution to the film is noted as a voice performance. The movie titled \"Ivan the Fool\" features Graham Hughes, a male actor, who plays the character \"Imp 1\" in a voice role. The movie titled \"Ivan the Fool\" features Ed Stoppard, a male actor, who is associated with the character Simon. His involvement is noted as \"(voice) (rumored)\" in the cast information. The movie titled \"Ivan the Fool\" features Leila Gray, a female actress, in the role of \"Dancer II.\" Her contribution to the film is noted as a voice performance. The movie titled \"Ivan the Fool\" features Vanessa Redgrave, a female actress, who plays the character \"Housewife\" in a voice role. The movie titled \"Ivan the Fool\" features Thais Sher, a female, who contributes as an actress, producer, and writer. In the film, she plays the character \"Dancer I\" and provides her voice for this role. Additionally, she is credited with the notes \"(voice)\", \"(producer)\", and \"(screenplay)\" in the cast information. The movie titled \"Ivan the Fool\" is categorized as a movie. Chloe Cooper is associated with this film in the role of a producer. Additionally, she is noted as an assistant producer in the cast information. The movie titled \"Ivan the Fool\" is categorized as a movie. The person associated with this title is Leo Tolstoy, identified as male. His role in the movie is listed as a writer, with a specific note indicating \"(story)\". The movie titled \"Ivan the Fool\" is categorized as a \"movie.\" In this production, Nigel Osborne is credited as a \"composer.\" The cast information section is provided but contains no additional details. The movie titled \"Ivan the Fool\" is categorized as a \"movie.\" Sylvain Chomet, identified as male, is associated with this project in the role of \"director.\" The cast information includes a note indicating that the project is \"(in talks).\"\n\nThe movie \"Ivan the Fool\" is associated with several keywords that define its thematic elements. These keywords include \"ambition,\" highlighting a possible drive or aspiration within the narrative; \"bullied,\" suggesting themes of intimidation or harassment; \"character-name-in-title,\" indicating that the title of the movie includes the name of a character; and \"ridicule,\" pointing to elements of mockery or scorn. Each keyword provides insight into the film's core motifs and character dynamics.\n\nThe movie \"Ivan the Fool\" involves several companies in its production and distribution. Logos Films is associated with the film as both a distributor and a production company. Additionally, Epoch Films is involved as a production company.\n\n"
    }
]