[
    {
        "title": "Timeliner",
        "dict_description": "In 2019, the movie \"Timeliner\" was released. The movie has the IMDb ID 2437383 and a phonetic code of T5456. The MD5 checksum for this movie is eca94534f3f05ec0b56089951be1b0d4.\n\nThe movie information includes that the film is in English, with a budget of $50,000,000. It is based on several books by Richard C. Meredith, namely \"Run, come see Jerusalem,\" \"The Awakening,\" \"The sky is filled with ships,\" and \"We all died at Breakaway Station.\" The plot revolves around a warning of an alien invasion prompting the formation of a specialized team capable of traversing alternate realities to prepare for the impending threat. The story questions the true motives behind the ongoing war against the pan-dimensional beings known as the Krith. The film is in color and originates from the USA, falling under the genres of Action and Sci-Fi.\n\nIn the movie \"Timeliner,\" Robert H. Gwinn, a male individual with the primary name code G5616 and nickname code R1632, is involved in the roles of producer, writer, and director. His surname code is G5, and his unique identifier is 4614353df59b2ae54ce584312b399fe4. Specifically noted as a producer and screenplay writer, Gwinn's multifaceted contributions to the film are significant. The movie \"Timeliner\" features Joy Meredith in the role of a producer, specifically noted as an associate producer. Joy Meredith is identified by the primary code M632 and the normalized form code J563, with a surname code of M63. The MD5 checksum associated with Joy Meredith is f2929e60b9d6e43c058cbc58c2e2e00b. The movie \"Timeliner\" features Richard C. Meredith in the role of a writer, specifically noted as the author of the novel on which the movie is based. Richard C. Meredith is identified by the primary name code M6362, secondary name code R2632, and surname code M63, with an MD5 checksum of 97130c6ab0d9a5a709e54b085c4497a6.\n\nThe keyword information includes six entries. The first keyword is \"alternative-timeline\" with a phonetic code of A4365. The second keyword is \"based-on-novel\" with a phonetic code of B2351. The third keyword is \"fiction\" with a phonetic code of F235. The fourth keyword is \"krith\" with a phonetic code of K63. The fifth keyword is \"meredith\" with a phonetic code of M63. Lastly, the sixth keyword is \"timeliner\" with a phonetic code of T5456.\n\nThe movie companies listed in the IMDb data are Rampant Entertainment. Rampant Entertainment is a distributor and a production company based in the United States. The company code for Rampant Entertainment is R5153, and the MD5 checksum for their information is 5ffe0ada86b78cfe3f011b4bf4b9cac6.\n\n"
    },
    {
        "title": "So Many Galleries",
        "dict_description": "In 2019, the movie \"So Many Galleries\" was released, identified by the ID 2297104. The phonetic code for this production is \"S5246,\" and its MD5 checksum is \"fa3a01ddbf60408cff962273943b8701.\"\n\nThe movie \"So Many Galleries\" is presented in English and has a total runtime of 68 minutes. The plot follows artist Washington Chavez as he navigates the New York art scene in search of a solo show in Manhattan. Chavez, a Parsons-trained painter, records his experiences using a small video camera while soliciting galleries door-to-door. The film captures the humorous reactions and advice from gallery owners and employees. \"So Many Galleries\" is a color documentary set in the USA, blending elements of comedy and drama seamlessly throughout its narrative.\n\nThe movie \"So Many Galleries\" features Chavez Washington, a male actor, producer, cinematographer, director, editor, and miscellaneous crew member. In the film, he portrays the character \"Himself.\" Chavez Washington is credited with various roles in the cast, including actor, producer, executive producer, and technical advisor.\n\n"
    },
    {
        "title": "The Last Contact",
        "dict_description": "In 2017, the movie \"The Last Contact\" was released, identified by the ID 2384186. The phonetic code for this production is \"L2325,\" and its MD5 checksum is \"bb9d1a10c7a8615e0f1ae426853a5614.\"\n\nThe movie information includes details about the release dates and genres. The movie was released in Mexico on 25 October 2017. It falls under the genre of Sci-Fi.\n\nIn the movie \"The Last Contact,\" Ignacio Campos Reyeros, identified by the name codes C5126 and I2525, is credited as a producer. Additionally, he holds the role of associate producer as noted in the cast information. The MD5 checksum associated with Ignacio Campos Reyeros is e520eac5bcbed027aa24bf17b9bc7e3c. In the movie \"The Last Contact,\" Campos, Aarón I. plays the roles of producer and writer. Campos, Aarón I. is a male individual with the primary name code C5126, alternative name code A6525, and surname code C512. The MD5 checksum associated with Campos, Aarón I. is d4c23e6555f743ef5d527105c90629a1. Additionally, Campos, Aarón I. is credited as a producer and developer in the cast information for the movie. In the movie \"The Last Contact,\" Nayalith Vasquez, identified by the name code V2543, N4312, and surname code V2, plays the role of a producer. This information is confirmed by the note \"(producer)\" associated with the cast info.\n\nThe movie companies data includes details about a production company named CamposFilms from Mexico, identified by the country code [mx]. The company's name postal code without formatting is C5121, and with formatting is also C5121. The MD5 checksum for this entry is 94d230c9828c3c4f32c50e3f1769315e. This information falls under the category of production companies.\n\n"
    },
    {
        "title": "Battle Angel",
        "dict_description": "In 2017, the movie \"Battle Angel\" was released, identified by the ID 1715711. The phonetic code for this production is \"B3452,\" and its MD5 checksum is \"6655082b903dec23d64223829f578dc9.\" This film falls under the category of movies.\n\nThe movie is in English and was released in the USA in 2017. It features advanced digital technologies like OFM:Digital and PCS:Digital Intermediate as the master format. The film's source format is PCS:HDCAM SR, and it will be presented in PFM:D-Cinema. Notably, the main character will be a blend of live action and CG animation, shot in 3D using James Cameron's stereo imaging system. The movie will incorporate around 1,500 visual effects shots. Based on the manga \"Gunnm,\" known as \"Battle Angel Alita\" in North America, the plot revolves around Alita, a cyborg with a mysterious past discovered by Dr. Ido in a post-apocalyptic world. The story is set in the 26th century after a major war, where cyborg technology is prevalent. The film's budget is $200,000,000. Additionally, the movie spans genres like Action, Adventure, Romance, Sci-Fi, and Thriller, and it will be in color. James Cameron plans to combine elements from the first three books of Yukito Kishiro's graphic novel series and potentially create sequels if the film succeeds. The casting process for the lead role had an interesting mix-up with another film's audition call.\n\nIn the movie \"Battle Angel,\" James Cameron, identified as 'Cameron, James' on IMDb, is involved as a male producer, writer, and director. His IMDb index is 'I,' and his gender is male. The primary roles he undertakes in the film are producer, writer, and director. The specific notes associated with his involvement are 'producer' and 'screenplay.' In the movie \"Battle Angel,\" Jon Landau, identified with the IMDb index \"I,\" is a male producer. His name is coded as \"L5325\" for the primary name and \"J5453\" for the name without special characters, while his surname is coded as \"L53.\" The MD5 checksum associated with him is \"48d5036eb7429678559dfeb5866c2cb0.\" Landau's role in the film is solely as a producer, as indicated by the note \"(producer)\" in the cast information. In the movie \"Battle Angel,\" the writer credited is Laeta Kalogridis, a female individual. Kalogridis is identified by the primary code \"K4263\" and the normalized form code \"L3242,\" with an MD5 checksum of \"e607077f1e7f2332d842864bb35d03cc.\" Her role in the film is specifically noted as the screenplay writer. The movie \"Battle Angel\" features Yukito Kishiro, credited as a writer. Kishiro is associated with the characters and graphic novels related to the film. Yukito Kishiro is uniquely identified by the following codes: name_pcode_cf K2623, name_pcode_nf Y2326, and surname_pcode K26. Additionally, Kishiro's MD5 checksum is efd312fdde4a73d912a0d6468b2d1a48. In the movie \"Battle Angel,\" Emma Watts, a female individual with the name code W325, and the non-film name code E532, and the surname code W32, is credited as a miscellaneous crew member. She holds the role of a production executive, as indicated in the cast info section with the note \"(production executive).\" In the movie \"Battle Angel,\" Martin Laing, identified with the IMDb index \"I,\" is a male production designer. The unique codes associated with his name are L5256 for the primary code and M6354 for the name code. His surname code is L52, and the MD5 checksum linked to his information is 50e91e0e20218b9b768a4cb47ecdb7b1. Martin Laing's role in the film is specifically as a production designer. The cast information for this entry is empty.\n\nThe keyword information includes several terms and their corresponding phonetic codes. The keywords are as follows: \"26th-century\" with a phonetic code of T2536, \"3-dimensional\" with a phonetic code of D5254, \"based-on-comic\" with a phonetic code of B2352, \"based-on-graphic-novel\" with a phonetic code of B2352, \"based-on-manga\" with a phonetic code of B2352, \"bounty-hunter\" with a phonetic code of B5353, \"cgi-animation\" with a phonetic code of C2535, \"cyborg\" with a phonetic code of C162, and \"female-cyborg\" with a phonetic code of F5421.\n\nThe movie \"Twentieth Century Fox Film Corporation\" is associated with the United States as a distributor and a production company, identified by the name pcode_nf T5325 and name pcode_sf T5325 with an md5sum of db4d2c15bfaec32cb702f4b147c0aeef. Additionally, \"Lightstorm Entertainment,\" also from the US, is listed as a production company, with the name pcode_nf L2323, name pcode_sf L2323, and an md5sum of c7e7b8eff6ee3e1624349c944530494e.\n\n"
    },
    {
        "title": "Robocops",
        "dict_description": "In 2017, the movie \"Robocops\" was released. The film is identified by the ID 2247126 and has a phonetic code of R1212. Its MD5 checksum is 519387239318a1775f4b0237dc5d4d4e.\n\nThe movie was released in the USA in 2017. It belongs to the genres Drama, Family, and Sci-Fi. The film was also produced in the country of USA.\n\nIn the movie \"Robocops,\" Ford Austin, identified by the name code A2351, is involved as a male producer and director. His surname code is A235, and the MD5 checksum associated with him is 2472afbce4ee19f4f00210d049eb4127. Additionally, he is credited as a producer in the cast information.\n\nThe movie companies data includes one entry for a production company named Angry Baby Monkey Pictures based in the United States with the name code A5261. The company's MD5 checksum is 5b45731ac507759360698b016e9ef3b6.\n\n"
    },
    {
        "title": "Polis",
        "dict_description": "In 2016, the movie \"Polis,\" identified by the ID 2209537, was produced. The phonetic code for this movie is \"P42,\" and its MD5 checksum is \"e86054aa6e037245b1fe29030ea04d03.\"\n\nIn the movie \"Polis,\" the fourth and final installment of the innovative Heartbeat of the Word series, the plot explores the essence of political life. The film delves into various aspects of governance, including how societies govern themselves, rebellion, power dynamics, war, organizational structures, hierarchies, and the concept of defeat. The information was provided by an anonymous source. The movie is set in the United States.\n\nIn the movie \"Polis,\" Lucas Akoskin, identified by the name code A2542, L25, and A25 for his full name, gender, and surname respectively, is credited as a producer. This role is specifically noted as \"(producer)\" in the cast information. The movie \"Polis\" features Guillermo Arriaga in the role of a producer. Arriaga, identified with the IMDb index \"I\" and the gender male, is uniquely coded as \"A6246\" for his name and \"G4656\" for his name without spaces, while his surname is coded as \"A62\". The MD5 checksum associated with Arriaga is \"703b4e3d149ac62aecd24d07bdc9e76e\". The specific note for Arriaga's role is denoted as \"(producer)\". The movie \"Polis\" features Alex Garcia in the role of a producer. The IMDb index for Alex Garcia is XXVI, with primary codes G6242 for the name and A4262 for the name without diacritics, while the surname code is G62. A specific note indicates that Alex Garcia's role in the movie is that of a producer.\n\nThe movie company information from IMDb includes details about a production company named BN Films based in the United States. The company is identified by the name code \"B5145\" for both primary and secondary purposes. The MD5 checksum for this company's data is \"290c584c033085814234e7d01097284d.\" This information falls under the category of production companies.\n\n"
    },
    {
        "title": "Climate Control",
        "dict_description": "In 2016, the movie \"Climate Control\" was released, identified by the ID 1779162. The phonetic code for this production is \"C4532,\" and its MD5 checksum is \"a6ce6981855e05f280073ffce5aba3e0.\"\n\nThe movie is in English and was filmed in North Carolina, USA. It was released in the USA in 2016. The tagline for the movie is \"When it comes to weather, Mother Nature will be the least of our worries.\" The budget for the film was $75,000,000. It is a color film belonging to the Drama, Sci-Fi, and Thriller genres. The movie was produced in the USA.\n\nIn the movie \"Climate Control,\" Kent Allen, credited as a producer, also served as a co-producer. Kent Allen is identified by the IMDb index \"I\" and the primary name code \"A4525\" with additional name codes \"K5345\" and \"A45.\" The MD5 checksum associated with Kent Allen is 435f05e9c7a5c37d05e908761c936819. The movie \"Climate Control\" features Richard Clark Jr. in the roles of producer and writer. Clark Jr.'s unique identifiers are \"C4626\" and \"R2632\" for different purposes. The MD5 checksum associated with Clark Jr. is \"ecc060f9b56fb45c8536ebfa400edc06\". In the cast info, Clark Jr. is credited as the producer and writer with respective notes indicating these roles. In the movie \"Climate Control,\" Brian Conlon, identified as IMDb index III, is credited as a male producer. The cast information specifies that Conlon's role in the movie is solely as a producer, denoted by the note \"(producer).\" In the movie \"Climate Control,\" Peter Gimbal, identified by the name codes G5141 and P3625, serves as a producer. His surname code is G514, and his unique identifier is 6f7718d6f2d08bed5a08bf3c8fc43913. Additionally, he holds the role of executive producer as noted in the cast information. In the movie \"Climate Control,\" Ryen W. Thomas is credited as a producer. The unique identifier for Ryen W. Thomas is \"T5265\" for the name and \"R5352\" for the name without the surname, with a surname identifier of \"T52.\" The MD5 checksum associated with Ryen W. Thomas is \"be6091634f03070f3e6ab0d0f86ddd4e.\" The specific role attributed to Ryen W. Thomas in the cast information is that of a producer, denoted by the note \"(producer).\"\n\nThe movie companies data includes details about a production company named New Daydream Films. The company is based in the United States and is identified by the name code N3651 for both the primary and secondary name codes. The MD5 checksum for this company is 487bcc33a916621507d137d7213a0562. The type of company is classified as production companies.\n\n"
    },
    {
        "title": "Bosch",
        "dict_description": "In 2016, the movie \"Bosch\" was released, featuring a phonetic code of \"B2\" and an IMDb ID of 1741821. The unique MD5 checksum for this film is 38aa3f215fcb7504e600c68ee3764a35.\n\nThe movie information includes details about the film being from the Netherlands and belonging to the Biography genre.\n\nIn the movie \"Bosch,\" Kees Kasander, identified with the name code K2536, is a male producer. He is credited for the role of producer, as indicated by the note \"(producer)\" in the cast info. In the movie \"Bosch,\" Julia Ton, identified by the name codes T524 and J435, is credited as a producer. She holds the surname code T5 and a unique MD5 checksum of c7cb42b4dea134ba93c200574818adce. Additionally, Ton's role is specified as an executive producer in the cast information. In the movie \"Bosch,\" the individual named Peter Greenaway, with a gender of male, is credited for the roles of writer and director. The cast information for this movie includes two entries.\n\nThe movie companies data includes details about a production company named Cinatura from the Netherlands. The company's primary name code is \"C536,\" and its secondary name code is \"C5365.\" The MD5 checksum associated with this company is \"b89a7e9294ffa425a9f4d7afa46d55a6.\" The type of company is classified as \"production companies.\"\n\n"
    },
    {
        "title": "Bond 24",
        "dict_description": "In 2016, the movie \"Bond 24\" was released, identified by the ID 1739896. The phonetic code for this production is \"B53,\" and its MD5 checksum is \"0c6bcf5efe85a4ac53af6f0a137fe2bd.\" This film falls under the category of movies.\n\nThe movie is in English and was released in the UK in 2016. Pre-production overlapped with the making of \"Skyfall\" and \"Quantum of Solace.\" This is the 24th official James Bond film and the 26th theatrically released Bond movie. Daniel Craig stars as James Bond for the fourth time, with a fifth appearance planned. Director Sam Mendes considered \"Bond 24\" after the success of \"Skyfall.\" The film's financing is linked to \"Bond 25,\" hinting at a two-year cycle. Only four original Ian Fleming titles remain unused for potential Bond film titles. The script for this movie is highly confidential, known only to select personnel. John Logan is the sole scriptwriter for this film, a departure from previous Bond movies. The movie marks the first Bond film in 15 years not written by Purvis and Wade. Principal photography was planned for October 2013 with a release in Autumn 2014. \"Bond 24\" and \"Bond 25\" are designed as a multi-film arc. Christopher Nolan is a potential director for the film. The movie is not based on any original Ian Fleming story. The next Bond film after this one is expected to be released two years later. The film is in color and is set in the USA and UK, falling under the genres of action, adventure, crime, and thriller.\n\nIn the movie \"Bond 24,\" Daniel Craig, identified with the IMDb index \"I,\" portrays the character James Bond. Craig's gender is male, and his primary name code is C6235, with an additional code of D5426 for his name and C62 for his surname. The MD5 checksum for Craig is aa133dc4527d708ba4e80b7544247991, while the character James Bond has the MD5 checksum 0a363424ef5ceaa17d33dfe4c545d7f3. Craig's role in the movie is that of an actor. The cast information for this movie is available. In the movie \"Bond 24,\" Ralph Fiennes, identified with the name code F5264, is cast as an actor. His gender is male, and his primary name code is R4152, with the surname code F52. There is a rumor associated with his involvement in the film, as indicated by the note \"(rumored)\" in the cast information. In the movie \"Bond 24,\" Ben Whishaw, identified with the name code W215, portrays the character Q. Whishaw, a male actor with the name code B52 and surname code W2, is part of the cast in the film. His unique identifier is 43eab36a849adf155f6646d62753001f. The character Q, also known by the name code Q and identified by the unique code f09564c9ca56850d4cd6b3319e541aee, is played by Whishaw in the movie. In the movie \"Bond 24,\" the actress Naomie Harris is rumored to have a role. Naomie Harris, identified by the name code H625, with the surname code H62, and the MD5 checksum ef91fb2bb8e955265762f6c75c2e075e, is a female actress (f). In the movie \"Bond 24,\" Barbara Broccoli, identified with the name code B6241, is involved as a female producer. The cast information specifies that Barbara Broccoli's role in the movie is that of a producer, as indicated by the note \"(producer).\" In the movie \"Bond 24,\" Michael G. Wilson, identified with the IMDb index \"I\" and the name code \"W4252\" for current and \"M2424\" for former, is a male producer. His surname code is \"W425,\" and his MD5 checksum is \"fc7ddd0767851b5da46f826b74f6be77.\" Wilson's role in the film is solely as a producer, as denoted by the note \"(producer)\" in the cast information. In the movie \"Bond 24,\" the writer is Ian Fleming, identified with the IMDb index \"I.\" Fleming is a male individual with primary name code \"F4525,\" alternative name code \"I5145,\" and surname code \"F452.\" The MD5 checksum associated with Fleming is \"03c7dbc28441921df9a8133d5601226b.\" He is credited for the role of a writer, specifically noted for creating the characters related to the film. In the movie \"Bond 24,\" John Logan, identified with the IMDb index \"I,\" contributes as a male writer. The unique identifiers for John Logan include the primary name code \"L2525,\" the name code without the first name initial \"J5425,\" and the surname code \"L25.\" The MD5 checksum associated with John Logan is \"c6d21173e6ab9956994aa9d2803b27a3.\" In the movie \"Bond 24,\" the production designer is Dennis Gassner, a male individual. Dennis Gassner is uniquely identified by the primary codes G2563 for name, D5256 for name (no space), and G256 for surname. The MD5 checksum associated with Dennis Gassner is 217f62ea9cd4af2d00f548cb804ad82e. Dennis Gassner's role in the movie is specifically defined as a production designer.\n\nThe keyword information includes four entries. The first keyword is \"espionage\" with a phonetic code of E2152. The second keyword is \"sequel\" with a phonetic code of S24. The third keyword is \"spy\" with a phonetic code of S1. The fourth keyword is \"twentyfourth-part\" with a phonetic code of T5316.\n\nThe movie companies listed in the IMDb data include Columbia Pictures from the United States with name codes C4512, Sony Pictures Entertainment from Japan with name codes S5123, Sony Pictures from the US also with name codes S5123, and Eon Productions from the United Kingdom with name codes E5163. Columbia Pictures and Sony Pictures are categorized as distributors, while Eon Productions is classified as a production company. Each company is associated with a unique MD5 checksum for data integrity verification.\n\n"
    },
    {
        "title": "O Sentido da Vida",
        "dict_description": "In 2016, the movie \"O Sentido da Vida\" was released, identified by the ID 2166666. The phonetic code for this production is \"S5313,\" and its MD5 checksum is \"a88bbb0a4b2c0be999e3dd4574a8dbc6.\"\n\nThe movie's primary language is Portuguese. It was released in Portugal in 2016. Filming took place between January 2014 and December 2015. The budget for the film was €1,032,584. Production spanned from 2013 to 2016. The film is in color and falls under the documentary genre. It was produced in Brazil and Portugal.\n\nThe movie \"O Sentido da Vida\" features Alain de Botton in the role of an actor. In the movie, he portrays the character named Himself. Alain de Botton is identified with the primary name code \"D1354\" and secondary name code \"A4531,\" while his surname is associated with the code \"D135.\" His gender is male, and his unique identifier is \"3308a857b98ab349d61637c530ebbd8d.\" The character Himself is linked to the name code \"H5241,\" and the corresponding unique identifier is \"6d46b1d5d80d20a7780e4d353df679d2.\" The cast information for this movie is provided. The movie \"O Sentido da Vida\" features the actor Mãe, Valter Hugo, who portrays the character \"Himself.\" Mãe, Valter Hugo is male and is identified by the primary codes M1436 and V4362 for his name, and M for his surname. The unique identifier for Mãe, Valter Hugo is 69cfcbbd46b0354147a633b6eeab6357. He plays the role of an actor in the movie. The character \"Himself\" is uniquely identified by the codes H5241 and 6d46b1d5d80d20a7780e4d353df679d2. The cast information for this movie is provided. In the movie \"O Sentido da Vida,\" Sigur Rós, identified by the name code R26, S262, and R2, is cast as an actor, playing the character named Himself. The role is noted as rumored. Sigur Rós, a male actor, is uniquely identified by the MD5 checksum 9bc01a72ca8c2ba812040381a12a7b59, while the character Himself is distinguished by the MD5 checksum 6d46b1d5d80d20a7780e4d353df679d2. In the movie \"O Sentido da Vida,\" Björk, a female actress with the name code B262, is rumored to play the role of Herself. The character's name code is H6241. The cast information includes a note indicating that this casting detail is rumored. The movie \"O Sentido da Vida\" features Dilma Rousseff in the role of an actress, specifically portraying the character named Herself. Rousseff's gender is female, and her unique identifiers include the name code R2134, the non-full name code D4562, and the surname code R21. The character Herself is identified by the non-full name code H6241. Additionally, it is noted that Rousseff's involvement in the movie is rumored. The movie \"O Sentido da Vida\" features Miguel Gonçalves Mendes, who is credited as a producer, writer, and director. Mendes is identified by the name code M5325 for his full name and M2425 for his first name, with a surname code of M532. He is male, as indicated by the gender code \"m\" and is uniquely identified by the MD5 checksum 536e65a73f6b6ee7289640fff9983fbb. Additionally, in the cast info section, Mendes is specifically noted as a producer.\n\nThe movie companies data includes details about a production company named O2 Filmes from Brazil, identified by the production company code O1452. The company's information is uniquely identified by the MD5 checksum value a94c09cfa00c27ed24f05eaca97f225c.\n\n"
    },
    {
        "title": "Agent 47",
        "dict_description": "In 2016, the movie \"Agent 47\" was released, identified by the IMDb ID 1669098. The phonetic code for this production is \"A253,\" and its MD5 checksum is \"18e7adecca768d5ab7b207096b420312.\"\n\nThe movie is in English and falls under the Action genre. It was filmed in Berlin, Germany, and Singapore. The film was released in the USA in 2016. It is in color and originates from the USA.\n\nIn the movie \"Agent 47,\" Daniel Alter, identified with the name code A4363, is a male producer, as indicated by the gender \"m\" and the surname code A436. He holds the MD5 checksum 476c5aa0c4b4e584869c4cc8212fc405. In this production, Alter's role is specifically noted as an executive producer. In the movie \"Agent 47,\" Adrian Askarieh, identified by the name code A2636, A3652, and surname code A26, serves as a producer. He holds the role of executive producer, as indicated in the cast info section. In the movie \"Agent 47,\" Charles Gordon, identified with the IMDb index \"I\" and male gender, is involved as a producer. The specific role he plays is that of a producer, as denoted by the note \"(producer)\" in the cast info section. Charles Gordon's name is encoded as \"Gordon\" with the primary code \"G6352\" and the normalized form \"C6426,\" while his surname is encoded as \"G635.\" The MD5 checksum associated with Charles Gordon is \"62afdaa41c8e6e2a714fd73603de8d4b.\" In the movie \"Agent 47,\" Alex Young, identified as II on IMDb, is a male producer. The unique codes associated with his name are Y5242 for current projects and A4252 for past works, with a surname code of Y52. The MD5 checksum for his data is 0dc06ca12319447ef2b32c2d10747b10. Young's role in the film is solely as a producer, as indicated by the note \"(producer)\" in the cast info section. In the movie \"Agent 47,\" Michael Finch, credited as Michael Finch II on IMDb, is involved as a writer. The cast information for this entry includes details about his name variations and unique identifiers such as the primary name code (F5252), normalized name code (M2415), and surname code (F52). The MD5 checksum associated with Michael Finch's data is ca43e3c94eded03ca9d7275c94631862. In the movie \"Agent 47,\" Skip Woods, identified by the name code W321 and the non-full name code S2132, with the surname code W32 and an MD5 checksum of 6c374ccacb899831cc0eafde1ba18fd4, is credited as a writer. The cast information for this entry is empty. In the movie \"Agent 47,\" the director is Aleksander Bach. Bach's primary name code is B2425, with alternative name code A4253 and surname code B2. He is specifically noted as being attached to the project.\n\nThe keyword_info data includes a list of keywords with their corresponding phonetic codes. The keywords are as follows: \"assassin\" with a phonetic code of A25, \"bald\" with a phonetic code of B43, \"hired-killer\" with a phonetic code of H6324, \"money\" with a phonetic code of M5, and \"video-game\" with a phonetic code of V325.\n\nThe movie companies listed in the IMDb data include Twentieth Century Fox Film Corporation from the United States, identified by the name codes T5325 and T5325 for different purposes, categorized as distributors with an MD5 checksum of db4d2c15bfaec32cb702f4b147c0aeef. Another company, 20th Century Fox Film Corporation, also from the US, bears the name codes T2536 and T2536, classified as production companies, and possesses an MD5 checksum of 1ab47b532b68b90de9f1ddf77ca23f23. The third company, Dune Entertainment, hailing from the US as well, is denoted by the name codes D5363 and D5363, falling under the production companies type, with an MD5 checksum of ad733822f83d9c315b2db19fa57c3385.\n\n"
    },
    {
        "title": "Twist of Fate",
        "dict_description": "In 2016, the movie \"Twist of Fate\" was released, identified by the IMDb ID 2455749. The phonetic code for this production is \"T2313,\" and the MD5 checksum is \"a1b4a4b7f7d7c172e824bc28470121a3.\"\n\nThe movie is in English and has a runtime of 180 minutes. The technical information includes the use of a Sony HDW-F900 camera and a 2.35:1 aspect ratio. It was released in the USA in April 2016. The tagline for the movie is \"Expect the Unexpected.\" The budget for the film was $10,000,000. The plot revolves around Max and Talaya, who lead separate lives until they reunite after years and embark on a romantic journey that culminates in a Twist of Fate. The movie is in color and is set in the USA. Its genres include Action, Adventure, Drama, Mystery, and Romance.\n\nIn the movie \"Twist of Fate,\" Jeannine Guzzone, a female actress with the name code G2525 and surname code G25, plays the role of Rachael Alexander. Her name code is R2425, and her surname code is A4253. In the movie \"Twist of Fate,\" Wendy Marquez, a female actress, plays the role of Joanna Wilson. Wendy Marquez is identified by the name code M6253 for her first name and W5356 for her last name, with a surname code of M62. Her unique identifier is the md5sum d20bdcc2136aae7eb18ef80009763b48. Joanna Wilson, the character portrayed by Wendy Marquez, is denoted by the name code J5425 for her first name and W425 for her last name, with an md5sum of 74a5ac9f403d2d2c4bf062130d16a687. The cast information for this movie is provided as an empty set. The movie \"Twist of Fate\" features KaMeek Lucas Taitt in the roles of producer, writer, and director. KaMeek Lucas Taitt is credited with the name codes T3252 and K5242, with a surname code of T3 and an MD5 checksum of e654dd07d3bc8a47484c1be8b3a95cca. The cast information includes KaMeek Lucas Taitt as an executive producer and writer, with an additional unspecified role. The movie \"Twist of Fate\" features Christopher Eadicicco, a male cinematographer. Eadicicco's primary name code is E3262, with alternative codes C6231 and E32 for the name and surname, respectively. The MD5 checksum associated with Eadicicco is 97c515aa6b1999c482a1c1f20faf1e76. Eadicicco's role in the movie is that of a cinematographer. The cast information for this movie is available but not explicitly provided in the structured data. In the movie \"Twist of Fate,\" Dorian Morales, credited as Dorian Morales II on IMDb, is involved as a composer. The cast information for this entry is available. The movie \"Twist of Fate\" features Afiya Lahens, a female individual credited as a miscellaneous crew member with the specific role of script supervisor. Afiya Lahens is identified by the following codes: name_pcode_cf - L521, name_pcode_nf - A1452, and surname_pcode - L52. The MD5 checksum associated with Afiya Lahens is f94038d01278bc7aa51b7291ffcf97bd. The movie \"Twist of Fate\" features Erin Lass as the production designer. Erin Lass is identified by the name code L265, with additional codes E6542 and L2 for reference. The MD5 checksum associated with Erin Lass is e021fc779c68b3207f1c44a33f5c82c2.\n\nThe movie companies listed in the IMDb data are Chapter 4 Entertainment. The first company, Chapter 4 Entertainment, operates as a distributor and is based in the United States with the country code [us]. It is uniquely identified by the name p-codes C1365 for both the normalized form and the short form. The MD5 checksum for this company is 6d1de64570944e2d57f4f7778ecd6f25. The second company, also Chapter 4 Entertainment, functions as a production company and shares the same country and name p-codes as the distributor. The MD5 checksum for this production company is identical to that of the distributor, 6d1de64570944e2d57f4f7778ecd6f25.\n\n"
    },
    {
        "title": "The Wanderer King",
        "dict_description": "In 2016, the movie \"The Wanderer King\" was released, identified by the IMDb ID 2425149. The phonetic code for this production is \"W5362,\" and its MD5 checksum is \"d53d9a4b9e11813368eb5dec5512305e.\"\n\nThe movie is in English and falls under the genres of Animation. It was released in the USA on 17 December 2016, with a special screening in Los Angeles, California on 25 December 2016. The filming dates spanned from 15 January 2015 onwards. The film's budget was $500,000. The technical information indicates that it was produced in RAT:16:9 HD format and in color. The plot revolves around a young elf named Dante destined to be king, accompanied by a warrior-turned-outlaw named Landon Wanderer. As Dante's kingship prophecy unfolds into a darker scheme, his transformation into a malevolent figure leads to a conflict with his former protector. The narrative features various fantasy creatures like goblins, trolls, dwarves, and elves, offering a dark twist on the classic \"boy who would be king\" tale. Despite its grim tone, the film also incorporates moments of humor, humanity, and wonder in a fantastical world.\n\nIn the movie \"The Wanderer King,\" Vince Bruno, identified with the IMDb index \"I,\" portrays the character of a Soldier. Bruno's gender is male, and his primary name code is B6515, with alternative codes V5216 and B65 for different purposes. The MD5 checksum associated with Bruno is 1cb52a9683d7214a94648f6dea53a35c. His role in the film is that of an actor. The casting information includes a note indicating that Bruno's involvement in the movie is rumored. The character he plays, the Soldier, is uniquely identified by the name code S436 and has an MD5 checksum of de75f2eb439368d9b39281bd0c4bdabb. In the movie \"The Wanderer King,\" Travis Fritz, identified by the name code F6323, portrays the character of Goblin Clerk. Fritz is a male actor, denoted by the gender code \"m\" and the MD5 checksum 49d23c355eb8f1040e79fde9d8a6b1f8. His character, the Goblin Clerk, is represented by the name code G1452, the surname code C462, and the MD5 checksum c00842a88d6b953cafdfcbb5f288e5f4. The role attributed to Travis Fritz is that of an actor, as indicated in the provided data under the \"role\" field. The overall cast information for this movie is detailed within the structured data. In the movie \"The Wanderer King,\" Noah Hathaway, a male actor, is rumored to play the character King Dante. Hathaway's name is encoded as \"H35\" for the name_pcode_cf, \"N3\" for the name_pcode_nf, and \"H3\" for the surname_pcode. The MD5 checksum for Hathaway is \"daf1a256bb6f62834c94fcc9aee6b8a1,\" while for King Dante, it is \"97eb1df78fab31696387ca202c5bf2a3. In the movie \"The Wanderer King,\" Aaron Longstreth, identified by the p-codes L5236 and A6545, portrays the character Troll. Longstreth's gender is male, and his unique identifier is 975073a755e5304fe84facb102beebdf. His role in the film is that of an actor. The character Troll, with the name code T64 and an md5sum of 922a511f02d148e4c9390526d85ca519, is a part of the cast information for the movie. In the movie \"The Wanderer King,\" Larry Longstreth, identified by the p-codes L5236 and L6452, plays the role of actor, producer, writer, director, and editor. His character in the movie is Wilbur, with the p-code W416. Longstreth is noted as attached to the film and also serves as a producer. In the movie \"The Wanderer King,\" Jason Miller, identified with the IMDb index \"X,\" is cast as an actor, portraying the character Lythos. The character name code for Lythos is \"L32.\" It is noted that Jason Miller's involvement in the film is rumored. In the movie \"The Wanderer King,\" Teal Sherer, a female actress with the name code S634, T426, and surname code S6, plays the role of Naga. Her MD5 checksum is 88e7422e10551dcb359bdf67f1498c3d. The character Naga is identified by the name code N2 and has an MD5 checksum of f09a1594f0e21630b8888946669e116d. The cast information for this movie includes Teal Sherer portraying the character of Naga as an actress. In the movie \"The Wanderer King,\" Marisa Zakaria, a female actress known by the name code Z2656, with the surname code Z26, portrays the character of Young Marta, identified by the name code Y5256 and surname code M63. Zakaria's role in the film is that of an actress. The data includes no additional cast information. In the movie \"The Wanderer King,\" Mark Ordesky, identified by the name code O6325, is involved as a male producer. The cast information specifies his role as a producer, denoted by the note \"(producer).\" In the movie \"The Wanderer King,\" Mark D'Errico, identified by the name code D6256, M6236, and surname code D62, contributed as a composer. The cast information for this role is available. In the movie \"The Wanderer King,\" Jacob Ruby, identified by the name code R121 and non-film name code J2161, with the surname code R1 and an MD5 checksum of 32ae4b576d40b709d26b143c8c3fd477, plays the role of an editor. The cast information for this role is provided within the structured data.\n\nThe keyword information includes three entries: \"dungeons-and-dragons\" with a phonetic code of D5252, \"epic\" with a phonetic code of E12, and \"world-of-warcraft\" with a phonetic code of W6431.\n\nThe movie companies listed in the IMDb data are Maverick Entertainment and Eddy Spaghetti Productions. Maverick Entertainment, with the production code M1625, is a distributor based in the United Kingdom. Eddy Spaghetti Productions, identified by the production code E3212, operates as a production company in the United States. Each company is uniquely identified by an MD5 checksum: Maverick Entertainment's checksum is a01baa8770b0b2c894f17eaac7f0dd17, while Eddy Spaghetti Productions' checksum is a0e11037512433089a57bca0441f45fe. Maverick Entertainment falls under the category of distributors, whereas Eddy Spaghetti Productions is classified as a production company.\n\n"
    },
    {
        "title": "Elysion",
        "dict_description": "In 2016, the movie \"Elysion\" was released. The film is identified by the ID 1865784 and has a phonetic code of E425. Its MD5 checksum is f4909499eb87b40a4325fa05d7c8b3fc.\n\nThe movie is in English and was released in the USA in 2016. Its tagline is \"There is one true constant in the Universe and it is love.\" The budget for the film was $20,000,000. It is a color film from the genres of Fantasy, Romance, and Sci-Fi, set in the country of USA.\n\nIn the movie \"Elysion,\" Richard Scott, identified as XIII on IMDb, is credited as a male producer. The cast info specifies his role as a producer, denoted by the note \"(producer).\" In the movie \"Elysion,\" Darien Harte, identified by the name code H6365 for the primary name and D6563 for the name without the surname, is a male individual with the surname code H63. Harte takes on the roles of both writer and director in the film. Specifically noted as a writer, Harte's involvement in the movie's cast information is highlighted.\n\n"
    },
    {
        "title": "Dawgtown",
        "dict_description": "In 2016, the movie \"Dawgtown\" was released. The movie has the IMDb ID 1808171 and a phonetic code of D235. The MD5 checksum for this movie is 77601b4227bd2010e46d3d2fdad3b8c6.\n\nThe movie is in English and was released in the USA in 2016. It has a runtime of 70 minutes and is presented in RAT 16:9 HD format. The film is in color and falls under the animation genre. The taglines for the movie are \"To be free, they must fight,\" \"Throwdown! Showdown! Money down! Dawgtown!,\" and \"Break the Chains.\" It was produced in the USA and showcases a story where to achieve freedom, a fight is necessary.\n\nThe movie \"Dawgtown\" features Bruce Bullock in the role of a producer. This information is captured in the cast info data, specifically denoted as a note indicating his role as a producer. Bruce Bullock is uniquely identified by the following codes: name_pcode_cf \"B4216,\" name_pcode_nf \"B6214,\" and surname_pcode \"B42.\" Additionally, a distinct md5sum \"4fd027f5c8f0a350e2237bf0c05f2f67\" is associated with Bruce Bullock in this context. The movie \"Dawgtown\" features Justin Murphy, credited as a producer, writer, and director. Murphy is identified with the IMDb index IV and is male. His primary name code is M6123, with an alternative code of J2356, and his surname code is M61. The MD5 checksum associated with him is 0fc7246dbb921159c17b6ac331c36078. Additionally, in the cast info section, Murphy is specifically noted as a producer.\n\nThe keyword information includes six entries. The first keyword is \"2d-animation\" with a phonetic code of \"D535\". The second keyword is \"allegory\" with a phonetic code of \"A426\". The third keyword is \"animal\" with a phonetic code of \"A54\". The fourth keyword is \"cartoon\" with a phonetic code of \"C635\". The fifth keyword is \"dog\" with a phonetic code of \"D2\". Lastly, the sixth keyword is \"pitbull\" with a phonetic code of \"P314\".\n\nThe movie companies involved in the production are Off Center Pictures from the United States with name codes O1253 and a unique identifier cd0910bd636293e67e30884b3d906658, and Rebellyunz Chylde Animation also from the United States with name codes R1452 and a unique identifier 16cf8b4fea745a34ead6c4bb8174b019.\n\n"
    },
    {
        "title": "Bakers Dozen",
        "dict_description": "In 2016, the movie \"Bakers Dozen\" was released, identified by the unique ID 1710439. The phonetic code for this production is \"B2623,\" and the MD5 checksum is \"deabdd71808d502c3e4d63e1683f8a89.\"\n\nThe movie's primary language is English, and it was filmed in locations such as Czech Republic and Kiev, Ukraine. The technical aspects of the film were handled at LAB:Barrandov Laboratore in Prague, Czech Republic, with a film format of OFM:35 mm. The movie was released in the UK in 2016, with filming taking place from 31 March 2008 to 24 May 2008. The budget for the film was $15,000,000, and production dates spanned from 4 February 2012 onwards. The film is in color and hails from the UK, blending genres of Action, Romance, and War.\n\nIn the movie \"Bakers Dozen,\" Timothy Spall, a male actor with the name code S1435, T5321, and S14, portrays the character Kordik, identified by the name code K632. Spall's MD5 checksum is 2851779c1e6e0771654d46ddb3956e4e, while Kordik's MD5 checksum is 67484d03a016fb802f05e262d4478a63. The cast information for this movie includes Spall as an actor in the role of Kordik. In the movie \"Bakers Dozen,\" Max Lewinsohn, identified by the p-codes L5252 and M2452, is involved as a producer, as indicated by the role and the note specifying his contribution. Lewinsohn's surname p-code is L525, and his unique identifier md5sum is ae8f1f1a0a362d540c85c314edb3729b. In the movie \"Bakers Dozen,\" Bridgit P. Schock, a female individual with the primary name code S2163 and secondary name code B6323, and surname code S2, is credited as a producer. Additionally, she holds the role of associate producer as noted in the cast info section. The MD5 checksum associated with Bridgit P. Schock is b444c4aaa9be521d896edaa750d3574c. The movie \"Bakers Dozen\" features Philip Waley, a male producer. Waley's primary name code is W4141, with additional codes P414 and W4 for name and surname respectively. The MD5 checksum associated with Waley is 61a17110088a9ea4a725815cd1f9c187. In the cast info, Waley is noted as the producer with the descriptor \"(Producer)\". In the movie \"Bakers Dozen,\" Rob Isted, identified by the name code I2361, R123, and surname code I23, is credited as a writer. The cast info specifies his role as a writer, denoted by the note \"(writer).\" The movie \"Bakers Dozen\" features Morris Evans and Betsan as the director. Morris Evans is identified by the pcode_cf M6215 and pcode_nf B3256, with an md5sum of a850454d3808f7781357e416c0360721. The cast info for this movie includes the role of director.\n\nThe movie companies data includes details about a production company named Groucho Entertainment based in the United Kingdom with name codes G6253 and a unique identifier md5sum of c902c71befc8c5355613bcd9a680a393.\n\n"
    },
    {
        "title": "Drug Lord",
        "dict_description": "In 2016, the movie \"Drug Lord\" was released, identified by the IMDb ID 1847064. The phonetic code for this production is \"D6246,\" and its MD5 checksum is \"6d11efc6f0174199ae8e952f6d39542b.\"\n\nThe movie is set in Texas, USA, and New Mexico, USA. It is based on the book \"Drug Lord: The Life & Death of a Mexican Kingpin - A True Story\" by Terrence E. Poppa. The plot revolves around a drug trafficker who escapes U.S. authorities and seizes control of a Mexican border town, turning it into a violent battleground marked by terror, betrayal, and revenge as he combats rival factions to maintain his dominance. The film originates from the USA and falls under the genres of Crime, Drama, and Thriller.\n\nIn the movie \"Drug Lord,\" Michael Gianfriddo, identified by the name codes G5163 and M2425, serves as a producer. He holds the role of executive producer, as indicated in the cast info section. In the movie \"Drug Lord,\" Diana Kemp, identified as \"Kemp, Diana\" on IMDb with the code \"K5135,\" is credited as a female producer with the IMDb index \"I\" and a gender code \"f.\" Her primary name code is \"D5251,\" and her surname code is \"K51.\" The MD5 checksum associated with her is \"59471296ea45a9dbb4022d1c6b8cc0a9.\" Diana Kemp's role in the film is specifically noted as an executive producer. In the movie \"Drug Lord,\" the individual named Mina Zavoda, with the unique identifiers Z135, M5213, and Z13, is involved in the roles of producer and writer. Specifically noted as a producer, Zavoda's involvement in the film is significant. The cast information includes the roles of producer and writer, with the producer role explicitly highlighted. In the movie \"Drug Lord,\" Terrence E. Poppa is credited as a writer, specifically noted for his contribution as the author of the book that inspired the film. Terrence E. Poppa's unique identifiers include the name code \"P1365\" for his full name and \"T6521\" for his name without the surname. The surname code assigned to him is \"P1,\" and his data is secured by the MD5 checksum \"9246854f35df3b0908b9c27c376ba5e4.\"\n\nThe keyword_info data includes a single keyword tuple: \"based-on-book\" with a corresponding phonetic code \"B2351\".\n\nThe movie companies listed in the IMDb data are \"Dominant Entertainment.\" The first company operates as a distributor and is based in the United States with the name code \"D5353.\" The second company functions as a production company and also hails from the United States with the same name code \"D5353.\" Both companies share the same MD5 checksum, which is \"d79dc230b1752e43c87fd6536c49be69.\"\n\n"
    },
    {
        "title": "Horizontal Flowers",
        "dict_description": "The movie \"Horizontal Flowers,\" released in 2016, is identified by the phonetic code H6253 and the MD5 checksum 6b982e32589c0226a2e18f598e9329b9.\n\nThe movie information includes that the film is in English and falls under the drama genre. It was released in the USA on the 10th of May, 2016. The movie was primarily filmed in California, USA, and Rio de Janeiro, Brazil. It is presented in color and originates from Brazil.\n\nThe movie \"Horizontal Flowers\" features Gui Inacio, a male actor known for his role as Paul Morhaven. Gui Inacio's name is encoded as I52 for the current name and G52 for the normalized form. His unique identifier is 455e586cb9f42cf71db47d6f1f144697. In the movie, Gui Inacio portrays the character Paul Morhaven, whose name is encoded as P4561 for the normalized form and M615 for the surname. The character information is uniquely identified by 48d4043e37a8b8d56c989ea24778dad5. Gui Inacio's role in the film is that of an actor. The cast information for this movie is available. The movie \"Horizontal Flowers\" features Marco Neves in the role of an actor, specifically portraying the character named Scott. Neves is identified with the IMDb index \"I\" and is male. His primary name code is \"N1256,\" while his secondary name code is \"M6251,\" and his surname code is \"N12.\" The MD5 checksum associated with Neves is 398ede091e88ed687e3cce5831da8861. The movie \"Horizontal Flowers\" features Thea Gill in the role of an actress. Her character in the movie is Clara. Thea Gill is identified with the gender female, and her name encoding includes G43 for the name and T24 for the name without the surname. The surname encoding for Thea Gill is G4, and her unique identifier is 61063d276bb0da1411f17cc47015acf2. Clara, the character portrayed by Thea Gill, is encoded as C46 in the name and has a unique identifier of 0afca49306b28c1650a1d4130a6a0ce1. The cast information for this movie is provided in the structured data. In the movie \"Horizontal Flowers,\" Roberto Jabor, identified by the name code J1616, R1632, and J16, is involved in the roles of producer, writer, and director. Jabor, a male individual, is credited as the producer and writer, and also takes on the role of director. The cast information includes specific notes indicating Jabor's involvement as a producer and screenplay writer. The movie \"Horizontal Flowers\" features Richard Schimpf in the role of a writer, specifically credited for the screenplay. The movie \"Horizontal Flowers\" features Araken Dourado as the cinematographer. Araken Dourado is identified by the name code D6362 for his name and A6253 for his name without diacritics, with a surname code of D63. The MD5 checksum associated with Araken Dourado is 8f6fc0034d6dd1b5f90b621520692a44. The movie \"Horizontal Flowers\" features Leon Bradford in the role of composer. The unique identifier for Leon Bradford is \"B6316\" for current projects and \"L5163\" for past works. The MD5 checksum associated with this cast information is \"4c0362a6d7e70009e724e119a477ddb2\". The movie \"Horizontal Flowers\" features Lance Warlock in the role of composer. The movie \"Horizontal Flowers\" features Eduardo Hartung in the role of an editor. Eduardo Hartung is identified by the primary code \"H6352\" and the normalized form code \"E3636\". The MD5 checksum associated with Eduardo Hartung is \"09911163ead39f649b6dc6406ca2defa\". The cast information for this movie includes Eduardo Hartung as the editor. In the movie \"Horizontal Flowers,\" the individual named Fábio Alexandre, with the unique identifiers A4253 and F1425, is credited as a miscellaneous crew member. Specifically noted as the location manager, Alexandre's contribution is essential to the film's production.\n\nThe movie companies listed in the IMDb data are EWP Films and Española Way Productions, both based in Brazil. EWP Films is identified by the name code E1452 and a unique MD5 checksum of b44bf19fad6195dd054589607dec3b7a, while Española Way Productions is associated with the name code E2141 and a distinct MD5 checksum of 1ab7c3d332f423b2439b9bb220826566. Both companies are classified as production companies.\n\n"
    },
    {
        "title": "Untitled Loch Ness Monster Project",
        "dict_description": "In 2016, a movie titled \"Untitled Loch Ness Monster Project\" was produced. The movie is identified by the ID 2468797 and has a phonetic code of U5343. The MD5 checksum for this movie is f16de951d3ea8f5dde1d54502e09ae71.\n\nThe movie information includes that the film is in English language, shot on OFM 35 mm film with a ratio of 1.85:1. It was released in the USA in 2016. The movie is in color and belongs to the adventure genre.\n\nIn the movie \"Untitled Loch Ness Monster Project,\" Randal Atamaniuk, identified by the p-codes A3526 and R5343, is involved as a producer, writer, and director. The cast information includes Atamaniuk's roles noted as (producer) and (screenplay).\n\nThe movie companies data includes details about a production company named Stainless Steel Productions based in Canada. The company is identified by the name code \"S3542\" for both the primary and secondary name codes. The MD5 checksum for this company's information is \"f07da14e1012eddb4088bc017f856269.\" The type of company is classified as production companies.\n\n"
    },
    {
        "title": "Guns, Hookers & a Pound of Coke",
        "dict_description": "In 2016, the movie \"Guns, Hookers & a Pound of Coke\" was released. The film is identified by the title ID 1931339 and phonetic code G5262. Its MD5 checksum is 48c7d6c0b4f4b70a45b1557e28b307e1.\n\nThe movie was released in the USA in 2016. It is categorized under the genres of Action, Adventure, and Crime. The film was also released in the country of USA.\n\nThe movie \"Guns, Hookers & a Pound of Coke\" features Ford Austin, who is credited as an actor, producer, and writer. In the film, he portrays the character named Steve. Additionally, Ford Austin is noted as a producer and for contributing to the story of the movie. In the movie \"Guns, Hookers & a Pound of Coke,\" Marc Wasserman, identified by the name code W2656, M6265, and W265, plays the roles of an actor and a producer. He portrays the character Johnny, with the name code J5. Additionally, Wasserman is credited as an executive producer in the cast information. In the movie \"Guns, Hookers & a Pound of Coke,\" Dave Cohen, identified as VI on IMDb, is a male producer. He is credited as an executive producer in the cast info section. In the movie \"Guns, Hookers & a Pound of Coke,\" Brad Paulson, identified with the name code P4251 and surname code P425, contributed as a male writer. The data is uniquely identified by the MD5 checksum 9d1d06dfaabe127810bb309d76cdb60b.\n\nThe keyword information includes several entries. The first keyword is \"ampersand-in-title\" with a phonetic code of A5162. The second keyword is \"based-on-true-story\" with a phonetic code of B2353. The third keyword is \"blow-job\" with a phonetic code of B421. The fourth keyword is \"cocaine\" with a phonetic code of C25. The fifth keyword is \"comma-in-title\" with a phonetic code of C534. The sixth keyword is \"goon\" with a phonetic code of G5. The seventh keyword is \"gun\" with a phonetic code of G5. The eighth keyword is \"prostitute\" with a phonetic code of P623. The ninth and final keyword is \"punctuation-in-title\" with a phonetic code of P5235.\n\nThe movie companies listed in the IMDb data include UBFilm.com, a distributor based in the US with the unique codes U1452; Angry Baby Monkey Pictures, a US-based production company identified by the code A5261; Ford Austin Company, a US production company with the code F6323; and Res Ipsa Productions (II) and Res Ipsa Productions, both US production companies distinguished by the code R2121. Each company is associated with a specific type, such as distributors or production companies, and is uniquely identified by an MD5 checksum for data integrity.\n\n"
    },
    {
        "title": "Zero Tolerance",
        "dict_description": "In 2016, the movie \"Zero Tolerance\" was released, identified by the IMDb ID 2518849. The phonetic code for this production is \"Z6346,\" and its MD5 checksum is \"e839d5615b662a0343dc6a7f2c5381cb.\" This film falls under the category of movies.\n\nThe movie's primary language is English. Filming locations include Kendal, Cumbria, England, UK, and New York, USA. It was released in the UK on June 4, 2016, and in the USA on the same date. Taglines for the movie are \"Stamp out bullying in schools\" and \"Let down by the administration.\" The budget for the film was $50,000. The movie is in color and is categorized under the genres Documentary, Family, and Reality-TV. The film was produced in the UK and the USA.\n\nIn the movie \"Zero Tolerance,\" Rick McLeod, identified by the name code M2436, R2524, and M243 respectively, and with an MD5 checksum of 265f7c66c6d8964f6c4f2af1195c277d, plays multiple roles including producer, writer, and director. He is credited as a co-producer in the cast information section. In the movie \"Zero Tolerance,\" Charlotte Elizabeth Mcleod, identified with the name code M2432, contributes as a female writer. The cast information for this role is available.\n\nThe IMDb keyword information includes various keywords and their corresponding phonetic codes. The keywords are as follows: \"anti-bullying\" with a phonetic code of A5314, \"anxiety\" with A523, \"blind-eye\" with B453, \"bullying\" with B452, \"children\" with C4365, \"cumbria\" with C516, \"denial\" with D54, \"educational\" with E3235, \"high-school\" with H24, \"hospitalization\" with H2134, \"lake-district\" with L2323, \"name-calling\" with N5245, \"physical-abuse\" with P2412, \"primary-school\" with P6562, \"schools\" with S242, \"social-exclusion\" with S2424, \"suicide\" with S23, \"verbal-abuse\" with V6141, \"victim\" with V235, and \"zero-tolerance\" with Z6346. Each keyword is associated with a unique phonetic code for identification purposes.\n\nThe movie companies data includes details about a production company named Celtic Storm Films from the United Kingdom with the name code C4323. The company's MD5 checksum is 043d991813613c8070f1c0b7d81bcab3.\n\n"
    },
    {
        "title": "Angry Birds",
        "dict_description": "In 2016, the movie \"Angry Birds\" was released. The film is identified by the ID 1688430 and has a phonetic code of A5261. The MD5 checksum for this movie is 89e216aecd8b163b30fb02db5c656699.\n\nThe movie information includes details about the release dates and countries. The movie was released in the USA in 2016 and belongs to the genre of Animation.\n\nIn the movie \"Angry Birds,\" John Cohen, identified with the IMDb index VI and the primary name code C525, J525, and surname code C5, is credited as a producer. This role is specifically noted as \"(producer)\" in the cast information. The movie \"Angry Birds\" features David Maisel as a producer, with the additional role of consulting producer noted. David Maisel is identified by the primary name code \"M2431,\" secondary name code \"D1352,\" and surname code \"M24,\" with an associated MD5 checksum of \"6d7bc9f23028a12298c3eb1d51e72f7e.\"\n\nThe keyword_info data includes a single keyword entry: \"based-on-video-game\" with a corresponding phonetic code of \"B2351\".\n\nThe movie companies data includes details about a production company named Rovio Mobile. The company is based in the United States and is identified by the production company code R1514. The MD5 checksum for this company's information is f18786e4a09ae610edb03775b347b39f.\n\n"
    },
    {
        "title": "Mumbai Musical",
        "dict_description": "In 2016, the movie \"Mumbai Musical\" was released, identified by the unique ID 2134798. The phonetic code for this production is \"M5152,\" and its MD5 checksum is \"692317d6eb5135a726a4ad7a9e47e95b.\" This film falls under the category of movies.\n\nThe movie information includes that the film is in English and Hindi languages, with a release date in the USA on 18th March 2016. The movie is set to be loosely based on the Hindu mythology of \"Ramayan.\" It is a color film produced in the USA, belonging to the genres of Adventure, Animation, Family, and Musical.\n\nThe movie \"Mumbai Musical\" features Paul Mayeda Berges as a male producer. Berges is uniquely identified by the primary codes B6214 for his name and P4531 for his name without considering case sensitivity, with a surname code of B62. The MD5 checksum associated with Berges is 2a6503bd25c8b918bff14238295da306. In the cast information, Berges is credited as a producer, denoted by the note \"(producer)\". In the movie \"Mumbai Musical,\" Gurinder Chadha, a female individual with the name code C3265 for the name and code G6536 for the non-family name, takes on the roles of producer and writer. She is identified by the surname code C3 and an MD5 checksum of 17608a3a3e5f3132d86f2ddaa00906d8. Chadha's contributions to the film include producing and writing, as noted in the cast info section where she is specifically credited as the producer and for the screenplay. In the movie \"Mumbai Musical,\" Christopher Chase, identified by the name codes C2623 and C6231, and surname code C2, is involved as a producer. This role is specifically denoted by the note \"(producer)\" in the cast information. In the movie \"Mumbai Musical,\" Lisa Stewart, identified with the IMDb index \"I\" and coded as S3634 for her name and L2363 for her first name, is credited as a female producer. The role of producer is explicitly noted in the cast information as denoted by the term \"(producer).\" In the movie \"Mumbai Musical,\" Stefan Schwartz, identified as \"I\" on IMDb, contributed as a male writer with the name codes S2632 and S3152. His unique MD5 checksum is a8d9f4e86fbabc8b45dd108d98179d55. Specifically noted as the libretto writer, Schwartz's role in the film is significant. In the movie \"Mumbai Musical,\" David Sussman, credited as David Sussman II on IMDb, is involved as a male writer, specifically noted for his contribution to the screenplay. In the movie \"Mumbai Musical,\" the composer is A.R. Rahman, a male individual with the primary name code \"R56,\" secondary name code \"A65,\" and surname code \"R5.\" Rahman's unique identifier is the MD5 checksum \"c848bea3899e86bf0c683569fc593208.\" He is credited for the music in the film, indicated by the note \"(music by)\" in the cast information. In the movie \"Mumbai Musical,\" the composer is Stephen Schwartz. Stephen Schwartz is indexed as \"I\" on IMDb, is male, and has primary name codes S2632 and S3152. The MD5 checksum associated with Stephen Schwartz is 0b22214b78c4ef32ec21495cd88de41d.\n\nThe IMDb data includes information about movie companies. The first company listed is DreamWorks Animation from the United States, identified by the name codes D6562 and a unique MD5 checksum. This company is categorized as a distributor. The second company is Twentieth Century Fox Film Corporation, also from the US, with the name codes T5325 and a distinct MD5 checksum. Like DreamWorks Animation, Twentieth Century Fox Film Corporation is classified as a distributor. The third company mentioned is DreamWorks Animation, once again from the US, with the same name codes and MD5 checksum as the first instance. However, this time, it is labeled as a production company.\n\n"
    },
    {
        "title": "Untitled Big Bopper Project",
        "dict_description": "In 2016, a movie titled \"Untitled Big Bopper Project\" was produced. The movie is identified by the ID 2468515 and has a phonetic code of U5343. The MD5 checksum for this movie is 6e9bd39bda50aadfe47977a6c75f1457.\n\nThe movie information includes details about the film being from the USA and belonging to the Biography genre.\n\nIn the movie \"Untitled Big Bopper Project,\" Sohrab Mirmont, identified with the name code M6532 and surname code M653, is involved as a male producer and director. He is credited under the name Sohrab Mirmontazeri for his role as a producer. Additionally, he is noted as being \"attached\" in the cast information. In the movie industry, there is an upcoming project titled \"Untitled Big Bopper Project,\" categorized as a movie. The individual involved in this project is J.P. Richardson, identified with the gender male and unique codes R2632 and J1626. Richardson plays the role of a producer, with a specific note indicating his position as an executive producer.\n\nThe movie companies data includes details about MirMont Media, a production company based in the United States with the name code M6535. The company's MD5 checksum is 4e519fa16314b5a0d44aa08e2345c8d9.\n\n"
    },
    {
        "title": "Las Bandoleras",
        "dict_description": "In 2016, the movie \"Las Bandoleras\" was released, with the unique identifier 2053304. The phonetic code for this production is \"B5346,\" and its MD5 checksum is \"afe8ab01f2a6f30c8a8e5ec24171bb66.\" This film falls under the category of movies.\n\nThe movie's primary language is Spanish. It was released in Mexico in 2016 through a DVD premiere. The budget for the film was MXN 300,000. The movie is in color and belongs to the adventure genre. It was produced in Mexico.\n\nIn the movie \"Las Bandoleras,\" the actor Felix Rosales Alvarez is rumored to be part of the cast. Alvarez, identified with the name code A4162 for current projects and F4262 for past works, is a male performer. The MD5 checksum associated with Alvarez is 4f949013bfbec8c7d438387c8ff779ef. His role in the film is that of an actor, as indicated in the cast information. In the movie \"Las Bandoleras,\" Flavio Peniche, identified with the name code P5214, rumored to be part of the cast, plays the role of an actor. Peniche, a male actor with the name code F4152 and surname code P52, is associated with the MD5 checksum f7e468889a92e1ab46178b43319da052. In the movie \"Las Bandoleras,\" Miguel Ponce, identified with the IMDb index \"V\" and male gender, is rumored to have a role as an actor. The cast information includes a note indicating that his involvement is rumored. In the movie \"Las Bandoleras,\" the actor Bruno Sáinz Talaia is rumored to have a role. Bruno Sáinz Talaia, identified by the p-codes T4165 and B6525 for name and T4 for surname, respectively, is a male performer. The unique identifier for Bruno Sáinz Talaia is the MD5 checksum 753afc939d5b864094da63bd7a9b79c3. He is credited in the cast as an actor. In the movie \"Las Bandoleras,\" Marina Carbajal, a female actress with the primary profession code C6124 and the normalized form code M6526, is rumored to be part of the cast. The MD5 checksum associated with Marina Carbajal is 8e3282e8446158e7f5a1592f2a8bc9c2. The role she plays in the movie is that of an actress, as indicated in the cast information. The movie \"Las Bandoleras\" features Jesus Alberto Rodriguez Alarcon as the director. Alarcon is identified with the name code A4625 and the normalized name code J2416, and is male. The cast information for this movie includes Alarcon in the role of director.\n\nThe IMDb data includes information about two movie companies. The first company is Videomex International, a distributor based in Mexico with primary codes V3525 and md5sum 7b6306218265f21f2c50014b08e71ad5. The second company is Baja California Film Commission, a production company located in the United States with primary codes B2416 and md5sum 97185c81eec92ea6f3096f99f26fc8df.\n\n"
    },
    {
        "title": "Pushing Life",
        "dict_description": "In 2016, the movie \"Pushing Life\" was released, identified by the unique ID 2224135. The phonetic code for this production is \"P2524,\" and its MD5 checksum is \"a73411815c9e523ff55cd9d578a9a8a1.\"\n\nThe movie \"Pushing Life\" is in English and was released in the USA in 2016. It tells the inspirational story of Terry Hitchcock, a man who, after losing his wife to breast cancer, ran 75 consecutive marathons in 75 days at the age of 57. The film, categorized as a Drama, is produced in color and originates from the United States.\n\nIn the movie \"Pushing Life,\" Mark Castaldo, identified with the IMDb index \"I\" and the name codes C2343 and M6234, and with a gender of male, plays the role of a producer. This information is confirmed by the note \"(producer)\" associated with his cast info entry. The MD5 checksum for Mark Castaldo is 7a846fddc30eedf57c2950b0831735b0. In the movie \"Pushing Life,\" Tim VandeSteeg, identified by the name code V5323 and T5153, is involved as a male producer, writer, and director. He is credited as a producer in the cast information. The movie \"Pushing Life\" features Tony Boland, identified by the name codes B4535 and T5145, with a surname code of B453. Boland's MD5 checksum is 70c12ee702265601740f909a238dd24b. In the film, Boland takes on the role of a writer. The cast information for this movie is available. In the movie \"Pushing Life,\" Jeffrey Turner, credited as a writer, is involved in the cast info. Jeffrey Turner is identified by the IMDb index \"I\" and has primary name codes T6562 and J1636, with a surname code of T656. The MD5 checksum associated with Jeffrey Turner is 8b5b4364826d6949a9e3ddd2b44f9825.\n\nThe movie companies listed in the IMDb data are Destiny Pictures and Indiewood Pictures, both based in the United States. Destiny Pictures is identified by the name code D2351, with a corresponding MD5 checksum of f781e17c5498bac3e0d395514139075b, while Indiewood Pictures is associated with the name code I5312 and an MD5 checksum of 1addee799998c9fd6a2009a5e2cbe2b3. These companies are categorized as production companies within the film industry.\n\n"
    },
    {
        "title": "Outgrowth",
        "dict_description": "In 2016, the movie \"Outgrowth\" was released, identified by the IMDb ID 2183752. The phonetic code for this production is \"O3263,\" and its MD5 checksum is \"d9fca232ed9f10dcdac02135de4ffb46.\"\n\nThe movie information includes details about a film from Sweden. The genres associated with this movie are Action, Adventure, Fantasy, and Thriller.\n\nThe movie \"Outgrowth\" features Tomas Amlöv in the roles of producer, producer, writer, and writer. Tomas Amlöv is a male individual with the primary name code \"A5413,\" nickname code \"T5254,\" and surname code \"A541.\" He is identified by the MD5 checksum \"6759251e2d6032a2faa0d825c6c04133.\" In the cast info, Tomas Amlöv is credited with the notes \"(development executive),\" \"(producer),\" \"(creator),\" and \"(story).\" In the movie \"Outgrowth,\" Jesper Pingo Lindström, identified by the p-codes L5323 and J2161, is credited as a writer. Specifically noted as contributing to the story under the alias J. Pingo Lindstrom, Lindström's role in the film's creation is significant.\n\nThe movie company information from IMDb includes details about a production company named Timelock Film based in Sweden. The company is identified by the name code \"T5421\" for both the primary and secondary name codes. The MD5 checksum for this company's data is \"b37d68351e5c3edd605143098482427a.\" This information falls under the category of production companies.\n\n"
    },
    {
        "title": "Army of Darkness 2",
        "dict_description": "In 2016, the movie \"Army of Darkness 2\" was released. The film is identified by the phonetic code A6513 and has an IMDb ID of 1695344. Its MD5 checksum is 0a472caa7dc87b0fdb34c933403ae256.\n\nThe movie information includes that the film is in English and was released in the USA in 2016. It is a color film and belongs to the genres of Action, Comedy, Fantasy, and Horror. The movie was produced in the USA.\n\nIn the movie industry, the film titled \"Army of Darkness 2\" falls under the category of movies. The individual involved in the production is Robert G. Tapert, identified with the primary name code \"T1636\" and secondary name code \"R1632,\" while the surname code is \"T163.\" Robert is a male producer, as denoted by the gender \"m\" in the data. His unique identifier is the MD5 checksum \"0b14b1bc225f384df6352decc79180c9. The specific role he plays in the movie is that of a producer, as indicated by the note \"(producer)\" in the cast information. In the movie \"Army of Darkness 2,\" the writer credited is Ivan Raimi. Raimi, identified with the name code R515 for the primary name and I1565 for the name without diacritics, is a male individual with the surname code R5. The MD5 checksum associated with Raimi is ce1df3883ae10e91757d08ba72e66635. The specific role attributed to Raimi in this production is that of a writer. The cast information for this entry is empty, containing no additional details. In the movie \"Army of Darkness 2,\" Sam Raimi, identified with the name code R525 for his full name and S565 for his first name, is involved as a male writer. The unique identifier for Sam Raimi is the MD5 checksum 23827fa32293fc839cba8ceaad34d69b. The cast information for this movie includes Sam Raimi in the role of a writer.\n\nIn the IMDb keyword information, there are three keywords listed. The first keyword is \"book-of-the-dead\" with a phonetic code of \"B213\". The second keyword is \"necronomicon\" with a phonetic code of \"N2652\". Lastly, the third keyword is \"sequel\" with a phonetic code of \"S24\". Each keyword is uniquely paired with its corresponding phonetic code in the dataset.\n\nThe movie companies data includes details about a production company named Ghost House Pictures from the United States. The company is identified by the name code \"G2321\" for both primary and secondary purposes. The MD5 checksum for this company's information is \"0206c595be978fbadda4a391038ca98e\".\n\n"
    },
    {
        "title": "Cranium Intel",
        "dict_description": "In 2016, the movie \"Cranium Intel\" was released, identified by the unique ID 1791810. The phonetic code for this production is \"C6534,\" and its MD5 checksum is \"f03dedac22ee542cf20b9ffbcdd8a404.\"\n\nThe movie is in English and was filmed in various locations including Washington DC, USA, St. Louis, Missouri, USA, and Pontoon Beach, Illinois, USA. The technical information reveals the use of cameras like CAM: Red Epic and recording format OFM: Redcode RAW, with a ratio of RAT: 1.85:1. It was released in the USA on 22 May 2016 in St. Louis, Missouri, and in New Zealand on 24 June 2016. The tagline for the movie is \"The Final Execution,\" and the budget for the production was $2,400,000. An adaptation of the movie titled \"Cranium Intel: Gateway 2020\" was published on 1 May 2012 by Royal Middleton Publishing. The plot revolves around the President's mission to eliminate a scientist named Micheal W. Logan who discovers the Gateway Arch in St. Louis is a portal to another planet. The movie is in color and belongs to genres such as Action, Adventure, Animation, Sci-Fi, and Thriller.\n\nIn the movie \"Cranium Intel,\" Christopher 'FreeSol' Anderson, a male actor, plays the role of a Special Operations Officer. The character's name is provided as \"Special Operations Officer.\" Christopher 'FreeSol' Anderson's primary name code is A5362, and his normalized primary name code is C6231. The MD5 checksum associated with Christopher 'FreeSol' Anderson is 56982f473eec9232655781a12bb2d648. The character's name code is S1241, the surname code is O126, and the MD5 checksum for the character is 3ef61100ca451669427f94569332ebac. The role portrayed by Christopher 'FreeSol' Anderson in the movie is that of an actor. The cast information for this movie is available. In the movie \"Cranium Intel,\" Jayson Koko Bridges, identified by the p-codes B6325 and J2521, portrays the characters Micheal W. Logan and Agent# 1. Bridges is a male actor, with a surname p-code of B632 and an md5sum of ecf8541cc0925143aa29e6837fdc7fde. He takes on the roles of two actors in the film. The character Micheal W. Logan is also known by the name p-code M2425 and surname p-code L25, with an md5sum of 259592c46386c4ad8a8c248d7dfd3547. The character Agent# 1, identified by the name p-code A253 and md5sum d6a0f5ce85e674a5ca2ed4cd451c2171, is another role Bridges embodies. The cast info includes two entries, each corresponding to a character portrayed by Bridges in the movie. In the movie \"Cranium Intel,\" Everett Carter III, a male actor, plays the role of Drunk Man #1. The character's name code is D6525, and the MD5 checksum for the character is bc61c9f5c97b2be6d928c0401f0657a1. The information about the cast is provided in the structured data. The movie \"Cranium Intel\" features Hardley Davidson, a male actor and composer, who portrays the character President Scott Collins. Davidson is credited with the roles of actor and composer in the film, with his character noted as \"(voice)\" and for contributing the \"original score.\" The movie \"Cranium Intel\" features Alexandre Duong, a male actor, who plays the roles of Jin Huo and Agent# 3.5. Jin Huo is coded as \"J5\" for the name and \"H\" for the surname, with an associated md5sum of \"bb94ebf5cbf0faa2bf08930191e5ce9c.\" Agent# 3.5 is coded as \"A253\" for the name, with an md5sum of \"5b1370f51394e09fa3540d4011a22f5d.\" The cast info includes two entries, each corresponding to one of the roles portrayed by Alexandre Duong in the movie. The movie \"Cranium Intel\" features Leon Fleisher, credited as an actor with the IMDb index II. Fleisher's gender is male, and his primary name code is F4264, with a secondary code of L5142, and a surname code of F426. The MD5 checksum associated with Fleisher is 432e0ec8252285d1580cf2fa95dda7e4. In the film, Fleisher portrays the character Red Falcon - EXTeam, with a primary name code of R3142, a surname code of E235, and an MD5 checksum of bb697e19f0ad6ed3d6f619a648558e1e. The role attributed to Fleisher is that of an actor, and the cast information is provided within the structured data. The movie \"Cranium Intel\" features Michael Fletcher in the role of an actor. In the movie, Fletcher portrays the character Peyton Mitchell Fletcher, who holds the position of Vice President of the United States. Fletcher is identified with the IMDb index XV and is male. His primary name code is F4326, while the secondary name code is M2414. The MD5 checksum associated with Fletcher is fc9394c277ea6a2cad46da8a5be09b9e. The character name \"Peyton Mitchell Fletcher - Vice President of the United States\" is linked to the primary name code P3532 and the surname code S32, with an MD5 checksum of 23af5248f00aa23acad36be33819bd99. The cast information for this movie is provided within the structured data. In the movie \"Cranium Intel,\" James Hargrove II, identified by the p-codes H6261 and J5262, portrays the character Agent# 2. Hargrove II's gender is male, and his unique identifier is a47274c11d8575fb66f46a05b2683c63. He is credited as an actor in the film. The character he plays, Agent# 2, is identified by the p-code A253 and has the unique identifier 4836354fa3dbc5f584b656c412fc4163. The cast information for this movie is detailed within the provided data. In the movie \"Cranium Intel,\" Kyjuan, identified with the name code K25 and a male gender, plays the role of an actor. He portrays the character named Weazel, with the name code W24. The unique MD5 checksum for Kyjuan is c70be9f8917720b3349dc53a02276247, while the character Weazel has a distinct MD5 checksum of cf6f9f80d1dcdd20da87dde5ff24fea2. The cast information for this movie includes Kyjuan as an actor playing the character Weazel. The movie \"Cranium Intel\" features David Masterson, credited as an actor, in the roles of Adam Steinberg - Secretary of Defense and Helicopter Operator C5. Masterson is identified with the IMDb index II and is male. His primary name code is M2362, with an alternative code of D1352, and his MD5 checksum is eae33bba5251c5f3b8bfc225245cdbaf. The character Adam Steinberg - Secretary of Defense is associated with the name code A3523 and surname code D152, with an MD5 checksum of e17c7f6e15dcfb7df4b01ea227120aaa. The character Helicopter Operator C5 is linked to the name code H4213 and surname code C, with an MD5 checksum of b979c34411a4f7021dcc9968e40e3a7d. The cast information includes two entries. The movie \"Cranium Intel\" features Aeneas Middleton, a male actor, producer, writer, director, editor, and production designer. In the film, Middleton portrays James Whitaker, the President of the United States, and Henry Blades, the Leader of EXTeam. Additionally, Middleton is credited as an actor, producer, writer, director, editor, and production designer. The cast information includes Middleton as an executive producer, involvement in the novel, screenplay, and being attached to the project. The movie \"Cranium Intel\" features Todd Senofonte in the role of an actor. He portrays the character named Paul Excalibur. Todd Senofonte is male and is identified by the primary code \"S5153\" for his name and \"T3251\" for his name without diacritics. The MD5 checksum for Todd Senofonte is \"9717bf5d784fa3bef0fbd36985db870d\", while for the character Paul Excalibur, it is \"43634991a4a0730719f764a865035c28\". In the movie \"Cranium Intel,\" Clinton Sparks, credited as Clinton Sparks II on IMDb, portrays the character Captain Harris. Sparks is listed as an actor in the cast information. The character Captain Harris is uniquely identified by the name code \"C1356\" and surname code \"H62,\" with an associated MD5 checksum of \"bcd2168065d27545eb3860d6d7dc2000.\" The movie is categorized as a film. The movie \"Cranium Intel\" features Adi Spektor in the role of an actor. In the film, Spektor portrays the character Xavier Street, specifically known as the President of the Circle District of America. Adi Spektor's gender is male, and his unique identifiers include the name code \"S1236\" and \"A3212,\" with an MD5 checksum of \"810ac37958a3d9f818dd4b8df45619c8.\" The character Xavier Street is further identified by the name code \"X1623,\" surname code \"A562,\" and an MD5 checksum of \"541e93487250630e9d778c88184833c4.\" The cast information for this movie is detailed within the structured data. The movie \"Cranium Intel\" features Eric Vidal in the role of an actor, specifically portraying the character named Dj# 2. Vidal is indexed as \"III\" on IMDb, with a gender of male. His primary name code is \"V3462,\" while the secondary name code is \"E6213,\" and the surname code is \"V34.\" The MD5 checksum associated with Vidal is \"eec3d622ae7e7c46a4620a6c20849ca6.\" The character Dj# 2 is uniquely identified by the name code \"D2\" and has an MD5 checksum of \"5aa251d7de8aec09c3f293b120717247.\" The cast information for this movie is provided within the structured data. The movie \"Cranium Intel\" features actor Nick Vidal in the role of Dj# 1. Vidal is identified with the IMDb index III and is male. His primary name code is V3452, with a secondary name code of N2134, and a surname code of V34. The MD5 checksum associated with Vidal is 708d4dab7641d728293f60120a8a3fc1, while Dj# 1 is linked to the MD5 checksum b5ee363aa2ac6ec6acda85e7efafc1. Vidal's character is part of the cast info for the movie. The movie \"Cranium Intel\" features actress Joanne Jeffers in the role of the character \"First Lady - The Circle District of America.\" Joanne Jeffers is identified with the primary name code \"J1625\" and the secondary name code \"J5216,\" while her surname code is \"J162.\" She is categorized as female and her unique identifier is \"dc5252b6cb596c8630e1a916b963df10.\" The character \"First Lady - The Circle District of America\" is associated with the primary name code \"F6234\" and the surname code \"A562,\" with a specific identifier of \"3b299575a654cfa88f3475608f2c2315.\" The cast information for this movie is provided within the structured data. In the movie \"Cranium Intel,\" Romie von Klinger, a female actress with the name code K4526, known also as R5152, portrays the character Jennifer Lee Johansson. Jennifer Lee Johansson, identified by the name code J5164 and surname code J525, is a role played by Romie von Klinger. The unique identifier for Romie von Klinger is b8267b6bf7357c84af90819c71b17af0, while Jennifer Lee Johansson is distinguished by the md5sum 6035f2160b859f2acb9449c4332754a6. Romie von Klinger's role in the movie is solely as an actress. The movie \"Cranium Intel\" features Denise Moreno, credited as actress, in the role of Neo-Machine Agent# 2.0. Denise Moreno is identified with the IMDb index II and is of female gender. Her primary name code is M6535, with alternative codes D5256 and M65. The MD5 checksum for Denise Moreno is cbe7841cfa9a0d799920450418fc2a06, while for her character, it is 3cbb828cd1f0b0fafdbc6af51ea7436a. The movie \"Cranium Intel\" features actress Amy Lee Palmer in the role of Natasha - EXTeam. Amy Lee Palmer is identified by the primary code P4565 for her name and A5414 for her name without the surname, with the surname code P456. She is of female gender and has an MD5 checksum of d8f7633f5226fba714a24ff4760219b3. The character Natasha - EXTeam is also represented by the name code N3235 and the surname code E235, with an MD5 checksum of 6e37e0561c6b3a5a593fe711d229bfc8. The cast information for this movie is provided within the structured data. In the movie \"Cranium Intel,\" Kevin Gundaker, identified by the name codes G5326 and K1525, plays the role of a producer. He is credited as an executive producer in the cast information. The movie \"Cranium Intel\" features John Honoré in the role of a cinematographer. Honoré is identified with the gender male and has the following codes associated with his name: name_pcode_cf - H5625, name_pcode_nf - J56, and surname_pcode - H56. Additionally, he is uniquely identified by the MD5 checksum 1e1111a559891ff3e830c73464434c83. In the cast info, it is noted that John Honoré serves as the director of photography for the film. The movie \"Cranium Intel\" features Shae Sterling, a male individual credited as a miscellaneous crew member. Shae Sterling's primary role in the production was as a location manager in New Zealand.\n\nThe IMDb keyword information includes various keywords and their corresponding phonetic codes. The keywords encompass a range of themes and concepts found in movies, such as \"3-dimensional,\" \"assassination,\" \"based-on-novel,\" \"chase,\" \"dystopian,\" \"electronic-music-score,\" \"fight-to-the-death,\" \"genetic-engineering,\" \"nightclub,\" \"power-suit,\" \"robot,\" \"space-travel,\" \"suspended-animation,\" and \"white-house.\" Each keyword is linked to a phonetic code for identification, like \"D5254\" for \"3-dimensional,\" \"A2535\" for \"assassination,\" \"C2\" for \"chase,\" \"E2135\" for \"escape-attempt,\" \"G5325\" for \"genetic-engineering,\" \"N2324\" for \"nightclub,\" \"P623\" for \"power-suit,\" \"R13\" for \"robot,\" \"S1236\" for \"space-travel,\" and \"W32\" for \"white-house.\" This structured data provides a comprehensive overview of key themes and elements associated with movies in the IMDb database.\n\nThe movie companies involved in the production of the film include Burnin Rubber Music Publishing / Royal Middleton Publishing from the United States with name codes B6561, Coldwell Banker Gundaker also from the US with name codes C4341, and Tri-City Speedway - Illinois from the US with name codes T6232. Each of these companies is categorized as production companies. The unique MD5 checksums for these companies are 3d00a93bbccdf488344f15deb311f46f, 03a0a8019faa6cea6497291cbaa834d0, and 47cf62cb578943ff6296909a6319e890 respectively.\n\nThe movie \"Cranium Intel: Gateway 2020\" is also known by the alternate title \"Cranium Intel: Gateway 2020.\" This alternative title is designated as an international English title. The movie was produced in the year 2016. The phonetic code associated with this alternate title is \"C6534.\" The unique identifier for this alternate title is 74532, linked to the movie with the ID 1791810. Additionally, it is noted as an alternative title. The MD5 checksum for this data is \"daba8b916be259da498645ccfbaa1864.\"\n\n"
    },
    {
        "title": "Star Trek 3",
        "dict_description": "In 2016, the movie \"Star Trek 3\" was released. The movie has the IMDb ID 2310404 and a phonetic code of S3636. The MD5 checksum for this movie is 2ff89620c4d8ac97eb77619fceff7c83.\n\nThe movie information includes that the film is in English and was released in the USA in 2016. It is a color film belonging to the genres of Action, Adventure, and Sci-Fi. The movie was produced in the USA.\n\nIn the movie \"Star Trek 3,\" J.J. Abrams, a male individual with the primary code \"A1652\" and secondary code \"J2165,\" is involved as a producer. This role is specifically noted as \"(producer)\" in the cast information. In the movie \"Star Trek 3,\" Gene Roddenberry, identified with the name code R3516 and G5635, contributed as a male writer. His role in the film was specifically related to the creation of characters, as denoted by the note \"(characters)\" in the cast info.\n\nThe keyword information includes several entries: \"based-on-cult-tv-series\" with a phonetic code of B2352, \"based-on-tv-series\" and \"based-on-tv-show\" both sharing the phonetic code B2353, \"sequel\" with the code S24, \"sequel-to-a-reboot\" coded as S2436, \"star-trek\" with the code S3636, \"third-part\" coded as T6316, and \"thirteenth-part\" with the phonetic code T6353.\n\nThe movie companies data includes one entry for Paramount Pictures, a production company based in the United States. The company's name code in the NF and SF systems is P6531, and its MD5 checksum is 366857dfcb81be550d76b5ac30b38935.\n\n"
    },
    {
        "title": "Hurricane Kid",
        "dict_description": "In 2016, the movie \"Hurricane Kid\" was released, identified by the ID 1964522. The phonetic code for this production is \"H6252,\" and its MD5 checksum is \"d4cf2e56957108c21731f84573e2f5c0.\"\n\nThe movie is in English and has a runtime of 96 minutes. It was released in the USA in 2016. The tagline for the movie is \"Be Somebody!\" with a budget of $15,000,000. The plot revolves around Todd Lawrence, a former Mixed Martial Arts star, who is given a chance at redemption when his estranged son brings him back to the ring as a trainer. The movie is in color and is categorized under the action genre. The technical information states that the aspect ratio is RAT:1.85:1. The film was produced by HURRICANEKIDPROD and is set in the USA.\n\nIn the movie \"Hurricane Kid,\" Jon Lee Brody, a male actor, producer, and writer, plays the character Charlie Gold. He is credited as a producer and for the story in the cast information. Jon Lee Brody's name is encoded as B6325 for the name and J5416 for the name without the surname, while his surname is encoded as B63. The MD5 checksum for Jon Lee Brody is bc1260ae065b23378b5b44af43e0636f, and for the character Charlie Gold, it is 47cf53c4f74394af1f0df684abb4d09e. In the movie \"Hurricane Kid,\" Shad Gaspard, a male actor known by the name code G2163 and code S3216, is rumored to play the role of Mike 'The Mangler' Miller. The character's name code is M2352, and the surname code is M46. Gaspard's MD5 checksum is 31d17f9cc083bc0e795a47e7dd1de389, while the character's MD5 checksum is 8279bf3d8a702995f469ef73d408f375. The cast information includes a note indicating that Gaspard's involvement in the movie is rumored. In the movie \"Hurricane Kid,\" Stephen Kramer Glickman, a male actor, is rumored to play the character Eddie. In the movie \"Hurricane Kid,\" Gonzalo Menendez, identified by the name code M5325, is cast as an actor, portraying the character Danny Wright. The character is denoted by the name code D5623. The role is marked as \"(rumored).\" In the movie \"Hurricane Kid,\" John Edward Betancourt, identified by the p-codes B3526 and J5363, is credited as a writer. His role specifically pertains to the screenplay, as denoted in the cast info section. The MD5 checksum associated with Betancourt is bbb8e3d3f434b4a155d433d4fb6e498a.\n\nThe keyword information from IMDb includes a single keyword entry. The keyword is \"mixed-martial-arts\" and it is associated with a phonetic code \"M2356\".\n\nThe movie companies listed in the IMDb data are Aquarius Entertainment and Iron Will Productions. Aquarius Entertainment, with the production company code A2625, is based in the United States. The MD5 checksum for Aquarius Entertainment is 90053d1b804ef153b8c9e7d178d3f29c. Iron Will Productions, identified by the production company code I6541, also operates from the United States. The MD5 checksum for Iron Will Productions is 2f1acd392a226d111574003dd6355e83. Both companies are categorized as production companies in the IMDb dataset.\n\n"
    },
    {
        "title": "Through the Glass",
        "dict_description": "The movie \"Through the Glass,\" released in 2016, is identified by the unique ID 2434310 and phonetic code T6232 in the IMDb database. The MD5 checksum for this movie is 56891c52be044aab3dee1c8dabfc2d63.\n\nThe movie information includes details about the release dates, countries, and genres. The movie was released in the USA in 2016. It belongs to the drama genre and is associated with the country USA.\n\nThe movie \"Through the Glass\" features Fabien Hameline, a male individual credited as a producer and writer. The cast information specifies that Hameline is noted as the producer and also as the writer of the movie.\n\nThe keyword_info data includes a list with one keyword entry. The keyword \"based-on-true-story\" is represented with a phonetic code \"B2353\".\n\nThe movie companies data includes details about a production company named Garance Pictures from the United States. The company is identified by the name code \"G6521\" for both primary and secondary purposes. The MD5 checksum for this company's information is \"6647514ce8e98c5e46711cb188c6dde4.\"\n\n"
    },
    {
        "title": "The Tribe",
        "dict_description": "In 2016, the movie \"The Tribe\" was released, identified by the ID 2421394. The phonetic code for this production is \"T61,\" and its MD5 checksum is 6f07a34c143c4f46750b363854dc5a1a.\n\nThe movie information includes details about the film being from the USA and belonging to the Drama genre.\n\nIn the movie \"The Tribe,\" Jason Durdon, identified with the name code D6352 for his full name and J2536 for his first name, is credited as a male producer. The cast information specifies his role as a producer, denoted by the note \"(producer).\" In the movie \"The Tribe,\" James Duval, credited as II on IMDb, is a male producer. He is uniquely identified by the codes D1425 for his name and J5231 for his name without the surname. The surname code for Duval is D14, and his MD5 checksum is 338c3d8f6152895b09465f8c95251631. Duval's role in the film is that of a producer, specifically noted as an executive producer in the cast information. In the movie \"The Tribe,\" Toby Joynt, identified by the name code J531 and T1253, is credited as a producer. His surname code is J53, and his unique identifier is bd4d4db001c4d79dd9cc6357c372b5c4. Additionally, he held the role of a development executive, as indicated in the cast info section. In the movie \"The Tribe,\" Danny Torres, credited as Danny Torres II on IMDb, is involved as a producer. The specific role is denoted by the note \"(producer)\" in the cast info section. Torres' IMDb name primary code is T6235, with additional codes D5362 and T62 for different purposes. The MD5 checksum associated with Torres is cda8dfd610bc07fea8bdcbbb793e8820. In the movie \"The Tribe,\" Michael James Canales, identified by the name codes C5425 and M2425, is credited as a writer. The cast information for this entry is available.\n\nThe keyword information includes five entries. The first keyword is \"africa\" with a corresponding phonetic code of \"A162\". The second keyword is \"escape\" and its phonetic code is \"E21\". The third keyword listed is \"redemption\" with a phonetic code of \"R3513\". Following that is the keyword \"return\" paired with the phonetic code \"R365\". Lastly, the fifth keyword is \"slavery\" and its phonetic code is \"S416\".\n\nThe movie companies listed in the IMDb data are Continuum Motion Pictures. The first company, a distributor, is identified by the name code C5353 and is based in the United States. The second company, a production company, shares the same name and country as the distributor, also identified by the name code C5353. Both companies have the same MD5 checksum: 508c08b575867268d690cf5b5eeec4d4.\n\n"
    },
    {
        "title": "How to Train Your Dragon 3",
        "dict_description": "The movie titled \"How to Train Your Dragon 3\" was released in the year 2016. It has the unique identifier 1961996 and a phonetic code of H3656. The MD5 checksum for this movie is da0e8dcbc1b4056250cc20bdb4250f97. This entry corresponds to a movie in the IMDb database.\n\nThe movie information includes that the film is in English language, was released in the USA on 18 June 2016, is in color, and originates from the USA. The genres of the movie are Animation and Family.\n\nIn the movie \"How to Train Your Dragon 3,\" Jay Baruchel, a male actor, plays the character Hiccup Horrendous Haddock III. His name is encoded as B6242 for the full name and J1624 for the first name, while his surname is encoded as B624. Baruchel's unique identifier is c05abdf4e26e61b0aa290af4e1bc22a1. He portrays the character through voice acting, as denoted by the note \"(voice)\" in the cast info. The movie \"How to Train Your Dragon 3\" features Michael A. Connolly as a producer, with the additional credit of co-producer. The movie \"How to Train Your Dragon 3\" features Roy Lee as a male producer. Roy Lee is credited as a co-producer in the cast info section. The movie \"How to Train Your Dragon 3\" features John Powell, identified with the IMDb index \"I,\" who is a male composer. His primary name code is \"P425,\" secondary name code is \"J514,\" and surname code is \"P4.\" The MD5 checksum associated with him is \"2a14c75e6634452e5a8cf0a088801430.\" Powell's role in the movie is that of a composer. The cast information for this movie includes details about Powell's involvement as the composer, with no additional specific details provided. The movie \"How to Train Your Dragon 3\" features Dean DeBlois as the director. Dean DeBlois is a male individual with the primary name code D1423, secondary name code D5314, and surname code D142. The MD5 checksum associated with Dean DeBlois is bda2ab81b0550c60dfbccf36914a8c34. The specific role played by Dean DeBlois in the movie is that of a director.\n\nThe keyword information from IMDb includes three entries. The first keyword is \"sequel\" with a phonetic code of S24. The second keyword is \"third-part\" with a phonetic code of T6316. The third keyword is \"viking\" with a phonetic code of V252.\n\nThe movie companies listed in the IMDb data are DreamWorks Animation and Mad Hatter Entertainment. DreamWorks Animation, with the production code D6562, is a distributor based in the United States. Mad Hatter Entertainment, identified by the production code M3653, operates as a production company also located in the United States. The data includes unique MD5 checksums for each company, with DreamWorks Animation's being c9e4cf22c86c6a0dd26008c9068bd894 and Mad Hatter Entertainment's being aa294694d7dd6219aa99e00f8d5b1727. DreamWorks Animation falls under the category of distributors, while Mad Hatter Entertainment is classified as a production company.\n\n"
    },
    {
        "title": "Ocean Planet 3D",
        "dict_description": "In 2016, the movie \"Ocean Planet 3D\" was released, identified by the ID 2168207. The phonetic code for this production is \"O2514,\" and its MD5 checksum is \"5bb5158fac1659ef6451d8c8de1ea9c0.\"\n\nThe movie information includes that the film is in English, was released in the USA in February 2016, is in color, belongs to the genre of Documentary, and was produced in the USA.\n\nThe movie \"Ocean Planet 3D\" features Greg MacGillivray, a male individual known for his roles as a producer and director. MacGillivray's primary involvement in the film is as a producer, with an additional role as a director. The cast information includes a note specifying MacGillivray's role as a producer.\n\nThe keyword_info data includes three keyword entries: \"marine-life\" with a phonetic code of M6541, \"number-in-title\" with a phonetic code of N5165, and \"ocean\" with a phonetic code of O25.\n\nThe movie companies data includes one entry for a production company named MacGillivray Freeman Films from the United States with the name primary code \"M2416\" and a unique MD5 checksum \"454972ab6d41e8b17e392899421ef4d2\".\n\n"
    },
    {
        "title": "Pitch Perfect 2",
        "dict_description": "In 2015, the movie \"Pitch Perfect 2\" was released. The film is identified by the ID 2204726 and has a phonetic code of P3216. Its MD5 checksum is a9a969f6b248b2c09481b227a55e315c. The production year, title, ID, phonetic code, MD5 checksum, and kind (movie) are all part of the basic information provided for \"Pitch Perfect 2.\"\n\nThe movie information includes that the film is in English, in color, and originates from the USA. It falls under the genres of Comedy and Music.\n\nThe movie \"Pitch Perfect 2\" features Kay Cannon, a female writer. The cast information for this movie includes Kay Cannon in the role of a writer.\n\nThe movie companies data includes two entries. The first entry pertains to Universal Pictures, a distributor based in the United States with name codes U5162 for both primary and secondary names. The MD5 checksum for this entry is b5a1282a717029cc602f6757e0e02e35. The second entry also relates to Universal Pictures, this time identified as a production company. Like the distributor entry, this production company is also based in the United States and shares the same name codes and MD5 checksum as the distributor entry.\n\n"
    },
    {
        "title": "Morella",
        "dict_description": "In 2015, the movie \"Morella\" was released, identified by the ID 2129115. The phonetic code for this production is \"M64,\" and its MD5 checksum is 7b0f6c0312a88dd6415629815734d562.\n\nThe movie information includes details such as the language being English, with filming locations in Hollywood, Los Angeles, California, USA, and Oklahoma, USA. The film was released in the USA in 2015 and is categorized under genres like Drama, Fantasy, Horror, Sci-Fi, and Thriller. It is a color film produced in the USA and falls under the country category as well.\n\nIn the movie \"Morella,\" Ford Austin, identified by the name code A2351, portrayed the roles of an actor and a producer. His character in the movie was named Thomas, with the name code T52. Additionally, Ford Austin is associated with the surname code A235 and has a unique md5sum value of 2472afbce4ee19f4f00210d049eb4127. A note specifying his role as a producer is included in the cast information. In the movie \"Morella,\" Randal Malone, identified by the name code M4565, portrayed the role of an actor. The cast information for this role is available. In the movie \"Morella,\" Marc Wasserman, a male actor with the name code W2656, M6265, and W265, portrays the character Viktor, identified by the name code V236. Wasserman's MD5 checksum is 5a982d9f008383e5432fff7019688d51, while Viktor's MD5 checksum is e5f748c89dc644334cf109092db69e25. In the movie \"Morella,\" Margaret O'Brien, identified as \"I\" on IMDb, portrays the character of Mrs. Danvers. She is listed as an actress in the cast information. The unique identifiers for Margaret O'Brien include the name code \"O1656,\" the primary name code \"M6263,\" and the surname code \"O165.\" The MD5 checksum associated with Margaret O'Brien is \"44e5d341872fdd2bfab7e62ae28fe8de,\" while the character Mrs. Danvers is linked to the name code \"M6235,\" the surname code \"D5162,\" and the MD5 checksum \"26a8931ef6282d2193caac88dcea816f.\" The cast information for this entry is empty. The movie \"Morella\" features Adam Ropp, a male individual credited as a producer, writer, director, and editor. Additionally, Adam Ropp is identified by the primary code \"R135\" for his name and \"A3561\" for his name without considering case sensitivity, while his surname is represented by the code \"R1.\" Notably, Adam Ropp is associated with the role of an executive producer in the cast information section, which includes a total of four entries. In the movie \"Morella,\" the writer is Edgar Allan Poe. Poe is indexed as \"I\" on IMDb and has primary codes \"P3264\" for the name and \"E3264\" for the name without diacritics, with a surname primary code of \"P.\" The MD5 checksum for Poe is \"e641de4056b3b744115fff8f669a85cb.\" He is credited for the role of writer, specifically noted as the author of the short story. In the movie \"Morella,\" Jamie Ford, identified with the IMDb index \"I\" and a female gender, is credited as the costume designer. The cast information for this role is available.\n\nThe movie companies listed in the IMDb data are the Ford Austin Company and Morella. The Ford Austin Company, identified by the name code F6323, is a production company based in the United States. Its MD5 checksum is c3abb90b6e873cf2eb173899e01f69c4. Similarly, Morella, with the name code M64 and MD5 checksum 4f57db03ade919a2eaa7dc71a49de92a, is also a production company from the United States. Both companies are categorized under \"production companies\" in the IMDb dataset.\n\n"
    },
    {
        "title": "McNeil Island",
        "dict_description": "In 2015, the movie \"McNeil Island\" was released, with the IMDb ID 2109208. The phonetic code for this production is \"M2542,\" and its MD5 checksum is \"6412a319b9fbff88e5dc01a5590d5a8b.\"\n\nThe movie is in English and falls under the drama genre. It was released in the USA in 2015 and later in 2016. The plot revolves around a former rape crisis counselor who starts treating violent sex offenders at McNeil Island Prison in Washington State. The locations featured include Steilacoom, Puget Sound, and Tacoma in Washington, USA. The counselor, Clare Hart, aims to prevent future crimes but finds delving into the minds of rapists, sadists, and child molesters to be mentally taxing, impacting her sanity and well-being. The plot description was provided by an anonymous source.\n\nIn the movie \"McNeil Island,\" Barbara Bruno, a female producer with the name code B6516 for her full name and B6161 for her name without the surname, and the surname code B65, played the role of a producer, with a specific note indicating she was the line producer. The movie \"McNeil Island\" features Russell Gilwee, identified by the name codes G4624 and R2424, with a surname code of G4 and an MD5 checksum of 3230b3b2b785df08bace4a292a8dc817. Gilwee serves as both the producer and writer of the film. The cast information notes that Gilwee is credited as the producer and is also acknowledged for writing the screenplay. In the movie \"McNeil Island,\" Sarah Knight, identified with the IMDb index \"I\" and unique codes K5232, S6252, and K523, is credited as a producer and director. Knight's MD5 checksum is cb64eba732c71ca70d7c4093c62c2de3. The cast information includes a note specifying Knight's role as a producer. In the movie \"McNeil Island,\" Randy Gardell, identified by the name code G6346, contributed as a male costume designer. The cast information for this role is available.\n\nThe keyword information includes four entries. The first keyword is \"burnout\" with a phonetic code of B653. The second keyword is \"counselor\" with a phonetic code of C5246. The third keyword is \"island-prison\" with a phonetic code of I2453. Lastly, the fourth keyword is \"rapist\" with a phonetic code of R123.\n\nThe movie companies data includes details about a production company named Jo Films. Jo Films is based in the United States, as indicated by the country code [us]. The company is uniquely identified by the name primary code (name_pcode_nf) J1452 and the short form name primary code (name_pcode_sf) J1452. The MD5 checksum for this company's information is 64c1e217b545489fd39028a1fce46be1. This data falls under the category of production companies.\n\n"
    },
    {
        "title": "Out of Sight",
        "dict_description": "In 2015, the movie \"Out of Sight\" was released, featuring the unique phonetic code \"O3123.\" The film is identified by the MD5 checksum \"b516f77bf5ac0b704750149cb331dac5\" and is categorized as a movie.\n\nThe movie \"Out of Sight\" is an English-language documentary filmed in Bethlehem and Allentown, Pennsylvania, USA. The sound mix utilized Dolby Digital technology, with filming done using various cameras including Canon 5D, Canon XF300, and Panasonic AG-HVX200. The movie's technical information includes Digital Intermediate post-production, Digital format, and a screen aspect ratio of 1.78:1. Released in the USA in 2015 (limited), the film explores the effects of ignorance, particularly focusing on how society deals with depressed adolescents and those at risk of suicide, suggesting that these issues are often overlooked or deliberately kept hidden. The budget for the production was $50,000. \"Out of Sight\" is a color documentary belonging to the genre of Documentary, highlighting the impact of ignorance on society's treatment of vulnerable individuals.\n\nIn the movie \"Out of Sight,\" Leo Behe, identified with the name code B4 for the primary name and L1 for the name without diacritics, and surname code B, plays the role of an actor. His character in the movie is named \"Himself,\" with the name code H5241. The MD5 checksum for Leo Behe is faab9a4c12a884cebe9f7d0e4cf85761, while the checksum for his character \"Himself\" is 6d46b1d5d80d20a7780e4d353df679d2. The cast information for this role is provided within the structured data. In the movie \"Out of Sight,\" Manny Griffiths, credited as an actor, portrays the character named Himself. Manny Griffiths is identified with the IMDb index \"I\" and is male. His primary name code is G6132, and his secondary name code is M5261. The MD5 checksum associated with Manny Griffiths is 1a07e785736524baa356558c5dfd89a0. The character Himself is uniquely identified by the name code H5241 and has an MD5 checksum of 6d46b1d5d80d20a7780e4d353df679d2. The cast information for this particular role is provided within the structured data. The movie \"Out of Sight\" features Aimee Bender, credited as actress, portraying the character named Herself. Aimee Bender, identified with the IMDb index II, is a female performer with the name code B5365 for current and A5153 for former purposes, and a surname code B536. The MD5 checksum for Aimee Bender is 1179d363c0d9be86a08da9282b5d25b7, while the character Herself is associated with the name code H6241 and has a MD5 checksum of af6cabaac0e8d397e9e7bc4317398d8e. The cast information for this movie is provided within the structured data. In the movie \"Out of Sight,\" Molly Louise Hudelson, a female actress, plays the character named Herself. The cast information for this role is provided in the structured data. The movie \"Out of Sight\" features Carly Marina, a female actress. Marina's primary name code is M6526, with an alternative code of C6456, and her surname code is M65. The MD5 checksum associated with Marina is 47d54334314a345f80b11b4e52965e51. In the movie, Marina portrays a character named Herself, with a name code of H6241 and an MD5 checksum of af6cabaac0e8d397e9e7bc4317398d8e. Her role in the film is that of an actress. The cast information for this movie is provided within the structured data. The movie \"Out of Sight\" features Jessie Minor, a female actress, producer, and director. In the film, she portrays the character \"Herself.\" Additionally, she is credited as a producer in the cast information. The movie \"Out of Sight\" features actress Hanna Lee Reehl in the role of Herself. Hanna Lee Reehl is identified by the primary code R454 for her name and H5464 for her full name, while her surname is denoted by the code R4. She is listed as female and has an MD5 checksum of 308bb3ac6962e6ec4c3008e06c2fb039. The character she portrays, Herself, is represented by the name code H6241 and an MD5 checksum of af6cabaac0e8d397e9e7bc4317398d8e. The cast information for this movie is provided within the structured data. The movie \"Out of Sight\" features Karla Feldstein in the role of a producer, specifically noted as an associate producer. Karla Feldstein is uniquely identified by the primary code F4323 and the secondary code K6414, with an MD5 checksum of 9321b9ff68df02aefcfdf2954d08cc4a. The movie \"Out of Sight\" features Kyle Mahaney in various roles, including producer, cinematographer, director, and editor. Mahaney is identified by the name codes M524 and K45, with a surname code of M5. The MD5 checksum associated with Mahaney is 3c2d382283a70a62be4ba028fdf8a155. Additionally, Mahaney is noted as the producer in the cast information.\n\nThe keyword information includes five entries. The first keyword is \"depression\" with a phonetic code of D1625. The second keyword is \"mental-illness\" and its phonetic code is M5345. The third keyword is \"parenting\" with a phonetic code of P6535. The fourth keyword is \"teen-suicide\" and its phonetic code is T523. Lastly, the fifth keyword is \"treatment\" with a phonetic code of T6353.\n\nThe movie companies data includes details about a production company named Five Blade Productions from the United States, identified by the name codes F1431 and a unique MD5 checksum.\n\n"
    },
    {
        "title": "Level Seven",
        "dict_description": "In 2015, the movie \"Level Seven\" was released. The movie has the unique identifier ID 2071743 and is classified under the phonetic code L1421. Its MD5 checksum is c5f587af246f8fb4e83fc9604ad2f46b.\n\nThe movie's primary language is English. It was released in the USA on the 10th of December 2015 in Los Angeles, California. The film is presented in color. \"Action\" is the genre of this movie. The production country of the film is the USA.\n\nThe movie \"Level Seven\" features Vincent J. Francillon, a male individual credited as a producer and writer. Francillon's name is associated with the primary key \"F6524\" and the normalized key \"V5253,\" with an MD5 checksum of \"16a04ce14406ec450b5c748c97f83bfd.\" In the cast info, Francillon is noted as the producer, and additionally holds the role of writer in the movie. In the movie \"Level Seven,\" Wyn Davies, Geraint, a male individual with the name code W5312 for current and G6535 for the normalized form, is involved as a producer and director. Wyn Davies, Geraint is identified by the MD5 checksum d0ba3d9e75b029bb810a5f7de0684d83. Additionally, Wyn Davies, Geraint is credited as a co-producer in the cast information. The movie \"Level Seven\" features Hugo Cortina as the cinematographer. Hugo Cortina is identified by the name code C6352, with additional codes H2635 and C635 for his name and surname, respectively. The MD5 checksum associated with Hugo Cortina is a685c919849e106f994976f4086e66d6. The movie \"Level Seven\" features Clausen, Alf, a male composer. Clausen's name is encoded as C4254 for the name with code CF, A4124 for the name with code NF, and C425 for the surname with code. The MD5 checksum for Clausen's information is a68f78fafa34300bded9a7a3c55f4d37.\n\nThe IMDb data includes information about two movie companies. The first company, Power Point Films, is a distributor based in the United States with primary codes P6153. The second company, Level Seven Films, operates as a production company also located in the US, identified by the codes L1421. The data provides unique MD5 checksums for each company, ensuring data integrity and authenticity. Power Point Films and Level Seven Films are categorized respectively as distributors and production companies within the film industry.\n\n"
    },
    {
        "title": "Les Moutons noirs",
        "dict_description": "In 2015, the movie \"Les Moutons noirs\" was released, identified by the ID 2068506. The phonetic code for this film is \"M3525,\" and its MD5 checksum is \"9c89b5af6cf75a71560cebb596890df7.\"\n\nThe movie information includes details about the film being set in France and categorized under the genre of Drama.\n\nThe movie \"Les Moutons noirs\" features Nicolas Mauvernay as a producer. Mauvernay's primary name code is M1652, with additional codes N2425 and M165 for name and surname respectively. The MD5 checksum associated with Nicolas Mauvernay is 6eb724a07108c0858c8295bb084816ab. The specific role attributed to Mauvernay in the cast info is that of a producer, denoted by the note \"(producer)\". The movie \"Les Moutons noirs\" features Rachid Hami, a male writer and director. Rachid Hami is identified by the name code H5623 for his full name and R235 for his first name. His surname code is H5, and his unique identifier is 2d4811a475cf15dcd128f1de2b6f225e. In the cast info, Rachid Hami is credited as a writer with the note \"(writer).\" In the movie \"Les Moutons noirs,\" Guy Laurent, identified with the name code L6532, G4653, and surname code L653, contributed as a male writer. This role is specifically denoted in the cast info with the note \"(writer).\" The MD5 checksum associated with Guy Laurent is 5283007a5c8925e1744905e10de95f5f.\n\n"
    },
    {
        "title": "Ringsend",
        "dict_description": "In 2015, the movie \"Ringsend\" was released. The movie has the IMDb ID 2244662 and a phonetic code of R5253. The MD5 checksum for this movie is e68cb0888ffef87d6c6325e45f921f0a.\n\nThe movie information includes details about the country of production, which is Ireland, and the genre of the film, categorized as Action.\n\nThe movie \"Ringsend,\" categorized as a film, involves the individual Jeff Diaz, credited on IMDb as II, a male producer with the name code D21 for the name and J132 for the name without diacritics, and D2 for the surname. Jeff Diaz is associated with two roles in the movie, both as a producer. His unique identifier MD5 checksum is 094babdca80224965739606e02570c55. The cast information for \"Ringsend\" includes Jeff Diaz, noted as a development executive and a producer for the respective roles. The movie \"Ringsend,\" categorized as a film, involves the individual Brett Halliday, credited as a producer, writer, and director. Halliday is indexed as \"I\" on IMDb, with primary codes \"H4316\" and \"B6343\" for name variations and \"H43\" for the surname. The MD5 checksum for Halliday is \"ddbd04713b0b65c1d2dc6c8bbcae3907.\" In the cast information, Halliday is noted as a co-producer, writer, and attached to the project. The movie \"Ringsend\" features Lyle Howry, a male producer credited twice for the film. Howry is identified by the primary name code \"H64\" and secondary name code \"L46,\" with a surname code \"H6\" and an MD5 checksum of \"d3e12fae8a5b49eb57d627bd78e1f147.\" His roles in the movie are as an executive producer and a production executive, as noted in the cast information. The movie \"Ringsend\" features Gerry Shanahan as a male producer. Shanahan is also credited as an associate producer in the cast info. The movie \"Ringsend\" features Courtland Thomas, a male producer credited as a co-executive producer. Thomas is identified by the name codes T5263 and C6345, with a surname code of T52. The unique identifier for Thomas is 10898de7b8ae83f3c8a53a8d4ba10df4. The movie \"Ringsend\" features Marco Werba in the role of composer. The unique identifiers associated with Werba are as follows: name - Marco Werba, name primary code (cf) - W6156, name primary code (nf) - M6261, surname code - W61, and MD5 checksum - 899e025a1829798774a6dc333d7affd5. The cast information for this movie includes Werba in the composer role.\n\nThe movie companies listed in the IMDb data are Archstone Pictures and Cinematheque International Entertainment. Archstone Pictures, with the name code A6235, is a distributor based in the United States. Cinematheque International Entertainment, identified by the name code C5325, operates as a production company also located in the United States. The unique MD5 checksum for Archstone Pictures is 5c61985998bde217b4a4b16c73ac8f48, while Cinematheque International Entertainment's MD5 checksum is 9e4700859123abac90d04bb24d653c59.\n\n"
    },
    {
        "title": "Gravity",
        "dict_description": "The movie \"Gravity,\" with the IMDb ID 1927360, was produced in the year 2015. It is classified under the kind \"movie\" and has a phonetic code of \"G613.\" The MD5 checksum for this movie is \"ca51ea75a847369cf566c3d26801d5c0.\"\n\nThe movie information includes that the film is in English, was released in the USA in 2015, and is from the USA. The genres of the movie are Sci-Fi and Thriller.\n\nIn the movie \"Gravity,\" George Nolfi, identified by the name code N4126, gender male, and MD5 checksum 946768aaf3abdf4f963073683b7818d7, plays the role of a producer. This information is denoted by the note \"(producer)\" in the cast info section.\n\nThe keyword information from IMDb includes four keywords with their corresponding phonetic codes. The keywords are \"looking-for-missing-child\" with a phonetic code of L2521, \"missing-child\" with a phonetic code of M2524, \"one-word-title\" with a phonetic code of O5634, and \"parent-searching-for-missing-child\" with a phonetic code of P6532.\n\nThe movie companies involved in the production of the film include Management 360 from the United States with the name codes M5253, Mark Gordon Company, The also from the US with name codes M6263, and Universal Pictures from the US with name codes U5162. Each of these companies is categorized as production companies.\n\n"
    },
    {
        "title": "El mejor de los mundos imposibles",
        "dict_description": "In 2015, the movie \"El mejor de los mundos imposibles\" was released. The movie has the IMDb ID 1860838 and a phonetic code of M2634. The MD5 checksum for this movie is 5d99b6b022596b7c70de639ac9383636.\n\nThe movie is in Spanish and was released in Mexico in 2015. The plot revolves around Emma, who secretly decides to become a mother when she was young. After her husband's death, her son Julian embarks on a journey to uncover the truth about his origins. Julian must navigate through choices and shape his own destiny while being observed by the residents of his town, including Father Agostino, Macaria, and the ghost of his father. The story delves into themes of morality, luck, and individual courage. The film is a drama presented in color and set in Mexico.\n\nIn the movie \"El mejor de los mundos imposibles,\" Odiseo Bichir, identified by the name code B2632, portrays the character Father Manuel. Bichir, a male actor with the name code O3212 and surname code B26, is part of the cast in the film. The character Father Manuel is uniquely identified by the name code F3654 and surname code M54. The data also indicates that Bichir's gender is male, and his MD5 checksum is 8a43efdb0735be96b6add0f875aa253e, while Father Manuel's MD5 checksum is b3dac30dc06c33a726ff3bf924b16153. The role played by Odiseo Bichir in the movie is that of an actor. In the movie \"El mejor de los mundos imposibles,\" Julio Bracho, credited as III on IMDb, plays the role of an actor. His character in the movie is named Camelio el Texano. Julio Bracho is identified by the p-codes B624 and J4162 for his name and B62 for his surname. His gender is male, and his unique identifier is a181c8e1fcd873ea6d9c3d2d397e169c. The character Camelio el Texano is represented by the p-codes C5432 for the name and T25 for the surname, with a corresponding unique identifier of 9b3063ca490c3d09aa4d7bcbd151705c. The cast information for this movie is available. In the movie \"El mejor de los mundos imposibles,\" Víctor Hernández, identified with the IMDb index XI, portrays the character Julián. Hernández is a male actor, with the primary name code H6532 and the normalized name code V2365. The MD5 checksum associated with Hernández is c26fa38213185ef23ac427fb03759305, while the character Julián is uniquely identified by the MD5 checksum 66577b8702b162f113df9494cd85d788. The role played by Hernández in the movie is that of an actor. The cast information for this movie is provided as a structured data set. The movie \"El mejor de los mundos imposibles\" features Enoc Leaño in the role of an actor. In the film, he portrays the character named Sebastián Oribe. Leaño's gender is male, and his unique identifiers include the primary code \"L52\" for his name and \"E524\" for his name without diacritics, while his surname is coded as \"L.\" The MD5 checksum associated with Enoc Leaño is \"b87efb57e9313f5ade047252780d0bd4,\" and for the character Sebastián Oribe, it is \"505d11ad20fa9bd70b5661d01d42e679.\" In the movie \"El mejor de los mundos imposibles,\" Fernando Luján, identified by the name code L2516, portrayed the character Don Antonio. Luján, a male actor with the name code F6534 and surname code L25, was cast in the role of an actor. The character Don Antonio, with the name code D535 and surname code A535, was depicted by Luján. The unique identifier for Luján is 6c5191319ff5752fc62a8a7162242bc5, while the character Don Antonio is identified by the code 8ad21cafd74522b08663d24bbae65ca8. In the movie \"El mejor de los mundos imposibles,\" Protasio, identified by the name code P632 and the MD5 checksum b634e281698fc5e7aa5be96d270180a5, plays the role of an actor. His character in the movie is Marine, with the name code M65 and MD5 checksum 801a61583a73f5c3e28d34771df22617. The cast information for this movie includes Protasio as an actor portraying the character Marine. In the movie \"El mejor de los mundos imposibles,\" Mario Zaragoza, identified by the name code Z6256, portrayed the character Melitón. Zaragoza, a male actor, was assigned the role of an actor in the film. The character Melitón, with the name code M435, was embodied by Zaragoza. The MD5 checksum for Mario Zaragoza is 08842f1a886e198a4c615d137721aa47, while the MD5 checksum for the character Melitón is 000528f8fac87e61d517e3678bc0513e. The cast information for this particular role is detailed within the structured data. In the movie \"El mejor de los mundos imposibles,\" Marcela Mistral, a female actress known by the name code M2364, portrayed the character Marisol. Her name code for the character is M624. The movie \"El mejor de los mundos imposibles\" features Ana Ochoa in the role of an actress, specifically portraying the character Macaria. Ana Ochoa, identified with the name code O25 for her first name and A52 for her full name, is a female performer with the surname code O2. The unique identifier for Ana Ochoa is c63243f22e24d815ba32c44200e9853f, while the character Macaria is represented by the identifier 220529be46bf5b1712b5716f15e29842. The movie \"El mejor de los mundos imposibles\" features Yolanda Salinas in the role of an actress, specifically portraying the character San Juanita. Yolanda Salinas, identified with the name code S4524 and Y4532, is a female performer with the surname code S452. Her unique identifier is 30b2eda11a6edef3550bb71dfaa0e45f. The character San Juanita, with the name code S5253 and surname code J53, is represented by the identifier 2530ff894fc0c9a9399ddae910c613ba. The cast information for this movie is detailed within the structured data. The movie \"El mejor de los mundos imposibles\" features Susana Zabaleta in the role of an actress, portraying the character named Emma. Susana Zabaleta, identified with the name code Z1432 for her first name and S2521 for her full name, is a female performer with the surname code Z143. The character Emma is uniquely identified by the name code E5 and a specific MD5 checksum of 4535367f2f39b5a2ebaee0092f184a79. The cast information for this movie includes Susana Zabaleta as an actress playing the character Emma. The movie \"El mejor de los mundos imposibles\" features Carlos García Campillo as a producer. García Campillo's unique identifier codes are G6251 and C6426 for name_pcode_cf and name_pcode_nf, respectively. The MD5 checksum associated with García Campillo is 93412c103565b6ece2c0efb8e40b1cc6. Additionally, García Campillo's role in the movie is specifically noted as a producer. The movie \"El mejor de los mundos imposibles\" features Carlos Taibo as a male producer. Taibo's primary name code is T1264, with additional codes C6423 for the name and T1 for the surname. The MD5 checksum associated with Taibo is d474726aff181b0c5dc0f2319127d70e. In the cast info, Taibo is credited as an executive producer. The movie \"El mejor de los mundos imposibles\" features Lesslye Yin as a producer. Yin's unique identifiers include the name code \"Y5424\" for the current name and \"L245\" for the name without punctuation, with a surname code of \"Y5.\" The MD5 checksum associated with Yin is \"f90307d615e0972e0657ce675b78cab0.\" The specific role played by Yin in the movie is that of a producer, as denoted by the note \"(producer)\" in the cast information. The movie \"El mejor de los mundos imposibles\" features José Luis Solís, credited as a writer with the IMDb index II. Solís is uniquely identified by the primary codes S4242 and J2424 for name variations and S42 for the surname. The MD5 checksum associated with Solís is 8589f51cfec0c162de1d95553727cc63. In the cast info section, Solís is noted for his role as a writer, specifically for the screenplay of the movie. The movie \"El mejor de los mundos imposibles\" features David Toscana as a writer, specifically noted for his contribution as the author of the novel on which the movie is based. Toscana is uniquely identified by the p-codes T2531 for his name and T25 for his surname, with additional codes D1325 and 05f4fad6980ccc354a1e26b8f9fd2ad8 associated with his name. In the movie \"El mejor de los mundos imposibles,\" Alejandro Cantú, identified by the name codes C5342 and A4253, and surname code C53, served as the cinematographer. The cast information for this film includes details about Cantú's role as a cinematographer, with a unique MD5 checksum of 0e4173949e4ba91065e954ae8ba3b077. In the movie \"El mejor de los mundos imposibles,\" the composer Tony Hernández, credited as IMDb index III with primary codes H6532 and T5653, is involved in the cast information. The movie \"El mejor de los mundos imposibles\" features Cruz Mateo, Adolfo as the costume designer. Cruz Mateo, Adolfo is uniquely identified by the p-codes C6253 and A3412, with an MD5 checksum of 19764b16da476c3c1ad8eb9053763aab. The cast info for this movie includes the role of costume designer portrayed by Cruz Mateo, Adolfo. In the movie \"El mejor de los mundos imposibles,\" Gabriel García Campillo serves as the editor. The cast information for this film includes details about García Campillo, identified by the name code G6251 and G1642, with an MD5 checksum of 5255354ddb6bdce12e3b42168f70be13. In the movie \"El mejor de los mundos imposibles,\" José Luis Aguilar, credited with the IMDb index \"I\" and the name codes A2462 and J2424, served as the production designer. The unique surname code for Aguilar is A246, and the MD5 checksum associated with this data entry is c5fac8bafd779cb651f5f6aea639eeed.\n\nThe keyword_info data includes a list with one entry. The keyword \"based-on-novel\" is associated with a phonetic code \"B2351\".\n\nThe movie companies listed in the IMDb data are \"Fara Fara Films\" and \"Producciones El Chango.\" \"Fara Fara Films\" is based in Mexico with the country code [mx] and has the name postal codes F6161 for both the normalized form and the short form. The MD5 checksum for \"Fara Fara Films\" is 7d19b04ee94e8480bfa1980dca80f9c6. Similarly, \"Producciones El Chango\" is also located in Mexico with the country code [mx] and has the name postal codes P6325 for both the normalized form and the short form. The MD5 checksum for \"Producciones El Chango\" is c9c9cffd81f3de8206c37e96ee47f6ee. Both companies are classified as production companies according to the provided data.\n\nThe movie \"Las bicicletas\" has multiple alternate titles. In Mexico, it is known as \"Las bicicletas\" with a production year of 2011, and it is also referred to as \"Las bicicletas\" as a working title from 2009. Internationally, the movie is titled \"The Bicycles\" in English, with a production year of 2011. Each title variation is associated with a unique ID and a phonetic code. The Mexican titles have specific notes indicating their alternative and working title status, while the international English title is specified as such. The data is uniquely identified by MD5 checksums for each entry, ensuring data integrity and accuracy.\n\n"
    },
    {
        "title": "Finding Dory",
        "dict_description": "The movie titled \"Finding Dory,\" with the ID 1890816, was produced in the year 2015. It is classified under the kind \"movie\" and is uniquely identified by the phonetic code \"F5352\" and the MD5 checksum \"9bbdd785cfe2aa8650b1b7b6ed2b7237.\"\n\nThe movie information includes that the film is in English and was released in various countries on different dates: France on November 25, 2015; Mexico on November 25, 2015; USA on November 25, 2015; Peru on November 26, 2015; Iceland on November 27, 2015; and Germany on December 3, 2015. The movie is in color and originates from the USA. It falls under the genres of Adventure, Animation, Comedy, and Family.\n\nThe movie \"Finding Dory\" features Albert Brooks in the role of Marlin, portrayed as an actor. Albert Brooks is identified with the IMDb index \"I\" and is male. His primary name code is \"B6241,\" with alternative codes \"A4163\" and \"B62\" for different purposes. The MD5 checksum associated with Albert Brooks is \"d52eb977658cbe4567ab48c3e9b0756c.\" In the movie, Marlin is depicted with the name code \"M645,\" and the MD5 checksum linked to this character is \"b1e3f1b10558445963aa5bbf4d20249c.\" Additionally, Albert Brooks' portrayal of Marlin is specified with the note \"(voice).\" In the movie \"Finding Dory,\" Ellen DeGeneres, a female actress, portrays the character Dory. Her name is coded as D2562 for current and E4532 for former purposes, with an MD5 checksum of c54a8fe93d4e081697ed99ee07e4909f. Dory's character name is coded as D6 with an MD5 checksum of 9b62621932b129e5ecf20afc96ccff68. Ellen DeGeneres is credited with the role of an actress, specifically noted as providing the voice for the character Dory. The movie \"Finding Dory\" features actress Vicki Lewis in the roles of Deb and Flo. Vicki Lewis is indexed as \"I\" on IMDb and is identified by the p-codes L212 for her first name and V242 for her last name, with a surname p-code of L2. She is of female gender. The character Deb is represented by the p-code \"D1\" and has an MD5 checksum of 63d0c6ed79bf49c6ab130dcbcb0feca8, while the character Flo is represented by the p-code \"F4\" and has an MD5 checksum of 7e1e91156f7c4e1bd0831cf008ad5fdf. The cast information includes two entries. The movie \"Finding Dory\" features Lindsey Collins in the role of a producer. The cast information specifies that Lindsey Collins is credited as a producer with the note \"(producer)\". In the movie \"Finding Dory,\" Bob Roath, identified with the name code R31 for the first name and B163 for the last name, and surname code R3, is credited as a male producer. He specifically held the role of associate producer, denoted within the cast info as \"(associate producer).\" The movie \"Finding Dory\" features Andrew Stanton, credited as a writer and director. Stanton is identified with the IMDb index \"I\" and has the primary name code \"S3535\" and the secondary name code \"A5362\". The gender of Stanton is male. In the cast information, Stanton is noted for portraying characters in the movie. In the movie \"Finding Dory,\" Victoria Strouse, a female writer credited with the screenplay, played a significant role. The unique identifiers associated with Victoria Strouse include the primary code \"S3621\" for her name and \"V2362\" for her name without considering the case. Additionally, her surname is represented by the code \"S362,\" and her MD5 checksum is \"b65ad2e2a4e424ce05dd0b90dcc87fd2.\n\nThe IMDb data includes information about movie companies. The first company listed is Walt Disney Studios Motion Pictures from Singapore, identified by the codes W4325. This company is categorized as a distributor. The second company is Pixar Animation Studios from the United States, with the code P2653, known as a production company. The third company is Walt Disney Pictures, also from the United States, sharing the same code W4325 as the first company and categorized as a production company as well. Each company is uniquely identified by an MD5 checksum.\n\nThe alternate titles data includes one entry for the movie with ID 1890816. The alternate title is \"Finding Nemo 2,\" which was used as a working title in the USA during the production year 2016. The entry is identified by the ID 112091 and has a phonetic code of \"F5352.\" The MD5 checksum for this entry is \"e6870e2341ecdc18e17b7118b3397daf.\"\n\n"
    },
    {
        "title": "Epic Denied: Depriving the Forty Days of Musa Dagh",
        "dict_description": "In 2015, the movie \"Epic Denied: Depriving the Forty Days of Musa Dagh\" was released. The movie has the IMDb ID 1870702 and a phonetic code of E1235. The MD5 checksum for this movie is e7939f0b5bd8d2ba4a9210c3a7e6bc7e.\n\nThe movie \"Epic Denied: Depriving The Forty Days of Musa Dagh\" is a documentary film in English, set in Los Angeles, California, USA. It was released in the USA on 15 April 2015. The plot of the documentary revolves around the challenges faced by Hollywood in adapting Franz Werfel's novel, \"The Forty Days of Musa Dagh,\" into an epic movie. The project, initiated by producer Irving Thalberg and MGM in the 1930s and later by John Kurkjian in the 1980s, encountered significant obstacles such as foreign intervention and blackmail, ultimately preventing its completion. Noted for its tumultuous production history, the film is described as the most on-again, off-again motion picture project in Hollywood. The documentary is in color and falls under the genre of Documentary. The primary country associated with the film is the USA.\n\nThe movie \"Epic Denied: Depriving the Forty Days of Musa Dagh\" features Edwin Avaness, a male individual credited as a producer, writer, cinematographer, and director. Avaness is identified by the name code A1523 for his full name and E3515 for his first name, with a surname code of A152. His unique identifier is the MD5 hash 8cd35b16985305ea8967db5fc8428d7f. In the cast info, Avaness is noted as the producer, writer, and director, with an additional credit of being attached to the project. The movie \"Epic Denied: Depriving the Forty Days of Musa Dagh\" features Serj Minassians as a producer, writer, and director. Serj Minassians is identified by the p-codes M5252 and S6252, with an MD5 checksum of dc99640c26ae1045db14140d63c8eca7. The cast information includes Serj Minassians in the roles of producer, scriptwriter, and attached to the project. The movie titled \"Epic Denied: Depriving the Forty Days of Musa Dagh\" features David E. Rezaieh as a producer. Rezaieh is identified by the primary code \"R2313\" and secondary code \"D1362,\" with a surname code of \"R2\" and an MD5 checksum of \"cf445123afb2e12b1e8a224093e92544.\" The specific role Rezaieh plays in the movie is that of a producer, as denoted by the note \"(producer)\" in the cast info section. The movie \"Epic Denied: Depriving the Forty Days of Musa Dagh\" features Steven Thadeus as a producer, specifically noted as an associate producer. In the movie \"Epic Denied: Depriving the Forty Days of Musa Dagh,\" Edward Minasian, identified by the name code M5253, E3635, and surname code M525, plays the role of a writer. The cast information specifies that Minasian's contribution is related to the book, denoted by the note \"(book).\"\n\nThe keyword information from IMDb includes two keywords: \"based-on-book\" with a phonetic code of B2351, and \"independent-film\" with a phonetic code of I5315.\n\nThe movie companies data includes details about a production company named EOS Entertainment. The company is based in the United States and is identified by the name codes E2536 and E2536 for the primary and secondary name codes, respectively. The MD5 checksum for this entry is 3a5c2554a743405334ef2b5ef04baa9c. The type of company is specified as production companies.\n\n"
    },
    {
        "title": "In the Belly of the Whale",
        "dict_description": "The movie \"In the Belly of the Whale,\" released in 2015, is identified by the ID 1980961. Its phonetic code is \"I5314,\" and the MD5 checksum is \"e8deff28c1b39dda51aeb2bfd6366fd7.\" This production falls under the category of movies.\n\nThe movie is in English and was released in the USA in 2015. It is a Drama and Thriller film. The filming locations include Anchorage, Alaska, and New York City, New York. The copyright holder is In the Belly of the Whale Finance LLC. The movie is in color and belongs to the country of USA.\n\nThe movie \"In the Belly of the Whale\" features Brandon Sean Pearson, who is credited as an actor and writer. In the film, Pearson portrays the character Simon. The structured data also includes additional cast information entries. The movie \"In the Belly of the Whale\" features Scott Hinckley in the role of a producer. Hinckley's primary name code is H5242, with additional name and surname codes of S2352 and H524, respectively. The MD5 checksum associated with Hinckley is 14621e4ccdabfec19644e0a29fd70208. The specific note for Hinckley's role is indicated as \"(producer)\" within the cast information. The movie \"In the Belly of the Whale\" features Levi Obery, a male producer. Obery's primary name code is O1641, with additional codes L16 and O16 for different name components. The MD5 checksum for Obery is afcc0d3ab9fee167fbc58c282ac3a3f3. In the cast info, Obery is credited as a producer, indicated by the note \"(producer)\". The movie \"In the Belly of the Whale\" features Matthew Webb as a male producer. Webb is indexed as IV on IMDb and has the name code W153 for current and M31 for former names, with the surname code W1. The MD5 checksum for Webb is a86b67f3b06b6da99305ccf0f597315e. Webb's role in the movie is solely as a producer, as indicated by the note \"(producer)\" in the cast info section. The movie \"In the Belly of the Whale\" features Steven Doxey, credited with the roles of writer and director. The cast information for this film includes details about the roles played by various individuals, as indicated by the structured data provided. The movie \"In the Belly of the Whale\" features Cortland Wilson in the role of a writer. Wilson's primary name code is W4252, with additional codes C6345 and W425 for different purposes. The MD5 checksum associated with Wilson is 8ee8b4099b36c42a264b40c95d44160b. In the cast info, Wilson is credited with the note \"(story).\" The movie \"In the Belly of the Whale\" features Mattias Troelstrup in the role of a cinematographer. Troelstrup is uniquely identified by the primary code \"T6423\" and the normalized form code \"M3236\". The MD5 checksum associated with Troelstrup is \"ee69d15cf738d979186e4963c6187dc6\". The cast information for this movie includes details about Troelstrup's involvement as a cinematographer.\n\nThe movie companies data includes one entry for a production company named Ten Thirty-One Pictures Entertainment based in the United States with the name code T5363. The company's MD5 checksum is 688efd806cf458ea8756c4e23d206fd8.\n\n"
    },
    {
        "title": "It Lived in My Flat",
        "dict_description": "In 2015, a movie titled \"It Lived in My Flat\" was released. The movie has the IMDb ID 1991378 and a phonetic code of I3413. The MD5 checksum for this movie is 5b9a88ea5a1a14d3d20a12cb72cd6f0f.\n\nThe movie is set in England, UK. It has a total runtime of 100 minutes and was released in the UK in 2015. The copyright holder is Zuzana Jochman. The film is in color and belongs to the genres of Comedy, Romance, and Sci-Fi. The primary country associated with the movie is the UK.\n\nThe movie \"It Lived in My Flat\" features Rachel Warren, credited as an actress. Her IMDb index is \"II,\" and she is identified with the name code \"W6562\" for current and \"R2465\" for former purposes, with a surname code of \"W65.\" Rachel's gender is female. In the movie, she portrays a character named Sausage, linked to the name code \"S2\" and a unique identifier \"cd0d41d7c3ec86148c6257ce64327389.\" The cast information for this movie is detailed within the provided structured data. The movie \"It Lived in My Flat\" features Jochman, Zuzana as a female producer. Jochman's primary name code is J2525, with alternative name codes Z2525 and surname code J25. The MD5 checksum associated with Jochman is 939fb09fd40fc598c6770d5c141fd942. Jochman's role in the movie is solely as a producer, as indicated by the note \"(producer)\" in the cast info section. The movie \"It Lived in My Flat\" features Nick Von Schlippe, a male writer and director. Von Schlippe is credited with the screenplay.\n\nThe keyword_info data includes a list of keywords, with each keyword having a keyword value and a corresponding phonetic code. The first keyword in the list is \"alien\" with a phonetic code of \"A45\".\n\nThe movie companies data includes one entry for Cesare Pictures, a production company based in the United Kingdom with primary codes C2612 for both name variations. The company's MD5 checksum is bd265ab5990fcbd60602ffe9d304826b.\n\n"
    },
    {
        "title": "Joyland",
        "dict_description": "In 2015, the movie \"Joyland\" was released, identified by the ID 2004740. The phonetic code for this production is \"J453,\" and its MD5 checksum is \"b299ada7182769f008578f2b18f04812.\"\n\nThe movie information includes details about the film being from the USA and belonging to the genres of Horror and Thriller.\n\nIn the movie \"Joyland,\" John Norris, credited as an IMDb index \"I\" with primary name code \"N625\" and secondary name code \"J562,\" and surname code \"N62,\" is involved as a producer. This role is specifically noted as \"(producer)\" in the cast information. In the movie \"Joyland,\" Tate Taylor, a male individual with the name code T463, T346, and surname code T46, is involved in multiple roles. He serves as a producer, writer, and director for the film. Additionally, Taylor is credited with the screenplay adaptation. The cast information includes Taylor noted as the producer, involved in adaptation, credited for the screenplay as the first in order, and also listed as the director. In the movie \"Joyland,\" the writer is Stephen King, identified with the IMDb index \"I\" and the name code \"K5231\" for the surname and \"S3152\" for the full name. King's gender is male, denoted as \"m,\" and his surname code is \"K52.\" The MD5 checksum for his information is \"007c80b2a72f9a4d921fe980fe9fe655.\" King's role in the film is as a writer, with a note specifying that the source material for the movie is his novel.\n\nThe movie companies data includes details about a production company named Wyolah Films. The company is based in the United States, indicated by the country code [us]. The unique identifier for Wyolah Films is \"W4145\" for both the name and production code. The MD5 checksum for this company's information is \"740603ca0a86d06ee6bfb63d6dd7d673\". The type of company is specified as production companies.\n\n"
    },
    {
        "title": "Legacy",
        "dict_description": "In 2015, the movie \"Legacy,\" identified by the ID 2064532, was released. The phonetic code for this production is \"L2,\" and its MD5 checksum is \"f34ed58807c3d8de8d58430a6c94c54d.\"\n\nThe movie is in English and was primarily filmed in Chicago, Illinois, USA. The sound was mixed using Dolby Digital (RCA Sound System). The technical aspects include the use of CAM: Panavision Cameras and Lenses, OFM: 35 mm film, and a RAT of 2.35:1 aspect ratio. It was released in the USA in 2015. The tagline for the movie is \"The most powerful light is found within the shadows...\" The plot revolves around Lucas Caine, who wakes up in Tibet with amnesia and later discovers his involvement in a long-standing conflict among immortal beings, known as IRONWILL. The movie is in color and originates from the USA. It falls under the genres of Action and Drama.\n\nIn the movie \"Legacy,\" Jon Lee Brody, a male actor, producer, and writer, plays the character of The Mystery Man. His name is encoded as B6325 for the name and J5416 for the name without the surname, while the surname is encoded as B63. The MD5 checksum for his information is bc1260ae065b23378b5b44af43e0636f. Additionally, Jon Lee Brody is noted as a producer in the cast information. The character he portrays, The Mystery Man, is encoded as T5236 for the name without the surname and M5 for the surname, with an MD5 checksum of 83750698fa77f69127bfafa63ce88a25. In the movie \"Legacy,\" Lester Speight, identified by the name code S1234, L2362, and surname code S123, plays the roles of Terrence and The Maestro. Terrence, with the name code T652 and an MD5 checksum of 18ed147554abcaddf04399188916434c, is one of the characters portrayed by Speight. The Maestro, identified by the name code T5236, surname code M236, and an MD5 checksum of b62417ab1ecb0c78dc57fec983b74d54, is another character depicted by Speight in the film. The cast information for this movie includes details about the roles played by Speight, with two instances of him being listed as an actor. The movie \"Legacy\" features Jon Knitter in the role of a writer. The cast information for this movie includes details about Jon Knitter, identified by the primary code \"K5362\" and secondary code \"J5253,\" with a surname code \"K536\" and an MD5 checksum of \"13330074d3fce669def9f8db88d3eba6.\" The movie \"Legacy\" features Ric Waite in the role of cinematographer. Waite is identified with the gender \"m\" and has the following codes associated with his name: name_pcode_cf - W362, name_pcode_nf - R23, and surname_pcode - W3. Additionally, his MD5 checksum is 912b22d97e83e92e6189e3e5dcd8bb76. The specific note for Waite in this role is \"(director of photography).\" The movie \"Legacy\" features Greg C. Gonsky in the role of miscellaneous crew, specifically noted as the one sheet designer.\n\nThe keyword_info data includes a list with one keyword entry. The keyword is \"one-word-title\" with a corresponding phonetic code of \"O5634\".\n\nThe movie companies involved in the production of the film are Iron Will Productions from the United States with name codes I6541, Kayln Ryane Entertainment also from the US with name codes K4565, and Keepsake Productions, also based in the US, with name codes K1216. Each of these companies is categorized as production companies.\n\n"
    },
    {
        "title": "Mariah Mundi and the Tablets of Destiny",
        "dict_description": "In 2015, the movie \"Mariah Mundi and the Tablets of Destiny\" was released. The film is identified by the ID 2103279 and has a phonetic code of \"M6535\". Its MD5 checksum is \"5bed01c3d8f814f9f2134f44a92f9e7d\".\n\nThe movie information includes details about the film being from the UK and belonging to the Adventure genre.\n\nThe movie \"Mariah Mundi and the Tablets of Destiny\" features Peter Bevan III as a producer. Bevan's IMDb name code is B1513, with additional codes P3615 and B15 for different purposes. The MD5 checksum for Bevan is 44144d0a95c0bb08e6cd2a4306a49199. The specific role Bevan plays in the movie is noted as a producer. In the movie \"Mariah Mundi and the Tablets of Destiny,\" the person involved is Ibon Cormenzana, a male producer. Cormenzana's primary name code is C6525, and his secondary name code is I1526. The MD5 checksum associated with him is a8594da2e8c1dd1e9a62bc37e0692e1d. He is credited in the role of a producer, as indicated by the note \"(producer)\" in the cast info section. In the movie \"Mariah Mundi and the Tablets of Destiny,\" Ignasi Estapé, identified by the p-codes E2312 and I2523, is involved as a producer, as indicated by the note \"(producer)\" in the cast info. The surname p-code for Ignasi Estapé is E231, and the MD5 checksum associated with this person is 3955db740c82f2169534f5a094105f0d. In the movie \"Mariah Mundi and the Tablets of Destiny,\" Karl Richards, identified by the p-codes R2632 and K6462, is involved as a producer, as indicated by the note \"(producer)\" in the cast info. The MD5 checksum associated with Karl Richards is fe51d5d566b46766f416a4924303a9ab. In the movie \"Mariah Mundi and the Tablets of Destiny,\" Christian Taylor, credited as Taylor, Christian with IMDb index II, contributed as a writer, specifically for the screenplay. In the movie \"Mariah Mundi and the Tablets of Destiny,\" the writer is G.P. Taylor, a male individual with the primary name code T4621 and the name code not flipped G1346, identified by the surname code T46 and an md5sum of e8ac3006713f05498637b1f2baad1427. Taylor's role in the film is specifically noted as being the writer of the book.\n\nThe movie companies listed in the IMDb data are Arcadia Motion Pictures from Spain with the name code A6235 and Entertainment Motion Pictures (E-MOTION) from the United Kingdom with the name code E5363. Arcadia Motion Pictures and Entertainment Motion Pictures are categorized as production companies.\n\n"
    },
    {
        "title": "Palace of Tears",
        "dict_description": "In 2015, the movie \"Palace of Tears\" was released. The film is identified by the ID 2186873 and has a phonetic code of P4213. Its MD5 checksum is 9d561faaf37fd081a637ca34159ff30b.\n\nThe movie is in English and was filmed in Berlin, Germany. It was released in the USA in 2015. The film is in color and originates from Germany. It falls under the genres of Drama, Romance, and Thriller.\n\nThe movie \"Palace of Tears\" features Russell Gilwee, identified by the name codes G4624 and R2424, with a surname code of G4 and an MD5 checksum of 3230b3b2b785df08bace4a292a8dc817. Gilwee takes on the roles of producer and writer in the film. The cast information specifies that Gilwee is credited as both the producer and writer, denoted by the notes \"(producer)\" and \"(writer)\" respectively. In the movie \"Palace of Tears,\" Steffen Reuter, identified by the name code R3623, S3156, and R36, and with an md5sum of af2e22c65a6c13db5c757bba975431ab, plays the role of a producer. This information is denoted by the note \"(producer)\" in the cast info section. In the movie \"Palace of Tears,\" Christian Zipperle, identified by the name code Z1642, C6235, and surname code Z164, serves as a producer. Additionally, Zipperle takes on the role of associate producer as noted in the cast information.\n\nThe keyword information includes five entries. The first keyword is \"berlin-wall\" with a phonetic code of B6454. The second keyword is \"cold-war\" with a phonetic code of C436. The third keyword is \"east-germany\" with a phonetic code of E2326. The fourth keyword is \"stasi\" with a phonetic code of S32. Lastly, the fifth keyword is \"west-germany\" with a phonetic code of W2326.\n\nThe movie company information from IMDb includes details about a production company named Schmidtz Katze Filmkollektiv based in Germany with the primary code S2532. The company's data is uniquely identified by an MD5 checksum of 9205740565dda80623b8cba48cafc9bf. This information is categorized under production companies.\n\n"
    },
    {
        "title": "Mean Gene",
        "dict_description": "In 2015, the movie \"Mean Gene\" was released, identified by the ID 2109682. The phonetic code for this production is \"M525,\" and its MD5 checksum is \"77cba616e4d90ef0d6604397e942e666.\"\n\nThe movie is set in both the USA and Australia. It follows a man in a small rural town during a societal collapse, grappling with his inner struggles and uncertain future while confronting his past. Motivated by a newfound thirst for justice, he embarks on a perilous journey entangled with a fanatical cult engaged in the production of crystal meth and alternative fuel. Chaos erupts when the cult liberates their deranged leader from a prison convoy, prompting the protagonist, Gene, to believe that intervention is necessary to curb the violence. Subsequently captured, Gene finds himself coerced into participating in a gladiatorial/demolition derby-style arena event, where he forms an alliance with a seasoned veteran to navigate the deadly competition. The collaboration with a stranger and an elderly man emerges as Gene's sole lifeline for survival. The film spans genres of Action, Drama, and Fantasy, reflecting the intense and multifaceted nature of Gene's harrowing ordeal.\n\nIn the movie \"Mean Gene,\" Gar Rogala, identified by the name code R2426, with the surname code R24, and the MD5 checksum b8e204c9d148b489d1839ae80e34da7d, is cast as an actor. He portrays the character Gene Russet, with the name code G5623, surname code R23, and MD5 checksum 8516493ed0b61f83d55470f8dbcab534. It is noted that his involvement in the film is rumored.\n\nThe keyword_info data includes two keyword entries. The first keyword is \"independent-film\" with a phonetic code of \"I5315\". The second keyword is \"unknown\" with a phonetic code of \"U525\".\n\nThe movie companies data includes details about a production company named Brigade Pictures from the United States. The company is identified by the name code \"B6231\" for both the primary and secondary name codes. The MD5 checksum for this company's information is \"7b8f3184148fd8627b7a2d581f35fbf9\".\n\n"
    },
    {
        "title": "Mist",
        "dict_description": "In 2015, the movie \"Mist,\" identified by the ID 2122971, was released. The phonetic code for this production is \"M23,\" and its MD5 checksum is 48e26feb4d42959f0b611a438288141f.\n\nThe movie information includes a tagline stating \"Something is coming out of the mist.\" Additionally, details from the book \"Mist\" by Kathryn James, published by Hodder Children's Books in 2011 with the ISBN 13: 978 1 444 90306 5, are provided. The movie is associated with the country UK and falls under the genre of Family.\n\nIn the movie \"Mist,\" Jez Freedman, identified by the primary code F6352 and secondary code J2163, serves as a producer. Additionally, Freedman is credited with the role of story editor. In the movie \"Mist,\" John Goldschmidt, credited as an IMDb index \"I\" with primary codes G4325 and J5243, is involved as a producer. This role is specifically noted as \"(producer)\" in the cast information. In the movie \"Mist,\" Kathryn James, credited as III on IMDb, is involved as a writer, specifically noted for contributing to the screenplay based on a novel. The unique identifiers for Kathryn James are as follows: name_pcode_cf - J5236, name_pcode_nf - K3652, surname_pcode - J52, and md5sum - 228df6d91b645e5d0e62decdc5d78f07.\n\nThe keyword_info data includes a list with one keyword entry. The keyword \"based-on-novel\" is represented with a phonetic code \"B2351\".\n\nThe movie companies data includes details about a production company named Viva Films. The company is based in the country with the country code [gb]. The unique identifier for the company is \"V1452\" for both name variations. The MD5 checksum for this data is \"9b574e06dabee02050ca0e6e2a7572df\". The type of company is classified as production companies.\n\n"
    },
    {
        "title": "Neon Genesis Evangelion",
        "dict_description": "In 2015, the movie \"Neon Genesis Evangelion\" was released. The movie has the IMDb ID 2149641 and a phonetic code of N5252. Its MD5 checksum is 83acbb4b808956791243b9a96da8f718.\n\nThe movie is in English and was released in the USA in 2015. ADV Films announced the production of the live-action movie at the 2003 Cannes Film Festival and expressed interest in having the Japanese and English vocal casts make cameo appearances. The adaptation was done by Gainax for \"Shin Seiki Evangelion\" and published by VIZ Media in Tokyo, Japan in 1995. The film is in color and is set in the countries of the USA, Japan, and New Zealand. It falls under the genres of Action, Fantasy, and Sci-Fi.\n\nIn the movie \"Neon Genesis Evangelion,\" Joseph Chou, a male producer, is credited for his role as a producer. The cast info specifies that Joseph Chou's role in the movie was that of a producer, indicated by the note \"(producer).\" In the movie \"Neon Genesis Evangelion,\" Matt Greenfield, identified with the name code G6514 and M3265, is a male producer. He holds the role of producer, with a specific note indicating that he is an executive producer. In the movie \"Neon Genesis Evangelion,\" John Ledford, identified with the name code L3163 and the code J5431, is involved as a male producer. His role in the cast is specifically noted as an executive producer. In the movie \"Neon Genesis Evangelion,\" Hideaki Anno, a male writer, contributed to the film as part of the cast. Anno's name is encoded as \"A532\" for the name and \"H325\" for the name without the surname, with the surname code being \"A5.\" He is uniquely identified by the MD5 checksum \"7ea54ceb1971ac53233cf2541748eabd.\" Anno's role in the movie is specifically noted as being the writer for the original anime, denoted by the order number 0 in the cast information.\n\nThe keyword information includes four entries. The first keyword is \"based-on-anime\" with a phonetic code of \"B235\". The second keyword is \"based-on-comic\" and its phonetic code is \"B2352\". The third keyword is \"based-on-tv-series\" with a phonetic code of \"B2353\". Lastly, the fourth keyword is \"remake\" with a phonetic code of \"R52\".\n\nThe movie companies listed in the IMDb data are ADV Films and Gainax. ADV Films is a production company based in the United States with the name codes A3145 and A3145, while Gainax is a production company from Japan with the name codes G52 and G521. Each company is uniquely identified by an MD5 checksum: ADV Films with \"7610ffebbfab5d62b002c6407fb5e636\" and Gainax with \"da1535faecc25a8a05a35873f297d03c\".\n\n"
    }
]