[
    {
        "title": "Timeliner",
        "dict_description": "The structured data describes a movie titled \"Timeliner,\" identified by the ID 2437383. This film was produced in the year 2019 and is categorized under the kind \"movie.\" It has a phonetic code of \"T5456\" and an MD5 checksum of \"eca94534f3f05ec0b56089951be1b0d4.\"\n\nThe movie is an English-language film with a budget of $50,000,000. It is based on several books by Richard C. Meredith, including \"Run, come see Jerusalem,\" \"The Awakening,\" \"The sky is filled with ships,\" and \"We all died at Breakaway Station.\" The plot, noted by Robert H. Gwinn, involves a message of an impending alien invasion that threatens to annihilate all life on Earth, prompting the formation of a special paramilitary team capable of traversing parallel realities to prepare for the attack. A \"timeliner\" named Eric Mathers learns that the pan-dimensional beings known as the Krith might have a hidden agenda, leading him to question whether the war he has been fighting for fourteen years is truly for the greater good or part of the \"greatest lie.\" The film is presented in color, originates from the USA, and belongs to the Action and Sci-Fi genres.\n\nThe movie titled \"Timeliner\" is associated with Robert H. Gwinn, a male individual identified by name codes G5616 and R1632, with a surname code G5 and an MD5 checksum of 4614353df59b2ae54ce584312b399fe4. Gwinn contributed to the film in multiple capacities, specifically as a producer, writer, and director. The cast information includes notes indicating his roles as a producer and screenplay writer, with one entry lacking additional details. The movie titled \"Timeliner,\" categorized as a \"movie,\" features Joy Meredith, identified by name codes M632 and J563, with a surname code of M63 and an md5sum of f2929e60b9d6e43c058cbc58c2e2e00b, in the role of a producer. The cast information specifies her role as an \"associate producer.\" The movie titled \"Timeliner\" features Richard C. Meredith as a writer. His name is encoded with the name_pcode_cf \"M6362\" and name_pcode_nf \"R2632,\" while his surname is encoded with the surname_pcode \"M63.\" The md5sum associated with his name is \"97130c6ab0d9a5a709e54b085c4497a6.\" His role in the movie is specified as \"writer,\" with a note indicating \"(novel).\"\n\nThe structured IMDb data includes a list of keywords, each paired with a phonetic code. The keywords are: \"alternative-timeline\" with the phonetic code \"A4365\", \"based-on-novel\" with \"B2351\", \"fiction\" with \"F235\", \"krith\" with \"K63\", \"meredith\" with \"M63\", and \"timeliner\" with \"T5456\". Each keyword and its corresponding phonetic code are presented as distinct pairs, allowing for precise identification and retrieval.\n\nThe movie companies involved include Rampant Entertainment, which is based in the United States, denoted by the country code \"[us]\". This company is identified by the name_pcode_nf \"R5153\" and name_pcode_sf \"R5153\", with an md5sum of \"5ffe0ada86b78cfe3f011b4bf4b9cac6\". Rampant Entertainment serves dual roles as both a distributor and a production company.\n\n"
    },
    {
        "title": "Battle Angel",
        "dict_description": "The structured data describes a movie titled \"Battle Angel,\" identified by the ID 1715711. This film was produced in the year 2017 and is categorized under the kind \"movie.\" It has a phonetic code of \"B3452\" and an MD5 checksum of \"6655082b903dec23d64223829f578dc9.\"\n\nThe film, released in the USA in 2017, is an English-language production with a budget of $200,000,000. It is set in the 26th century, 300 years after a societal collapse due to a major war, in a technological dark age where cyborg technology is prevalent. The main character, Alita, a cyborg with an organic human brain and an artificial body, is found by Dr. Ido, who becomes her surrogate father. She is a creation from an age of despair, unable to remember her past, but destined to break the cycle of death and destruction from Tiphares. The film, based on the Japanese manga \"Gunnm,\" known in North America as \"Battle Angel Alita,\" combines the first three books of Yukito Kishiro's graphic novels. James Cameron confirmed this and expressed hopes for two more \"Battle Angel\" films if successful. The film includes approximately 1,500 visual effects shots, with the main character created using CG animation and shot in 3D with a stereo imaging system developed by James Cameron. The casting call for the female lead was mistakenly posted for \"Avatar\" in 2005. The film's technical specifications include OFM:Digital, PCS:Digital Intermediate (master format), PCS:HDCAM SR (source format), and PFM:D-Cinema, and it is presented in color. It was produced in the USA and Canada and spans the genres of Action, Adventure, Romance, Sci-Fi, and Thriller.\n\nThe movie titled \"Battle Angel\" features James Cameron, identified by the IMDb index \"I\" and gender \"m\", with name codes C5652 and J5256, and surname code C565, having an md5sum of 358997c07f7e9ec00a3f716655982a70. Cameron contributed to the film in multiple roles: as a producer, writer, and director. The cast information includes notes specifying his involvement as a producer and in the screenplay, with an additional unspecified role. The movie titled \"Battle Angel\" is categorized as a \"movie.\" Jon Landau, identified by the IMDb index \"I,\" is a male associated with this film. His name codes are \"L5325\" for name_pcode_cf, \"J5453\" for name_pcode_nf, and \"L53\" for surname_pcode, with a md5sum of \"48d5036eb7429678559dfeb5866c2cb0.\" He played the role of a producer, as noted in the cast info with the specification \"(producer).\" The movie titled \"Battle Angel\" features Laeta Kalogridis, identified by the name codes K4263 and L3242, as a writer. Kalogridis, a female, contributed to the screenplay, as noted in the cast information. Her unique identifier is the MD5 checksum e607077f1e7f2332d842864bb35d03cc. The movie titled \"Battle Angel\" features contributions from Yukito Kishiro, identified by name codes K2623 and Y2326, with a surname code of K26 and an md5sum of efd312fdde4a73d912a0d6468b2d1a48. Kishiro is credited in the roles of \"writer\" and \"writer,\" with specific notes indicating involvement with \"(characters)\" and \"(graphic novels)\" in the cast information, where the latter is noted with an order number of 0. The movie titled \"Battle Angel\" features Emma Watts, a female, who contributed as part of the miscellaneous crew. Her role is specifically noted as a \"production executive.\" Emma Watts is identified by several codes: name_pcode_cf \"W325,\" name_pcode_nf \"E532,\" and surname_pcode \"W32.\" Additionally, her unique identifier is the md5sum \"19930ca7e0fa2821144b1b536d2f62f0.\" The movie titled \"Battle Angel\" is categorized as a \"movie.\" Involved in its production is Martin Laing, identified by the IMDb index \"I,\" with a gender designation of \"m.\" His name codes are \"L5256\" for name_pcode_cf, \"M6354\" for name_pcode_nf, and \"L52\" for surname_pcode, with an md5sum of \"50e91e0e20218b9b768a4cb47ecdb7b1.\" Martin Laing's role in the movie is listed as \"production designer.\" The cast information is provided as an empty list, denoted by [{}].\n\nThe structured IMDb data includes a list of keywords, each paired with a phonetic code. The keywords are: \"26th-century\" with the phonetic code \"T2536\", \"3-dimensional\" with \"D5254\", \"based-on-comic\", \"based-on-graphic-novel\", and \"based-on-manga\" all sharing the phonetic code \"B2352\". Additionally, \"bounty-hunter\" is associated with \"B5353\", \"cgi-animation\" with \"C2535\", \"cyborg\" with \"C162\", and \"female-cyborg\" with \"F5421\". This collection of keywords and their corresponding phonetic codes provides a detailed categorization of themes and elements.\n\nThe movie involves several companies, each with specific roles and identifiers. Twentieth Century Fox Film Corporation, based in the United States, is involved as both a distributor and a production company, identified by the code T5325 and the md5sum db4d2c15bfaec32cb702f4b147c0aeef. Lightstorm Entertainment, also from the United States, serves as a production company, with the code L2323 and the md5sum c7e7b8eff6ee3e1624349c944530494e.\n\n"
    },
    {
        "title": "How to Train Your Dragon 3",
        "dict_description": "The structured data describes a movie titled \"How to Train Your Dragon 3,\" identified by the ID 1961996. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"H3656\" and an MD5 checksum of \"da0e8dcbc1b4056250cc20bdb4250f97.\"\n\nThe movie is in English and was released in the USA on 18 June 2016. It is presented in color and originates from the USA. The film belongs to the genres of Animation and Family.\n\nThe movie titled \"How to Train Your Dragon 3\" features Jay Baruchel, a male actor, who plays the character Hiccup Horrendous Haddock III. His role is specified as an actor, and his performance is noted as a voice role. The structured data includes specific codes for Jay Baruchel: name_pcode_cf is B6242, name_pcode_nf is J1624, surname_pcode is B624, and md5sum is c05abdf4e26e61b0aa290af4e1bc22a1. For the character Hiccup Horrendous Haddock III, the name_pcode_nf is H2165, surname_pcode is I, and md5sum is 87e0aa6dafcdd58dc68eb8cd11beebb2. The movie titled \"How to Train Your Dragon 3\" is categorized as a \"movie.\" Michael A. Connolly, identified by name codes C5452 and M2425, with a surname code of C54 and an md5sum of c63593dfbaaedc753db13c043ff379cd, is associated with this film. He holds the role of \"producer,\" specifically noted as a \"(co-producer).\" The movie titled \"How to Train Your Dragon 3\" is categorized as a \"movie.\" Involved in its production is Roy Lee, identified by the IMDb index \"I,\" with a gender designation of \"m.\" His name codes are \"L6\" for name_pcode_cf, \"R4\" for name_pcode_nf, and \"L\" for surname_pcode, with an md5sum of \"ba8c6c9c32155fe78d3a94d17c3fa7d6.\" Roy Lee's role in the film is listed as \"producer,\" specifically noted as \"(co-producer).\" The movie titled \"How to Train Your Dragon 3\" is categorized as a \"movie.\" Involved in this production is John Powell, identified by the IMDb index \"I,\" with a gender designation of \"m.\" His name codes are \"P425\" for name_pcode_cf, \"J514\" for name_pcode_nf, and \"P4\" for surname_pcode, with a unique md5sum of \"2a14c75e6634452e5a8cf0a088801430.\" John Powell's role in this movie is listed as \"composer.\" The cast information is provided as an empty list. The movie titled \"How to Train Your Dragon 3\" is categorized as a \"movie.\" Dean DeBlois, identified by the name codes \"D1423\" and \"D5314,\" with the surname code \"D142\" and md5sum \"bda2ab81b0550c60dfbccf36914a8c34,\" is associated with this film. He is male and serves in the role of \"director.\" The cast information is provided as an empty list.\n\nThe structured data contains a list of keywords, each paired with a phonetic code. The first keyword is \"sequel\" with the phonetic code \"S24\". The second keyword is \"third-part\" with the phonetic code \"T6316\". The third keyword is \"viking\" with the phonetic code \"V252\".\n\nThe movie companies involved include DreamWorks Animation and Mad Hatter Entertainment. DreamWorks Animation, identified by the name_pcode_nf \"D6562\" and name_pcode_sf \"D6562\", operates as a distributor in the United States, with a unique md5sum of \"c9e4cf22c86c6a0dd26008c9068bd894\". Mad Hatter Entertainment, functioning as a production company, is also based in the United States, with the name_pcode_nf \"M3653\" and name_pcode_sf \"M3653\", and holds the md5sum \"aa294694d7dd6219aa99e00f8d5b1727\".\n\n"
    },
    {
        "title": "Cranium Intel",
        "dict_description": "The structured data describes a movie titled \"Cranium Intel,\" identified by the ID 1791810. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of C6534 and an MD5 checksum of f03dedac22ee542cf20b9ffbcdd8a404.\n\nThe movie, set in the USA, features English as its language and was filmed in locations including Washington DC, St. Louis, Missouri, and Pontoon Beach, Illinois. It utilizes technical specifications such as CAM: Red Epic, OFM: Redcode RAW, and a RAT of 1.85:1. Released in the USA on 22 May 2016, specifically in St. Louis, Missouri, and in New Zealand on 24 June 2016, the film carries the tagline \"The Final Execution\" and had a budget of $2,400,000. It is an adaptation of Aeneas Middleton's \"Cranium Intel: Gateway 2020,\" published by Royal Middleton Publishing on 1 May 2012, with ISBN-13: 978-0615637594, as part of The Military Execution Saga. The plot, noted by Aeneas Middleton, involves a President wanting Micheal W. Logan dead after discovering the Gateway Arch in St. Louis is a portal to Planet >X<, with future events in 3040 AD revealing top secret Cranium Intel from 2020 AD. The film is in color and belongs to the genres of Action, Adventure, Animation, Sci-Fi, and Thriller.\n\nThe movie titled \"Cranium Intel\" features Christopher 'FreeSol' Anderson, a male actor, in the role of a Special Operations Officer. Anderson's unique identifiers include name_pcode_cf: A5362, name_pcode_nf: C6231, and md5sum: 56982f473eec9232655781a12bb2d648. The character he portrays, Special Operations Officer, is associated with name_pcode_nf: S1241, surname_pcode: O126, and md5sum: 3ef61100ca451669427f94569332ebac. The cast information is provided in a structured format. The movie \"Cranium Intel\" features Jayson Koko Bridges, a male actor, who plays two roles: Micheal W. Logan and Agent# 1. The character Micheal W. Logan is identified with the name_pcode_nf \"M2425\" and surname_pcode \"L25\", while Agent# 1 has the name_pcode_nf \"A253\". Jayson Koko Bridges is associated with the name_pcode_cf \"B6325\", name_pcode_nf \"J2521\", and surname_pcode \"B632\". The md5sum for Bridges is \"ecf8541cc0925143aa29e6837fdc7fde\", for Micheal W. Logan is \"259592c46386c4ad8a8c248d7dfd3547\", and for Agent# 1 is \"d6a0f5ce85e674a5ca2ed4cd451c2171\". The cast info section is provided but contains no additional details. The movie titled \"Cranium Intel\" features Everett Carter, identified with the IMDb index \"III,\" as an actor. Carter, a male, is associated with the name codes \"C6361\" and \"E1632,\" and his surname code is \"C636.\" His unique identifier is the md5sum \"c141189d4034b825abf52628366e77cb.\" In this film, he plays the character \"Drunk Man #1,\" which is linked to the name code \"D6525\" and has the md5sum \"bc61c9f5c97b2be6d928c0401f0657a1.\" The cast information is provided in an empty object. The movie \"Cranium Intel\" features Hardley Davidson, a male actor and composer, who plays the character President Scott Collins. His involvement in the film includes providing the voice for the character, as noted by \"(voice),\" and contributing to the original score, as indicated by \"(original score).\" Davidson's identifiers include name_pcode_cf \"D1325,\" name_pcode_nf \"H6343,\" and md5sum \"e455fc9bb4d7ea6ea2ddde5cca30c7f2.\" The character President Scott Collins is further identified by name_pcode_nf \"P6235,\" surname_pcode \"C452,\" and md5sum \"ad184f7e4467bc2462986ea04d481b25.\" The movie \"Cranium Intel\" features Alexandre Duong, a male actor, in two roles. He portrays the characters Jin Huo and Agent# 3.5. The character Jin Huo is associated with the name_pcode_nf \"J5\" and surname_pcode \"H\", with an md5sum of \"bb94ebf5cbf0faa2bf08930191e5ce9c\". The character Agent# 3.5 is linked to the name_pcode_nf \"A253\" and has an md5sum of \"5b1370f51394e09fa3540d4011a22f5d\". Alexandre Duong's personal identifiers include name_pcode_cf \"D5242\", name_pcode_nf \"A4253\", surname_pcode \"D52\", and an md5sum of \"a3f6f1180bb7c3d447cb56ad88f21456\". The cast information is presented in two entries. The movie titled \"Cranium Intel\" features Leon Fleisher, identified with the IMDb index \"II\" and gender \"m\", in the role of an actor. In this film, he portrays the character \"Red Falcon - EXTeam\". The structured data includes specific codes for Leon Fleisher, such as name_pcode_cf \"F4264\", name_pcode_nf \"L5142\", and surname_pcode \"F426\", with a unique md5sum \"432e0ec8252285d1580cf2fa95dda7e4\". The character \"Red Falcon - EXTeam\" is associated with name_pcode_nf \"R3142\", surname_pcode \"E235\", and md5sum \"bb697e19f0ad6ed3d6f619a648558e1e\". The cast information is provided in an empty object format. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Michael Fletcher, identified by the IMDb index \"XV\" and gender \"m\", plays a role as an actor. His name codes are \"F4326\" for the full name and \"M2414\" for the name without the first name. His md5sum is \"fc9394c277ea6a2cad46da8a5be09b9e\". He portrays the character Peyton Mitchell Fletcher, who is the Vice President of the United States. The character's name code without the first name is \"P3532\", and the surname code is \"S32\". The character's md5sum is \"23af5248f00aa23acad36be33819bd99\". The cast information is provided as an empty object. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, James Hargrove II, identified by the name codes H6261 and J5262 and with the md5sum a47274c11d8575fb66f46a05b2683c63, is a male actor. He plays the role of \"Agent# 2,\" which is associated with the name code A253 and the md5sum 4836354fa3dbc5f584b656c412fc4163. The cast information is provided in the structured data. The movie titled \"Cranium Intel\" features Kyjuan, a male actor, who plays the character Weazel. The structured data includes Kyjuan's name code \"K25\" and md5sum \"c70be9f8917720b3349dc53a02276247\". His role in the movie is listed as \"actor\". The character Weazel is identified with the name code \"W24\" and md5sum \"cf6f9f80d1dcdd20da87dde5ff24fea2\". The cast information is provided in an empty object. The movie \"Cranium Intel\" features David Masterson, identified by IMDb index \"II\" and gender \"m\", in dual roles. He portrays \"Adam Steinberg - Secretary of Defense\" and \"Helicopter Operator C5\". The character \"Adam Steinberg - Secretary of Defense\" is associated with the name_pcode_nf \"A3523\", surname_pcode \"D152\", and md5sum \"e17c7f6e15dcfb7df4b01ea227120aaa\". Meanwhile, \"Helicopter Operator C5\" is linked to the name_pcode_nf \"H4213\", surname_pcode \"C\", and md5sum \"b979c34411a4f7021dcc9968e40e3a7d\". Masterson's name is encoded with name_pcode_cf \"M2362\" and name_pcode_nf \"D1352\", with an md5sum of \"eae33bba5251c5f3b8bfc225245cdbaf\". The cast information includes two entries. The movie \"Cranium Intel\" features Aeneas Middleton, a male, who plays multiple roles including actor, producer, writer, director, editor, and production designer. In the film, he portrays two characters: James Whitaker, the President of the United States, and Henry Blades, the Leader of EXTeam. His involvement extends to being an executive producer, contributing to the novel and screenplay, and being attached as a director. The movie titled \"Cranium Intel\" features Todd Senofonte, identified by the name codes S5153 and T3251, with a gender designation of male and an md5sum of 9717bf5d784fa3bef0fbd36985db870d. He plays the role of an actor, portraying the character Paul Excalibur, whose name code is P4241, surname code is E2416, and md5sum is 43634991a4a0730719f764a865035c28. The cast information is provided in a structured format. The movie titled \"Cranium Intel\" features Clinton Sparks, identified by the IMDb index \"II,\" as an actor. Clinton Sparks, a male, is associated with the name codes S1624 and C4535, and his surname code is S162. His unique identifier is the MD5 sum \"67ec948e8ac55eec6fba761769de95c1.\" In this film, he plays the character Captain Harris, who is linked to the name code C1356 and surname code H62, with an MD5 sum of \"bcd2168065d27545eb3860d6d7dc2000.\" The cast information is provided in a structured format. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Adi Spektor, identified as a male actor, plays the role of Xavier Street, who is the President of the Circle District of America. Adi Spektor's name is encoded with the codes S1236 and A3212, and his unique identifier is 810ac37958a3d9f818dd4b8df45619c8. The character Xavier Street is associated with the name code X1623 and surname code A562, with a character-specific identifier of 541e93487250630e9d778c88184833c4. The cast information is provided in an empty structure. The movie titled \"Cranium Intel\" is categorized as a movie. In this film, Eric Vidal, identified with the IMDb index \"III\" and gender \"m\", plays a role as an actor. His name codes are \"V3462\" for name_pcode_cf, \"E6213\" for name_pcode_nf, and \"V34\" for surname_pcode, with a md5sum of \"eec3d622ae7e7c46a4620a6c20849ca6\". He portrays the character \"Dj# 2\", which has a name_pcode_nf of \"D2\" and a md5sum of \"5aa251d7de8aec09c3f293b120717247\". The cast information is provided as an empty object. The movie titled \"Cranium Intel\" features Nick Vidal, identified by IMDb index \"III\" and gender \"m\", with name codes \"V3452\" and \"N2134\", and surname code \"V34\", having a unique md5sum \"708d4dab7641d728293f60120a8a3fc1\". Nick Vidal plays the role of an actor, portraying the character \"Dj# 1\", which is associated with the name code \"D2\" and md5sum \"b5ee363aa2ac6ec6acda85e7efafc1c1\". The cast information is provided in a structured format. The movie titled \"Cranium Intel\" features Joanne Jeffers, identified by the name codes J1625 and J5216, with a surname code J162 and an md5sum of dc5252b6cb596c8630e1a916b963df10. Joanne Jeffers, a female actress, plays the role of \"First Lady - The Circle District of America,\" which is associated with the name code F6234, surname code A562, and md5sum 3b299575a654cfa88f3475608f2c2315. The cast information is provided in a structured format. The movie titled \"Cranium Intel\" features Romie von Klinger, a female actress, who plays the character Jennifer Lee Johansson. Romie von Klinger is identified by the name codes K4526 and R5152, with an md5sum of b8267b6bf7357c84af90819c71b17af0. Her role in the film is listed as an actress. The character Jennifer Lee Johansson is associated with the name code J5164, surname code J525, and has an md5sum of 6035f2160b859f2acb9449c4332754a6. The cast information is provided in a structured format. The movie titled \"Cranium Intel\" features Denise Moreno, identified by IMDb index \"II\" and gender \"f\", with name codes M6535 and D5256, and surname code M65, having an md5sum of cbe7841cfa9a0d799920450418fc2a06. She plays the role of an actress, portraying the character \"Neo-Machine Agent# 2.0\", which is associated with the name code N5252 and md5sum 3cbb828cd1f0b0fafdbc6af51ea7436a. The cast information is provided in an empty object. The movie titled \"Cranium Intel\" features Amy Lee Palmer, identified by the name codes P4565 and A5414, with a surname code of P456 and an md5sum of d8f7633f5226fba714a24ff4760219b3. She is a female actress who plays the character Natasha - EXTeam, which is associated with the name code N3235, surname code E235, and md5sum 6e37e0561c6b3a5a593fe711d229bfc8. The cast information is provided in a structured format. The movie titled \"Cranium Intel\" features Kevin Gundaker, identified by name_pcode_cf \"G5326\" and name_pcode_nf \"K1525\", with an md5sum of \"931cab1c6b1ae1bbcfd2cba785a3508f\", in the role of a producer. Specifically, he served as an executive producer, as noted in the cast info. The movie titled \"Cranium Intel\" features John Honoré, a male, who contributed as a cinematographer. His role is specifically noted as the \"director of photography.\" The structured data includes identifiers for John Honoré, such as name_pcode_cf \"H5625,\" name_pcode_nf \"J56,\" surname_pcode \"H56,\" and md5sum \"1e1111a559891ff3e830c73464434c83.\" The movie titled \"Cranium Intel\" features Sterling, Shae, a male, who contributed as part of the miscellaneous crew. His involvement is specifically noted as the location manager in New Zealand. Sterling's identifiers include name_pcode_cf: S3645, name_pcode_nf: S2364, and md5sum: 164c827977d3073938425563cd6766b0.\n\nThe structured IMDb data contains a list of keywords, each paired with a phonetic code. The keywords include \"3-dimensional\" with the phonetic code \"D5254\", \"3d\" with \"D\", \"assassination\" with \"A2535\", and \"assault\" with \"A243\". Additionally, \"based-on-novel\" is coded as \"B2351\", \"chase\" as \"C2\", \"commander-in-chief\" as \"C5365\", and \"concept-car\" as \"C5213\". The list continues with \"corporate-executive\" coded \"C6163\", \"dystopian\" as \"D2315\", \"electronic-music-score\" as \"E4236\", and \"energy\" as \"E562\". Further, \"engine\" is \"E525\", \"escape-attempt\" is \"E2135\", \"exploding-ship\" is \"E2143\", and \"fight-to-the-death\" is \"F23\". The keyword \"flying\" has the code \"F452\", \"gateway\" is \"G3\", \"gatling-gun\" is \"G3452\", and \"genetic-engineering\" is \"G5325\". \"Helicopter\" is coded \"H4213\", \"hologram\" as \"H4265\", \"intelligence\" as \"I5342\", and \"machine\" as \"M25\". The list also includes \"machine-gun\" with \"M2525\", \"marine\" with \"M65\", \"megacorporation\" with \"M2616\", and \"military-officer\" with \"M4361\". \"Nightclub\" is coded \"N2324\", \"outer-space\" as \"O3621\", \"power-suit\" as \"P623\", and \"robot\" as \"R13\". The keyword \"space\" has the code \"S12\", \"space-travel\" is \"S1236\", \"st.-louis\" is \"S342\", and \"suspended-animation\" is \"S2153\". Finally, \"universe\" is coded \"U5162\", \"virtual-set\" as \"V6342\", \"weapon\" as \"W15\", and \"white-house\" as \"W32\".\n\nThe movie companies involved include Burnin Rubber Music Publishing / Royal Middleton Publishing, Coldwell Banker Gundaker, and Tri-City Speedway - Illinois, all based in the United States. Each company is categorized under production companies. Burnin Rubber Music Publishing / Royal Middleton Publishing is identified by the name codes B6561 for both full and short forms, with an md5sum of 3d00a93bbccdf488344f15deb311f46f. Coldwell Banker Gundaker carries the name codes C4341 for both full and short forms, with an md5sum of 03a0a8019faa6cea6497291cbaa834d0. Tri-City Speedway - Illinois is marked by the name codes T6232 for both full and short forms, with an md5sum of 47cf62cb578943ff6296909a6319e890.\n\nThe alternate title data includes a single entry with the ID 74532, associated with the movie ID 1791810. The title is \"Cranium Intel: Gateway 2020,\" classified under kind ID 1, and was produced in the year 2016. It has a phonetic code of \"C6534\" and is noted as \"(International: English title) (alternative title).\" The entry is identified by the MD5 checksum \"daba8b916be259da498645ccfbaa1864.\"\n\n"
    },
    {
        "title": "Drug Lord",
        "dict_description": "The movie titled \"Drug Lord\" has an ID of 1847064 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of \"D6246\". The md5sum associated with this title is \"6d11efc6f0174199ae8e952f6d39542b\".\n\nThe movie is set in locations including Texas, USA, and New Mexico, USA. It is based on the Pulitzer Prize-nominated book \"Drug Lord: The Life & Death of a Mexican Kingpin - A True Story\" by Terrence E. Poppa. The plot, noted anonymously, follows a drug trafficker fleeing U.S. law who takes over crime in a Mexican border town, transforming it into a battleground of terror, treachery, and vengeance as he fights rivals to retain control. The film is produced in the USA and falls under the genres of Crime, Drama, and Thriller.\n\nThe movie titled \"Drug Lord,\" categorized as a \"movie,\" features Michael Gianfriddo, identified by name codes \"G5163\" and \"M2425\" with an md5sum of \"e0373ccae36262989993faa53f4cffb5,\" in the role of a producer. His specific contribution is noted as \"(executive producer).\" The movie titled \"Drug Lord\" is categorized as a \"movie.\" Involved in its production is Diana Kemp, identified by the IMDb index \"I,\" with a gender designation of \"f.\" Her name codes are \"K5135\" for name_pcode_cf, \"D5251\" for name_pcode_nf, and \"K51\" for surname_pcode, with a unique md5sum of \"59471296ea45a9dbb4022d1c6b8cc0a9.\" Diana Kemp's role in the film is as a producer, specifically noted as an \"executive producer.\" The movie titled \"Drug Lord\" is categorized as a \"movie.\" Mina Zavoda, identified by name codes \"Z135\" and \"M5213\" with a surname code \"Z13\" and an MD5 checksum of \"e4be78ea23d934b0f81835bb4d2d4695,\" is associated with this film. Zavoda holds the roles of \"producer\" and \"writer,\" with a specific note indicating her role as \"(producer).\" The movie titled \"Drug Lord\" features Terrence E. Poppa, identified by name codes P1365 and T6521, with a surname code of P1 and an md5sum of 9246854f35df3b0908b9c27c376ba5e4, as a contributor in the role of writer. The cast information includes a note specifying \"(book)\".\n\nThe structured data contains a single keyword entry. The keyword is \"based-on-book\" with an associated phonetic code of \"B2351\".\n\nThe movie companies involved include Dominant Entertainment, which operates in the United States, identified by the name codes D5353 for both full and short forms, and has an md5sum of d79dc230b1752e43c87fd6536c49be69. This company serves dual roles as both a distributor and a production company.\n\n"
    },
    {
        "title": "Guns, Hookers & a Pound of Coke",
        "dict_description": "The structured data describes a movie titled \"Guns, Hookers & a Pound of Coke,\" identified by the ID 1931339. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"G5262\" and an MD5 checksum of \"48c7d6c0b4f4b70a45b1557e28b307e1.\"\n\nThe movie was released in the USA in 2016. It is associated with the country USA. The film belongs to the genres of Action, Adventure, and Crime.\n\nThe movie titled \"Guns, Hookers & a Pound of Coke\" features Ford Austin, a male actor, producer, and writer, who plays the character Steve. Austin's identifiers include name_pcode_cf: A2351, name_pcode_nf: F6323, surname_pcode: A235, and md5sum: 2472afbce4ee19f4f00210d049eb4127. His role in the film is multifaceted, encompassing acting, producing (noted as \"producer\"), and contributing to the story (noted as \"story\"). The character Steve is identified by name_pcode_nf: S31 and md5sum: 81b8a1b77068d06e1c8190825253066f. The movie titled \"Guns, Hookers & a Pound of Coke\" features Marc Wasserman, identified by the name codes W2656 and M6265, with a surname code W265 and an md5sum of 5a982d9f008383e5432fff7019688d51. Marc Wasserman, a male, contributes to the film in dual roles as both an actor and a producer. In his acting capacity, he portrays the character Johnny, associated with the name code J5 and an md5sum of d0f59baadadd3349e4a9b2674bcceae8. Additionally, he holds the position of executive producer, as noted in the cast information. The movie titled \"Guns, Hookers & a Pound of Coke\" is categorized as a movie. Involved in its production is Dave Cohen, identified with the IMDb index \"VI\" and gender \"m\". His name codes are \"C531\" for name_pcode_cf, \"D125\" for name_pcode_nf, and \"C5\" for surname_pcode, with a md5sum of \"44a31ad4aed6ed008b769ed222f0ee0e\". Dave Cohen's role in this project is listed as a producer, specifically noted as an \"Executive producer\". The movie titled \"Guns, Hookers & a Pound of Coke\" is categorized as a movie. A person associated with this film is Brad Paulson, identified as male, with the name codes P4251 and B6314, and surname code P425. His unique identifier is the md5sum 9d1d06dfaabe127810bb309d76cdb60b. Brad Paulson contributed to the film in the role of a writer. The cast information is currently unspecified.\n\nThe structured IMDb data includes a list of keywords, each paired with a phonetic code. The keywords are: \"ampersand-in-title\" with phonetic code \"A5162\", \"based-on-true-story\" with phonetic code \"B2353\", \"blow-job\" with phonetic code \"B421\", \"cocaine\" with phonetic code \"C25\", \"comma-in-title\" with phonetic code \"C534\", \"goon\" with phonetic code \"G5\", \"gun\" also with phonetic code \"G5\", \"prostitute\" with phonetic code \"P623\", and \"punctuation-in-title\" with phonetic code \"P5235\". Each keyword and its corresponding phonetic code are presented exactly as provided in the data.\n\nThe movie companies involved include UBFilm.com, a distributor based in the United States, identified by the codes U1452 and the md5sum 5a6e65db492c2a11264d081a76ec9162. The production companies are Angry Baby Monkey Pictures, Ford Austin Company, and Res Ipsa Productions (II), all located in the United States. Angry Baby Monkey Pictures is identified by the code A5261 and the md5sum 5b45731ac507759360698b016e9ef3b6. Ford Austin Company has the code F6323 and the md5sum c3abb90b6e873cf2eb173899e01f69c4. Res Ipsa Productions (II) shares the code R2121 with Res Ipsa Productions, but they have different md5sums: 0ab03b28e1d69c9557ba7753a388a078 for Res Ipsa Productions (II) and e106f159a8789bebe45a4a10fbe3e594 for Res Ipsa Productions.\n\n"
    },
    {
        "title": "The Tribe",
        "dict_description": "The structured data describes a movie titled \"The Tribe,\" identified by the ID 2421394. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"T61\" and an MD5 checksum of \"6f07a34c143c4f46750b363854dc5a1a.\"\n\nThe movie is associated with the country \"USA\" and falls under the genre \"Drama.\"\n\nThe movie titled \"The Tribe\" is categorized as a movie. Jason Durdon, identified by the name codes D6352 and J2536, with a surname code of D635 and an md5sum of 959c59a5b9c11657a88537987e5cb791, is associated with this film. He is male and served in the role of a producer. The cast information includes a note specifying his role as \"(producer).\" The movie titled \"The Tribe\" features James Duval, identified by the IMDb index \"II,\" as a male producer. His name codes are D1425 for name_pcode_cf, J5231 for name_pcode_nf, and D14 for surname_pcode, with a md5sum of 338c3d8f6152895b09465f8c95251631. In his role as a producer, he is specifically noted as an executive producer. The movie titled \"The Tribe\" features Toby Joynt, identified by name codes J531 and T1253, with a surname code J53 and an md5sum of bd4d4db001c4d79dd9cc6357c372b5c4, in the role of a producer. Notably, Toby Joynt is credited as a development executive. The movie titled \"The Tribe\" features Danny Torres, identified with the IMDb index \"II\" and name codes \"T6235\" and \"D5362,\" with a surname code \"T62\" and an MD5 checksum of \"cda8dfd610bc07fea8bdcbbb793e8820,\" in the role of a producer. The cast information includes a note specifying \"(producer).\" The movie titled \"The Tribe\" features Michael James Canales, identified by name_pcode_cf \"C5425\", name_pcode_nf \"M2425\", and surname_pcode \"C542\", with an md5sum of \"2b58b20b587477bbdddf931c2fa3b727\", in the role of a writer. The cast info is provided as an empty list.\n\nThe structured data contains a list of keywords, each paired with a phonetic code. The first keyword is \"africa\" with the phonetic code \"A162.\" Following this, the keyword \"escape\" is associated with the phonetic code \"E21.\" Next, \"redemption\" is linked to the phonetic code \"R3513.\" The keyword \"return\" corresponds to the phonetic code \"R365.\" Lastly, \"slavery\" is matched with the phonetic code \"S416.\" Each keyword and its respective phonetic code are presented in a precise and structured manner.\n\nThe movie companies involved include Continuum Motion Pictures, which is based in the United States, denoted by the country code \"[us]\". This company is identified by the name_pcode_nf \"C5353\" and name_pcode_sf \"C5353\", with an md5sum of \"508c08b575867268d690cf5b5eeec4d4\". It serves dual roles as both a distributor and a production company.\n\n"
    },
    {
        "title": "Zero Tolerance",
        "dict_description": "The structured data describes a movie titled \"Zero Tolerance,\" identified by the ID 2518849. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"Z6346\" and an MD5 checksum of \"e839d5615b662a0343dc6a7f2c5381cb.\"\n\nThe movie is a documentary, family, and reality-TV film produced in both the UK and USA, with a budget of $50,000. It was released on June 4, 2016, in both the UK and USA. The film is in English and was shot in locations including Kendal, Cumbria, England, UK, and New York, USA. It is presented in color. The taglines for the movie are \"Stamp out bullying in schools\" and \"Let down by the administration.\"\n\nThe movie titled \"Zero Tolerance\" features Rick McLeod, a male, who contributed as a producer, writer, and director. His involvement as a producer is specifically noted as a co-producer. The structured data identifies him with the name codes M2436 and R2524, and a surname code M243, with an md5sum of 265f7c66c6d8964f6c4f2af1195c277d. The movie titled \"Zero Tolerance\" is categorized as a \"movie.\" A person associated with this film is Charlotte Elizabeth Mcleod, identified by the name code \"M2432\" and name pcode \"C6434,\" with a surname pcode of \"M243\" and an md5sum of \"9e6ef381567480e97985736d53ad1c40.\" She is female and contributed to the film in the role of a writer. The cast information is provided as an empty list.\n\nThe structured IMDb data includes a list of keywords, each paired with a phonetic code. The keywords are: \"anti-bullying\" with phonetic code \"A5314\", \"anxiety\" with \"A523\", \"blind-eye\" with \"B453\", \"bullying\" with \"B452\", \"children\" with \"C4365\", \"cumbria\" with \"C516\", \"denial\" with \"D54\", \"educational\" with \"E3235\", \"high-school\" with \"H24\", \"hospitalization\" with \"H2134\", \"lake-district\" with \"L2323\", \"name-calling\" with \"N5245\", \"physical-abuse\" with \"P2412\", \"primary-school\" with \"P6562\", \"schools\" with \"S242\", \"social-exclusion\" with \"S2424\", \"suicide\" with \"S23\", \"verbal-abuse\" with \"V6141\", \"victim\" with \"V235\", and \"zero-tolerance\" with \"Z6346\". Each keyword and its corresponding phonetic code are presented in a precise manner, allowing for exact recovery of the original data tuples.\n\nThe movie company involved is Celtic Storm Films, identified as a production company. It is associated with the country code [gb]. The company has a name_pcode_nf of C4323 and a name_pcode_sf also listed as C4323. Additionally, the md5sum for this company is 043d991813613c8070f1c0b7d81bcab3.\n\n"
    },
    {
        "title": "Army of Darkness 2",
        "dict_description": "The structured data describes a movie titled \"Army of Darkness 2,\" identified by the ID 1695344. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of A6513 and an md5sum of 0a472caa7dc87b0fdb34c933403ae256.\n\nThe movie, released in the USA in 2016, is in English and was produced in the USA. It is presented in color. The film spans multiple genres, including Action, Comedy, Fantasy, and Horror.\n\nThe movie titled \"Army of Darkness 2\" is categorized as a \"movie.\" Involved in this production is Robert G. Tapert, a male, identified by the name codes T1636 and R1632, with a surname code of T163 and an md5sum of 0b14b1bc225f384df6352decc79180c9. He serves in the role of a producer, as noted in the cast information with the specific note \"(producer).\" The movie titled \"Army of Darkness 2\" is categorized as a \"movie.\" A person associated with this film is Ivan Raimi, identified as male. His name codes are as follows: name_pcode_cf is \"R515,\" name_pcode_nf is \"I1565,\" and surname_pcode is \"R5.\" Additionally, his md5sum is \"ce1df3883ae10e91757d08ba72e66635.\" Ivan Raimi's role in this movie is listed as \"writer.\" The cast information is provided as an empty list. The movie titled \"Army of Darkness 2\" is categorized as a \"movie.\" Sam Raimi, identified as male, is associated with this film in the role of a writer. His name is encoded with the following codes: name_pcode_cf is \"R525,\" name_pcode_nf is \"S565,\" and surname_pcode is \"R5.\" Additionally, his md5sum is \"23827fa32293fc839cba8ceaad34d69b.\" The cast information is provided as an empty list.\n\nThe structured IMDb data includes three keywords, each with an associated phonetic code. The first keyword is \"book-of-the-dead\" with the phonetic code \"B213.\" The second keyword is \"necronomicon,\" which has the phonetic code \"N2652.\" The third keyword is \"sequel,\" paired with the phonetic code \"S24.\"\n\nThe movie company involved is Ghost House Pictures, identified as a production company. It is based in the United States, denoted by the country code \"[us]\". The company has a name_pcode_nf of \"G2321\" and a name_pcode_sf also listed as \"G2321\". Additionally, it is associated with the md5sum \"0206c595be978fbadda4a391038ca98e\".\n\n"
    },
    {
        "title": "Angry Birds",
        "dict_description": "The structured data describes a movie titled \"Angry Birds,\" identified by the ID 1688430. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of A5261 and an MD5 checksum of 89e216aecd8b163b30fb02db5c656699.\n\nThe movie was released in the USA in 2016, as indicated by the release dates information. It is associated with the country USA, according to the countries data. The film falls under the Animation genre, as specified in the genres category.\n\nThe movie titled \"Angry Birds\" features John Cohen, identified by IMDb index \"VI\" and name codes \"C525\" and \"J525,\" with a surname code \"C5\" and an MD5 checksum of \"4cea62823e73da1c33af3f49a1f1f437,\" in the role of a producer. The cast information includes a note specifying \"(producer).\" The movie titled \"Angry Birds\" features David Maisel, identified by name codes M2431 and D1352, with a surname code of M24 and an md5sum of 6d7bc9f23028a12298c3eb1d51e72f7e, in the role of a producer. His specific contribution is noted as a consulting producer.\n\nThe keyword information includes a single entry with the keyword \"based-on-video-game\" and its associated phonetic code \"B2351\".\n\nThe movie company involved is Rovio Mobile, categorized under production companies. It is associated with the country code [us]. The company is identified by the name_pcode_nf \"R1514\" and name_pcode_sf \"R1514\". Additionally, it has an md5sum of \"f18786e4a09ae610edb03775b347b39f\".\n\n"
    },
    {
        "title": "Ocean Planet 3D",
        "dict_description": "The structured data describes a movie titled \"Ocean Planet 3D,\" identified by the ID 2168207. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"O2514\" and an MD5 checksum of \"5bb5158fac1659ef6451d8c8de1ea9c0.\"\n\nThe movie is a documentary produced in the USA, with English as its language. It was released in the USA in February 2016. The film is presented in color.\n\nThe movie titled \"Ocean Planet 3D\" is categorized as a movie. Greg MacGillivray, identified by the name codes M2416 and G6252, with a gender of male and an md5sum of cb17bf51797f9c0247ab671fe132db08, is associated with this film. He fulfills the roles of both producer and director. The cast information includes a note specifying his role as a producer.\n\nThe structured IMDb data includes three keywords, each with an associated phonetic code. The first keyword is \"marine-life\" with the phonetic code \"M6541.\" The second keyword is \"number-in-title,\" which has the phonetic code \"N5165.\" Lastly, the keyword \"ocean\" is paired with the phonetic code \"O25.\"\n\nThe movie company involved is MacGillivray Freeman Films, identified as a production company. It is associated with the country code [us]. The company has a name_pcode_nf of M2416 and a name_pcode_sf also listed as M2416. The md5sum for this entry is 454972ab6d41e8b17e392899421ef4d2.\n\n"
    },
    {
        "title": "Bond 24",
        "dict_description": "The structured data describes a movie titled \"Bond 24,\" identified by the ID 1739896. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"B53\" and an MD5 checksum of \"0c6bcf5efe85a4ac53af6f0a137fe2bd.\"\n\nThe film, released in the UK in 2016, is an English-language production from the USA and UK, presented in color. It is the 24th James Bond movie in the EON Productions official series and the 26th theatrically released Bond film overall, or the 27th if including the TV episode tele-movie \"Climax!\" (1954). Pre-production began during the making and release of \"Skyfall\" (2012), similar to the pre-production of \"Quantum of Solace\" (2008) before \"Casino Royale\" (2006) started filming. This film marks Daniel Craig's fourth appearance as James Bond, with a contract for a fifth in \"Bond 25.\" Director Sam Mendes considered directing if \"Skyfall\" was successful, potentially involving Kevin Spacey, who was previously considered for \"Skyfall.\" Financing and distribution arrangements for this film and \"Bond 25\" suggest a two-year cycle. If using an original Ian Fleming title, only four remain: \"The Property of a Lady,\" \"The Hildebrand Rarity,\" \"Risico,\" and \"007 in New York.\" A top-secret story outline exists, known only to select personnel. John Logan writes the script solo, his second Bond screenplay after \"Skyfall.\" This is the first Bond film in 15 years without Purvis and Wade, who wrote since \"The World Is Not Enough\" (1999). In October 2012, it was reported that pre-production was underway, with filming planned for October 2013 and a release in Autumn 2014. \"Bond 24\" and \"Bond 25\" are designed with a multi-film arc, the second time in the series for direct sequels, following \"Casino Royale\" and \"Quantum of Solace.\" Christopher Nolan is considered for directing, with associate producer Gregg Wilson expressing interest. The film is not based on any original Ian Fleming story. It belongs to the genres of Action, Adventure, Crime, and Thriller.\n\nThe movie titled \"Bond 24\" is categorized as a movie. Daniel Craig, identified by the IMDb index \"I\" and gender \"m\", is associated with this film. His name codes are \"C6235\" for name_pcode_cf, \"D5426\" for name_pcode_nf, and \"C62\" for surname_pcode, with an md5sum of \"aa133dc4527d708ba4e80b7544247991\". He plays the role of an actor, portraying the character James Bond. The character's name codes are \"J5215\" for name_pcode_nf and \"B53\" for surname_pcode, with an md5sum of \"0a363424ef5ceaa17d33dfe4c545d7f3\". The cast information is provided as an empty object. The movie titled \"Bond 24\" is categorized as a \"movie.\" Ralph Fiennes, identified by the name codes \"F5264\" and \"R4152\" and the surname code \"F52,\" with a gender designation of \"m\" and an md5sum of \"6cd3da1a9bb3583036d5934df2afdacc,\" is associated with this film. He is listed in the role of \"actor.\" The cast information includes a note indicating his involvement is \"(rumored).\" The movie titled \"Bond 24\" features Ben Whishaw, identified by the name codes W215 and B52, with a surname code W2 and an md5sum of 43eab36a849adf155f6646d62753001f. He is male and plays the role of an actor. In this film, he portrays the character \"Q,\" which is associated with the name code Q and an md5sum of f09564c9ca56850d4cd6b3319e541aee. The cast information is provided in a structured format. The movie titled \"Bond 24\" is categorized as a \"movie.\" In this film, Naomie Harris, identified by the name codes H625, N562, and H62, and with the md5sum ef91fb2bb8e955265762f6c75c2e075e, is associated with the role of an \"actress.\" Her involvement is noted as \"(rumored).\" Naomie Harris is female. The movie titled \"Bond 24\" is categorized as a \"movie.\" Barbara Broccoli, identified by the name codes \"B6241\" and \"B6161\" and the surname code \"B624,\" with an MD5 checksum of \"3e1e7082bcbf76944b2c672a7ae809ba,\" is involved in this project. She is a female, and her role in the movie is listed as \"producer,\" with a specific note indicating her role as \"(producer).\" The movie titled \"Bond 24\" is categorized as a \"movie.\" Michael G. Wilson, identified by the IMDb index \"I,\" is associated with this film. He is male, with name codes \"W4252\" for name_pcode_cf, \"M2424\" for name_pcode_nf, and \"W425\" for surname_pcode, and has an md5sum of \"fc7ddd0767851b5da46f826b74f6be77.\" His role in the movie is listed as \"producer,\" with a specific note indicating \"(producer).\" The movie titled \"Bond 24\" is categorized as a \"movie.\" Ian Fleming, identified by the IMDb index \"I,\" is associated with this film. He is male, with name codes \"F4525\" for name_pcode_cf, \"I5145\" for name_pcode_nf, and \"F452\" for surname_pcode, and has an md5sum of \"03c7dbc28441921df9a8133d5601226b.\" Ian Fleming's role in the movie is as a writer, specifically noted for \"(characters).\" The movie titled \"Bond 24\" is categorized as a \"movie.\" A person associated with this film is John Logan, whose IMDb index is \"I.\" He is male, with name codes \"L2525\" for name_pcode_cf, \"J5425\" for name_pcode_nf, and \"L25\" for surname_pcode. His md5sum is \"c6d21173e6ab9956994aa9d2803b27a3.\" John Logan's role in this project is listed as \"writer.\" The cast information is currently empty, represented by an empty list within the cast info. The movie titled \"Bond 24,\" categorized as a \"movie,\" features Dennis Gassner, identified by the name codes \"G2563\" and \"D5256,\" with a surname code \"G256\" and an MD5 checksum of \"217f62ea9cd4af2d00f548cb804ad82e.\" Dennis Gassner, a male, is credited in the role of \"production designer.\" The cast information is provided as an empty list.\n\nThe structured data contains a list of keywords related to a film, each paired with a phonetic code. The first keyword is \"espionage\" with the phonetic code \"E2152.\" The second keyword is \"sequel,\" which has the phonetic code \"S24.\" The third keyword is \"spy,\" associated with the phonetic code \"S1.\" Lastly, the keyword \"twentyfourth-part\" is linked to the phonetic code \"T5316.\"\n\nThe movie companies involved include Columbia Pictures, a distributor from the United States, identified by name_pcode_nf and name_pcode_sf as C4512, with an md5sum of 0ae6b3ab019a394c60eb882512381777. Sony Pictures Entertainment, also a distributor, is based in Japan, with both name_pcode_nf and name_pcode_sf as S5123, and an md5sum of 7d9b1abbcb1cf3c176a5bc56192ed85c. Another distributor, Sony Pictures, operates from the United States, sharing the same name_pcode_nf and name_pcode_sf, S5123, and has an md5sum of fa4da6f5b63ee91662114f52d566c848. Eon Productions, a production company from Great Britain, is identified by name_pcode_nf and name_pcode_sf as E5163, with an md5sum of 116a7ccfd5bafafe5bebf8b5edbf644a.\n\n"
    },
    {
        "title": "Star Trek 3",
        "dict_description": "The structured data describes a movie titled \"Star Trek 3,\" identified by the ID 2310404. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"S3636\" and an MD5 checksum of \"2ff89620c4d8ac97eb77619fceff7c83.\"\n\nThe movie is in English and was released in the USA in 2016. It is presented in color and originates from the USA. The film belongs to the genres of Action, Adventure, and Sci-Fi.\n\nThe movie titled \"Star Trek 3\" is categorized as a \"movie.\" A person involved in this project is Abrams, J.J., identified as male, with name codes \"A1652\" and \"J2165,\" and an MD5 checksum of \"8bc4ab5c3254a3a09aa2e2cfb0b6839f.\" Abrams, J.J. served in the role of \"producer,\" with a specific note indicating \"(producer).\" The movie titled \"Star Trek 3\" features Gene Roddenberry, a male, who contributed as a writer. His involvement is specifically noted for the characters. Roddenberry's identifiers include name_pcode_cf: \"R3516\", name_pcode_nf: \"G5635\", and md5sum: \"8684291864e804b0db0add8356769a3a\".\n\nThe structured data contains a list of keywords related to a film or series. The keywords include \"based-on-cult-tv-series\" with the phonetic code \"B2352\", \"based-on-tv-series\" and \"based-on-tv-show\" both sharing the phonetic code \"B2353\". Additionally, the keyword \"sequel\" is associated with the phonetic code \"S24\", while \"sequel-to-a-reboot\" has the phonetic code \"S2436\". The keyword \"star-trek\" is linked to the phonetic code \"S3636\". Furthermore, \"third-part\" corresponds to the phonetic code \"T6316\", and \"thirteenth-part\" is matched with the phonetic code \"T6353\". Each keyword and its respective phonetic code are presented in a structured format, allowing for precise identification and categorization.\n\nThe movie company involved is Paramount Pictures, identified by the name_pcode_nf \"P6531\" and name_pcode_sf \"P6531\", with a country code of \"[us]\". It is categorized under \"production companies\" and has an associated md5sum of \"366857dfcb81be550d76b5ac30b38935\".\n\n"
    },
    {
        "title": "Hurricane Kid",
        "dict_description": "The movie titled \"Hurricane Kid\" has an ID of 1964522 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of \"H6252\". The md5sum associated with this title is \"d4cf2e56957108c21731f84573e2f5c0\".\n\nThe movie, released in the USA in 2016, is titled \"Be Somebody!\" and is an action film produced in the USA. It is presented in English and runs for 96 minutes. The film is shot in color and has a technical aspect ratio of 1.85:1. With a budget of $15,000,000, the plot centers on Todd Lawrence, a former Mixed Martial Arts star whose glory days are behind him. His estranged and adopted son brings him back to the ring as a trainer, offering Todd a final opportunity for glory and redemption.\n\nThe movie \"Hurricane Kid\" features Jon Lee Brody, identified by the name codes B6325 and J5416, with a surname code B63 and an md5sum of bc1260ae065b23378b5b44af43e0636f. Brody, a male, contributes to the film in multiple capacities: as an actor, producer, and writer. In the movie, he portrays the character Charlie Gold, whose name code is C6424, surname code is G43, and md5sum is 47cf53c4f74394af1f0df684abb4d09e. The cast information includes notes indicating Brody's roles as a producer and for the story. The movie titled \"Hurricane Kid\" features Shad Gaspard, a male actor, in a role. In this film, he is rumored to portray the character Mike 'The Mangler' Miller. The cast information includes a note indicating that this casting is \"(rumored).\" The movie titled \"Hurricane Kid\" is categorized as a movie. Stephen Kramer Glickman, identified by the name codes G4252 and S3152, with a surname code G425 and an md5sum of 02555df3fd0e6cdb2112fc1da35b74dc, is associated with this film. He is male and takes on the role of an actor. In the movie, he is rumored to portray the character named Eddie, which is coded as E3 with an md5sum of e5f6c83e6e97c74fc9e9760fc8972aed. The cast information includes a note indicating this role is \"(rumored).\" The movie titled \"Hurricane Kid\" is categorized as a movie. Gonzalo Menendez, identified as male with name codes M5325 and G5245, and surname code M532, with an md5sum of 56f1799b58ac062a05624e39fc596caf, is associated with this film. He is listed in the role of an actor. In the movie, he is rumored to portray the character Danny Wright, who has name code D5623 and surname code W623, with an md5sum of da8d7438b6ea26b69c2908c2f0d141a0. The cast information includes a note indicating this role is \"(rumored).\" The movie titled \"Hurricane Kid\" is categorized as a \"movie.\" John Edward Betancourt, identified by name_pcode_cf \"B3526\" and name_pcode_nf \"J5363,\" with an md5sum of \"bbb8e3d3f434b4a155d433d4fb6e498a,\" contributed to this film in the role of a writer. His specific contribution is noted as \"(screenplay).\"\n\nThe structured data contains a keyword entry with the keyword \"mixed-martial-arts\" and its associated phonetic code \"M2356\".\n\nThe movie companies involved include Aquarius Entertainment and Iron Will Productions, both based in the United States. Aquarius Entertainment, identified by the name codes A2625 for both full and short forms, has an md5sum of 90053d1b804ef153b8c9e7d178d3f29c and is categorized under production companies. Similarly, Iron Will Productions, with name codes I6541 for both full and short forms, has an md5sum of 2f1acd392a226d111574003dd6355e83 and is also listed as a production company.\n\n"
    },
    {
        "title": "Dawgtown",
        "dict_description": "The movie titled \"Dawgtown\" has an ID of 1808171 and was produced in the year 2016. It is categorized under the kind \"movie\" and has a phonetic code of \"D235.\" The MD5 checksum associated with this title is \"77601b4227bd2010e46d3d2fdad3b8c6.\"\n\nThe movie, released in the USA in 2016, is an animated film produced in the USA. It is presented in English and runs for 70 minutes. The film is available in color and features a 16:9 HD aspect ratio. It carries the taglines \"To be free, they must fight.\", \"Throwdown! Showdown! Money down! Dawgtown!\", and \"Break the Chains.\"\n\nThe movie titled \"Dawgtown\" is categorized as a \"movie.\" Bruce Bullock, identified by name codes \"B4216\" and \"B6214,\" with a surname code \"B42\" and an MD5 checksum of \"4fd027f5c8f0a350e2237bf0c05f2f67,\" is associated with this film. He holds the role of \"producer,\" as noted in the cast information with the annotation \"(producer).\" The movie titled \"Dawgtown\" is associated with Justin Murphy, identified by the IMDb index \"IV\" and gender \"m\". His name codes are \"M6123\" for name_pcode_cf, \"J2356\" for name_pcode_nf, and \"M61\" for surname_pcode, with a md5sum of \"0fc7246dbb921159c17b6ac331c36078\". Justin Murphy is credited in the roles of producer, writer, and director, with a specific note indicating his role as a producer.\n\nThe structured data contains a list of keywords, each paired with a phonetic code. The keywords are: \"2d-animation\" with the phonetic code \"D535\", \"allegory\" with \"A426\", \"animal\" with \"A54\", \"cartoon\" with \"C635\", \"dog\" with \"D2\", and \"pitbull\" with \"P314\". Each keyword and its corresponding phonetic code are presented as distinct pairs, allowing for precise identification and retrieval.\n\nThe movie companies involved include Off Center Pictures and Rebellyunz Chylde Animation, both based in the United States. Off Center Pictures, identified by the name codes O1253 for both full and short forms, has an md5sum of cd0910bd636293e67e30884b3d906658 and is categorized under production companies. Similarly, Rebellyunz Chylde Animation, with name codes R1452 for both full and short forms, has an md5sum of 16cf8b4fea745a34ead6c4bb8174b019 and is also listed as a production company.\n\n"
    },
    {
        "title": "The Wanderer King",
        "dict_description": "The movie titled \"The Wanderer King\" has an ID of 2425149 and was produced in the year 2016. It is categorized under the kind \"movie\" and is associated with the phonetic code \"W5362\". The md5sum for this title is \"d53d9a4b9e11813368eb5dec5512305e\".\n\nThe animated fantasy film, directed by Larry Longstreth, is set in a world of goblins, trolls, dwarves, and elves, and follows the story of a young elf boy named Dante, destined to be king, and his protector, Landon Wanderer. As Dante's kingship reveals a sinister scheme, he transforms into something wicked, prompting Landon to stop him. Despite its dark tone, the film includes humor and wonder. It was filmed from January 15, 2015, with a budget of $500,000. Released in the USA on December 17, 2016, and in Los Angeles, California, on December 25, 2016, it is presented in English, in color, and in the 16:9 HD format. The genre is animation, and the country of origin is the USA.\n\nThe movie titled \"The Wanderer King\" is categorized as a movie. Vince Bruno, identified by the IMDb index \"I\" and gender \"m\", is associated with this film. His name codes are B6515 for name_pcode_cf, V5216 for name_pcode_nf, and B65 for surname_pcode, with a md5sum of 1cb52a9683d7214a94648f6dea53a35c. He is listed in the role of an actor, portraying a character named \"Soldier\", which has a name_pcode_nf of S436 and a md5sum of de75f2eb439368d9b39281bd0c4bdabb. The cast information includes a note indicating his involvement is \"(rumored)\". The movie titled \"The Wanderer King\" features Travis Fritz, a male actor, who plays the role of \"Goblin Clerk.\" The structured data includes specific identifiers for Travis Fritz, such as name_pcode_cf: \"F6323,\" name_pcode_nf: \"T6121,\" surname_pcode: \"F632,\" and md5sum: \"49d23c355eb8f1040e79fde9d8a6b1f8.\" The character \"Goblin Clerk\" is associated with name_pcode_nf: \"G1452,\" surname_pcode: \"C462,\" and md5sum: \"c00842a88d6b953cafdfcbb5f288e5f4.\" The cast information is provided in a structured format. The movie titled \"The Wanderer King\" features Noah Hathaway, identified by the name codes H35 and N3, with a surname code of H3 and an md5sum of daf1a256bb6f62834c94fcc9aee6b8a1. Noah Hathaway, a male actor, is rumored to play the character King Dante, whose name code is K5235, surname code is D53, and md5sum is 97eb1df78fab31696387ca202c5bf2a3. The cast information includes a note indicating this role is \"(rumored).\" The movie titled \"The Wanderer King\" features Aaron Longstreth, identified by the name codes L5236 and A6545, with a gender designation of male and an md5sum of 975073a755e5304fe84facb102beebdf. He plays the role of an actor, portraying the character named Troll, which is associated with the name code T64 and an md5sum of 922a511f02d148e4c9390526d85ca519. The cast information is provided in a structured format. The movie titled \"The Wanderer King\" features Larry Longstreth, a male, who is involved in multiple roles including actor, producer, writer, director, and editor. In the film, he portrays the character Wilbur. The cast information notes that he is attached to the project and serves as a producer. The movie titled \"The Wanderer King\" features Jason Miller, identified by the IMDb index \"X\" and gender \"m\", in the role of an actor. He portrays the character Lythos, with the character's name code \"L32\" and associated md5sum \"73998ed20ec3284e43044629710ca0d9\". Jason Miller's personal codes include name_pcode_cf \"M4625\", name_pcode_nf \"J2546\", and surname_pcode \"M46\", with an md5sum of \"5b55a4937f8b8debcb19186c8e23bf16\". The casting information notes his involvement as \"(rumored)\". The movie titled \"The Wanderer King\" features Teal Sherer, identified by the name codes S634 and T426, with a surname code S6 and an md5sum of 88e7422e10551dcb359bdf67f1498c3d. She is a female actress who plays the character Naga, which is associated with the name code N2 and an md5sum of f09a1594f0e21630b8888946669e116d. The cast information is provided in a structured format. The movie titled \"The Wanderer King\" features Marisa Zakaria, identified as female, in the role of an actress. She portrays the character \"Young Marta\" in the film. Marisa Zakaria's name is encoded with the following codes: name_pcode_cf as \"Z2656\", name_pcode_nf as \"M626\", and surname_pcode as \"Z26\", with an md5sum of \"4a4bd88a9e6d9e1d0f75e0a7417c4589\". The character \"Young Marta\" is encoded with name_pcode_nf as \"Y5256\" and surname_pcode as \"M63\", with an md5sum of \"e057471683c6437842011c6267a3b586\". The cast information is provided in an empty object. The movie titled \"The Wanderer King\" features Mark Ordesky, identified by the name codes O6325 and M6263, with a surname code of O632 and an md5sum of cf4467d069806f20962aff319b1eba03, as a producer. Mark Ordesky, a male, is associated with the role of producer, as noted in the cast information with the specific note \"(producer)\". The movie titled \"The Wanderer King\" is categorized as a \"movie.\" A person associated with this film is Mark D'Errico, whose identifiers include name_pcode_cf \"D6256,\" name_pcode_nf \"M6236,\" surname_pcode \"D62,\" and md5sum \"77f87730721c50b9c6907a1a3e102a02.\" Mark D'Errico's role in this movie is as a composer. The cast information is provided as an empty list, denoted by [{}]. The movie titled \"The Wanderer King\" features Jacob Ruby, identified by name_pcode_cf \"R121\", name_pcode_nf \"J2161\", and surname_pcode \"R1\", with a unique md5sum \"32ae4b576d40b709d26b143c8c3fd477\", in the role of editor. The cast info is provided as an empty list.\n\nThe structured data contains a list of keywords, each paired with a phonetic code. The first keyword is \"dungeons-and-dragons\" with the phonetic code \"D5252.\" The second keyword is \"epic,\" associated with the phonetic code \"E12.\" The third keyword is \"world-of-warcraft,\" which has the phonetic code \"W6431.\" Each keyword and its corresponding phonetic code are presented in a clear and concise manner.\n\nThe movie companies involved include Maverick Entertainment, which operates as a distributor and is based in the United Kingdom, denoted by the country code [gb]. It is identified by the name_pcode_nf and name_pcode_sf as M1625, with an md5sum of a01baa8770b0b2c894f17eaac7f0dd17. Additionally, Eddy Spaghetti Productions serves as a production company located in the United States, indicated by the country code [us]. This company is identified by the name_pcode_nf and name_pcode_sf as E3212, with an md5sum of a0e11037512433089a57bca0441f45fe.\n\n"
    },
    {
        "title": "Agent 47",
        "dict_description": "The structured data describes a movie titled \"Agent 47,\" identified by the ID 1669098. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"A253\" and an MD5 checksum of \"18e7adecca768d5ab7b207096b420312.\"\n\nThe movie is in English and falls under the Action genre. It was filmed in Berlin, Germany, and Singapore. The release date in the USA was in 2016. The film is presented in color and was produced in the USA.\n\nThe movie titled \"Agent 47\" features Daniel Alter, a male, who contributed as a producer. His role is specifically noted as an executive producer. Daniel Alter's identifiers include name_pcode_cf: A4363, name_pcode_nf: D5436, surname_pcode: A436, and md5sum: 476c5aa0c4b4e584869c4cc8212fc405. The movie titled \"Agent 47\" features Adrian Askarieh, identified by name_pcode_cf \"A2636\" and name_pcode_nf \"A3652\", with a surname_pcode of \"A26\" and an md5sum of \"9479cb132c59690516d69e4dfea4fb3d\", in the role of a producer. His involvement is specifically noted as an executive producer. The movie titled \"Agent 47\" is categorized as a \"movie.\" Involved in this project is Charles Gordon, identified by the IMDb index \"I,\" with a gender designation of \"m.\" His name codes are \"G6352\" for name_pcode_cf, \"C6426\" for name_pcode_nf, and \"G635\" for surname_pcode, with a unique md5sum of \"62afdaa41c8e6e2a714fd73603de8d4b.\" Charles Gordon's role in this movie is listed as a producer, with a specific note indicating \"(producer).\" The movie titled \"Agent 47\" is categorized as a \"movie.\" A person named Alex Young, identified with the IMDb index \"II,\" is associated with this film. Alex Young is male, with the name_pcode_cf \"Y5242,\" name_pcode_nf \"A4252,\" and surname_pcode \"Y52.\" His md5sum is \"0dc06ca12319447ef2b32c2d10747b10.\" He played the role of a producer, as noted in the cast info with the remark \"(producer).\" The movie titled \"Agent 47\" is categorized as a \"movie.\" Involved in this project is Michael Finch, identified with the IMDb index \"II.\" His name codes are \"F5252\" for name_pcode_cf, \"M2415\" for name_pcode_nf, and \"F52\" for surname_pcode, with a unique md5sum of \"ca43e3c94eded03ca9d7275c94631862.\" Michael Finch's role in this movie is listed as \"writer.\" The cast information is provided as an empty list, denoted by [{}]. The movie titled \"Agent 47\" features Skip Woods, identified by name codes W321 and S2132, with a surname code of W32 and an md5sum of 6c374ccacb899831cc0eafde1ba18fd4, in the role of a writer. The cast information is currently unspecified. The movie titled \"Agent 47\" is categorized as a movie. Aleksander Bach, identified by name codes B2425 and A4253, with a surname code B2 and an md5sum of 4cc02f3264b587ae7559fecd294f03ca, is associated with this film in the role of director. The cast information includes a note stating \"(attached).\"\n\nThe structured data contains a list of keywords, each paired with a phonetic code. The first keyword is \"assassin\" with the phonetic code \"A25\". Next is \"bald\", associated with the phonetic code \"B43\". The keyword \"hired-killer\" follows, having the phonetic code \"H6324\". Additionally, \"money\" is linked to the phonetic code \"M5\". Lastly, the keyword \"video-game\" is matched with the phonetic code \"V325\". Each keyword and its corresponding phonetic code are presented in a precise and organized manner.\n\nThe movie companies involved include Twentieth Century Fox Film Corporation, based in the United States, identified by name_pcode_nf \"T5325\" and name_pcode_sf \"T5325\", with an md5sum of \"db4d2c15bfaec32cb702f4b147c0aeef\", functioning as distributors. Additionally, 20th Century Fox Film Corporation, also from the United States, is listed as a production company with name_pcode_nf \"T2536\", name_pcode_sf \"T2536\", and an md5sum of \"1ab47b532b68b90de9f1ddf77ca23f23\". Another production company is Dune Entertainment, located in the United States, with name_pcode_nf \"D5363\", name_pcode_sf \"D5363\", and an md5sum of \"ad733822f83d9c315b2db19fa57c3385\".\n\n"
    },
    {
        "title": "Through the Glass",
        "dict_description": "The structured IMDb data describes a movie titled \"Through the Glass,\" identified by the ID 2434310. This film was produced in the year 2016 and is categorized under the kind \"movie.\" It has a phonetic code of \"T6232\" and an md5sum of \"56891c52be044aab3dee1c8dabfc2d63.\"\n\nThe movie was released in the USA in 2016, as indicated by the release dates information. It is associated with the country USA, according to the countries data. The film falls under the Drama genre, as specified in the genres information.\n\nThe movie titled \"Through the Glass\" features Fabien Hameline, a male, who contributed as both a producer and a writer. His involvement is specifically noted as \"(producer)\" and \"(written by)\". Fabien Hameline's identifiers include name_pcode_cf \"H5451\", name_pcode_nf \"F1545\", surname_pcode \"H545\", and md5sum \"c148ff4d29b2a94ccbd185e0c5eccb0b\".\n\nThe provided data contains a single keyword entry. The keyword is \"based-on-true-story,\" and it is associated with the phonetic code \"B2353.\" This information is structured as a list with one item, ensuring that each element is clearly defined and can be easily identified.\n\nThe movie company involved is Garance Pictures, identified by the name code \"G6521\" for both name_pcode_nf and name_pcode_sf. This company is based in the United States, as indicated by the country code \"[us]\". It is categorized under \"production companies\" and has an associated md5sum of \"6647514ce8e98c5e46711cb188c6dde4\".\n\n"
    },
    {
        "title": "Alma",
        "dict_description": "The movie titled \"Alma\" has an ID of 1677407 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"A45\". The MD5 checksum associated with this title is \"44630a60d691f01dd9985779813d55dc\".\n\nThe movie is from the country: USA. It belongs to the following genres: Animation, Fantasy, Horror, and Mystery.\n\nThe movie titled \"Alma\" features Guillermo del Toro, identified by the name codes D4362 and G4653, with a surname code of D436 and an md5sum of 99b042e07b27b0321ca6e19f126c67f0, as a male producer. His role includes being an executive producer, as noted in the cast information. The movie titled \"Alma\" features Rodrigo Blaas, identified by the name codes B4263 and R3621, with a surname code of B42 and an md5sum of 3b943ecb2109c28c489bdd339517b0ff. Blaas, a male, contributed to the film in multiple roles: as a writer with notes indicating \"(screenplay)\" and \"(story),\" and as a director. The movie titled \"Alma\" is categorized as a \"movie.\" Involved in this project is Megan Holley, identified by the IMDb index \"I,\" with a gender designation of \"f.\" Her name codes are \"H4525\" for name_pcode_cf, \"M254\" for name_pcode_nf, and \"H4\" for surname_pcode, with an md5sum of \"d564c1de55362edb599aa35a163b74ea.\" Megan Holley contributed to \"Alma\" in the role of a writer. The cast information is provided as an empty list, denoted by [{}].\n\nThe structured IMDb data contains a keyword entry with the keyword \"based-on-short-film\" and an associated phonetic code \"B2352\".\n\nThe movie companies involved include Paramount Pictures and DreamWorks Animation. Paramount Pictures, identified by the name_pcode_nf \"P6531\" and name_pcode_sf \"P6531\", operates as a distributor in the United States, denoted by the country code \"[us]\", with an md5sum of \"366857dfcb81be550d76b5ac30b38935\". DreamWorks Animation, also based in the United States with the country code \"[us]\", functions as a production company. It is identified by the name_pcode_nf \"D6562\" and name_pcode_sf \"D6562\", with an md5sum of \"c9e4cf22c86c6a0dd26008c9068bd894\".\n\n"
    },
    {
        "title": "Zombie Baby",
        "dict_description": "The movie titled \"Zombie Baby\" has an ID of 2520697 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"Z51\". The md5sum associated with this title is \"e59ea42d05fa4155c338e1b8fd875dd4\".\n\nThe movie is associated with the country \"USA\" and falls under the genre \"Comedy\".\n\nThe movie titled \"Zombie Baby\" is categorized as a movie. A person associated with this film is Andy Jones, identified by the IMDb index \"XXIX\" and name codes \"J5253\" and \"A5325,\" with a surname code \"J52\" and an MD5 checksum of \"201aa7a5e9ad1e66b42ecfe30bb109bc.\" Andy Jones contributed to the film in the role of a writer. The cast information is provided as an empty list.\n\nThe structured IMDb data includes three keywords, each with an associated phonetic code. The first keyword is \"baby,\" which has the phonetic code \"B1.\" The second keyword is \"zombie,\" with the phonetic code \"Z51.\" The third keyword is \"zombie-baby,\" also carrying the phonetic code \"Z51.\"\n\nThe movie company involved is LBI Entertainment, identified by the name_pcode_nf and name_pcode_sf as \"L1536\". It is based in the United States, denoted by the country code \"[us]\". The company is categorized under \"production companies\" and has an associated md5sum of \"4ec714c119835b4385871bf77fd40c76\".\n\nThe alternate title \"The Anklebiter\" is associated with the ID 349992 and is linked to the movie ID 2520697. This title is categorized under kind ID 1 and was produced in the year 2015. It carries the phonetic code A5241 and is noted as \"(USA) (new title).\" The MD5 checksum for this entry is d28579d95f1594a68cb333617ab14380.\n\n"
    },
    {
        "title": "Botticelli Murders",
        "dict_description": "The movie titled \"Botticelli Murders\" has an ID of 1742132 and was produced in the year 2015. It is categorized under the kind \"movie\" and is associated with the phonetic code \"B3245\". The md5sum for this title is \"a4c311cf983597560d1f689babd5d552\".\n\nThe movie features dialogues in both Italian and English and was filmed in Tuscany, Italy. It employs a Dolby Digital sound mix and utilizes technical specifications such as CAM:Red Epic, OFM:Redcode RAW, and a RAT:2.35 : 1 aspect ratio. The film is produced in Italy and spans multiple genres, including History, Mystery, Romance, and Thriller.\n\nThe movie titled \"Botticelli Murders\" features Adrian Annis, a male actor, in the role of Lawrence The Popolano. Adrian Annis is identified by the name_pcode_cf \"A5236\", name_pcode_nf \"A3652\", and surname_pcode \"A52\", with a unique md5sum of \"945d0cff170e92c2fe40b8232434b715\". The character Lawrence The Popolano is associated with the name_pcode_nf \"L6523\", surname_pcode \"P145\", and has an md5sum of \"91382bb09ab2fa710c2b5c985a43ed8f\". The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" is categorized as a movie. Jason Croot, identified as a male, is involved in this film both as an actor and a producer. His character in the movie is named Lawrence The Magnificent. The cast information includes a note indicating his role as a co-producer. The movie titled \"Botticelli Murders\" is categorized as a movie. In this film, Ian Cullen, identified as a male with the name codes C45 and I5245, and an md5sum of 58f04491945d615be090df2293f77528, is involved in the role of an actor. He is associated with the character named Padre Pietro, which has the name code P3613, surname code P36, and an md5sum of 99bf824647a44cf635214df54baadbea. The casting information includes a note indicating that this involvement is rumored. The movie titled \"Botticelli Murders\" is categorized as a movie. In this film, David Frampton, identified by the name codes F6513 and D1316 and the md5sum d8d462639bdb2584284221fb04e59ac8, is a male actor who plays the character Raniero. The character Raniero is associated with the name code R56 and the md5sum 0d10bed559725720018f484f24d7db35. The cast information is provided but contains no additional details. The movie titled \"Botticelli Murders\" is categorized as a \"movie.\" In this film, Elliott Francis, identified with the IMDb index \"II,\" is a male actor. His name codes are \"F6524\" for name_pcode_cf, \"E4316\" for name_pcode_nf, and \"F652\" for surname_pcode, with a md5sum of \"0445433388031f15dcd5db667bf7536c.\" He plays the character \"Julian of Medici,\" whose name_pcode_nf is \"J4515\" and surname_pcode is \"M32,\" with a md5sum of \"45c1095c36e8ad69cad82df4c271d597.\" The cast information is provided as an empty list. The movie titled \"Botticelli Murders\" is categorized as a movie. In this film, Alexandra Kelly, identified with the IMDb index \"IV\" and gender \"m\", plays a role as an actor. Her name codes are \"K4253\" for name_pcode_cf, \"A4253\" for name_pcode_nf, and \"K4\" for surname_pcode, with a md5sum of \"17ecaa5d6238ce690f59cc4d4d40b2bd\". She portrays the character named Nadia, whose name_pcode_nf is \"N3\" and has a md5sum of \"a5393955bf3a6fe73b3498bcae29af0c\". The cast information is provided as an empty object. The movie titled \"Botticelli Murders\" features Alessandro De Marco, identified by the name code \"M6242\" and surname code \"M62\", with a gender designation of male. He plays the role of an actor, portraying the character Ilario Guglielmetti, whose name code is \"I4624\" and surname code is \"G2453\". The unique identifier for Alessandro De Marco is \"46f1942957043253f5a81857db6a1cc4\", while the identifier for the character Ilario Guglielmetti is \"5f1d0ef5ed1974d1340afdc31ae00066\". The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Lorenzo Raveggi, a male, who plays multiple roles as an actor, producer, writer, and director. In the film, he portrays the character Domenico Ghirlandaio. The cast information includes a note indicating his role as a producer. The movie titled \"Botticelli Murders\" is categorized as a \"movie.\" In this film, Vidal Sancho, a male actor, plays the role of \"Inspector Benelli.\" The structured data provides specific codes for identification: Vidal Sancho's name codes are \"S5213\" for name_pcode_cf and \"V3425\" for name_pcode_nf, with a surname_pcode of \"S52\" and an md5sum of \"6862a03e1a7b8f44a94f33b8bdef571c.\" The character \"Inspector Benelli\" is associated with the name_pcode_nf \"I5212,\" a surname_pcode of \"B54,\" and an md5sum of \"b041d276741c750777dfc44634071c90.\" The cast information is provided in an empty list format. The movie titled \"Botticelli Murders\" is categorized as a movie. In this film, Kim Sønderholm, identified as male, plays the role of an actor. He portrays the character Sandro Botticelli. The structured data includes specific codes and identifiers: Kim Sønderholm's name_pcode_cf is S5364, name_pcode_nf is K5253, and his md5sum is adbbffa76e815660b3ddb7d4734f8413. The character Sandro Botticelli has a name_pcode_nf of S5361, a surname_pcode of B324, and an md5sum of e7d01fa8d73a4a1f0208ceaf8699ecca. The cast information is provided but contains no additional details. The movie titled \"Botticelli Murders\" is categorized as a movie. In this film, Robert Toretto, identified as male, plays the role of an actor. His character in the movie is named James Robertson. The structured data includes specific codes for Robert Toretto: name_pcode_cf is T6361, name_pcode_nf is R1636, surname_pcode is T63, and his md5sum is 49bc75a076e77fe868aff6b5be6e4f3a. For the character James Robertson, the name_pcode_nf is J5261, surname_pcode is R1632, and the md5sum is 0081656daf91ca9f843297ff7c912453. The cast information is provided but contains no additional details. The movie titled \"Botticelli Murders\" features Catherine Balavage, identified by the name codes B4123 and C3651, with a surname code of B412 and an md5sum of 48053965c41c4ea862025f0d50a19e18. She is a female actress who plays the character Lady Eleanor, associated with the name code L3456, surname code E456, and md5sum 30f01e74ff5bdfa99178aa9c785e0e6d. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Valeria Bandino, identified by the name codes B5351 and V4615, with a surname code of B535 and an md5sum of c1efed003c664055923b8592b4e7d596. She is an actress, playing the character Margareth, whose name code is M6263 and md5sum is 0c0f5960c472473a99d7ca814cb9c711. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Freya Berry, identified by the name code \"B616\" and \"F616,\" with a surname code \"B6\" and an md5sum of \"4d6a9c66ebed667ace12976e49125987.\" She is an actress, playing the character Lady Beatrice, whose name code is \"L3136\" with a surname code \"B362\" and an md5sum of \"6b1254340750c5db4aa81c0299c00c60.\" The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Mhairi Calvey, identified by the name codes C4156 and M6241, with a surname code of C41 and an md5sum of e77c9d3a08640d183765d369db40c797. She is an actress, playing the character Melissa, who is associated with the name code M42 and an md5sum of 3d4400b3b015c2b75cca4e94966e8a16. The film is categorized as a movie, and the cast information is provided without additional details. The movie titled \"Botticelli Murders\" is categorized as a movie. In this film, Kristina Cepraga, identified by the name codes C1626 and K6235, with a surname code of C162 and an md5sum of fd392de95f81443dc5d00b786967a6b8, plays the role of an actress. She portrays the character Lady Guendalina, whose name code is L3253, surname code is G5345, and md5sum is 66967b0cca29ce27ef51f87973fd8469. The cast information is provided in an empty object. The movie titled \"Botticelli Murders\" is categorized as a movie. Claudia Coulter, identified by the name codes C4362 and C4324, with a surname code C436 and an md5sum of 467735396fdd7d433ec2289a99bbdc34, is a female actress in this film. She plays the character Erminia Deodati, whose name code is E653, surname code is D3, and md5sum is 5f1227596f66a97a9bbbf70fe50fac8d. The cast information is provided but contains no additional details. The movie titled \"Botticelli Murders\" features Maria de Lima, identified by the name codes D456 and M6345, with a surname code of D45 and an md5sum of 24d7bb7a744ee93769ebfec3536e8da4. She is an actress who plays the character Lola Renzi, associated with the name code L4652, surname code R52, and md5sum b69401473fa265e43f32016dbfc7efd1. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Rowena Diamond, identified by the name codes D5365 and R5353, with a surname code of D53 and an md5sum of 86ff6be191a3676760db137f2220195c. She is an actress, playing the character Lucrezia of Medici, whose name code is L2621, surname code is M32, and md5sum is dc9d1239849d7feee2c15f0efda68cca. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Lucy Drive, a female actress, in the role of Clarice Orsini. Lucy Drive's identifiers include name_pcode_cf: D6142, name_pcode_nf: L2361, surname_pcode: D61, and md5sum: 51aeb31ff3740145c6ee2d8ea04feada. Her character, Clarice Orsini, is identified by name_pcode_nf: C4626, surname_pcode: O625, and md5sum: dc614462e05cf6822b2ada18db909022. The cast information is provided without additional details. The movie titled \"Botticelli Murders\" features Eaoifa Forward, a female actress, in the role of Katya Renzi. Eaoifa Forward's name is encoded with the following codes: name_pcode_cf as \"F631\", name_pcode_nf as \"E163\", and surname_pcode as \"F63\", with a md5sum of \"3b3c84b2662c31f3025e65370d155687\". Her character, Katya Renzi, is encoded with name_pcode_nf as \"K3652\" and surname_pcode as \"R52\", with a md5sum of \"ed718e94e80da759b7b633f5920a5006\". The cast information is provided as an empty object. The movie titled \"Botticelli Murders\" features Grace Meurisse Francis, identified by the gender code \"f\" and name codes \"F6526\" and \"G6256,\" with a surname code \"F652\" and an md5sum of \"341b7a385df11abc9b96fe8eedac8e38,\" in the role of an actress. She portrays the character Lady Jean, whose name code is \"L325\" and surname code is \"J5,\" with an md5sum of \"ecb7e57f68c119261378afdd25b32ee1.\" The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Natassia Malthe, identified by the name codes M4353 and N3254, with a surname code M43 and an md5sum of e06172fa94e967cb0ba5881ea2633aa6. She is a female actress who plays the character Mara Young, associated with the name code M652, surname code Y52, and an md5sum of 7c84eda13858b4dab93a8854aa410f6b. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Eve Mauro, identified by the name codes M61 and E156, with a surname code M6 and an md5sum of 3b9ffdf84adffd692dcd0fb21d87b049. She is a female actress who plays the character Carla Renzi, associated with the name code C6465, surname code R52, and md5sum a6eeaca444a4d29da6b03f703a97f415. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" is categorized as a movie. Denise Moreno, identified with the IMDb index \"II\" and gender \"f\", is associated with this film. Her name codes are \"M6535\" for name_pcode_cf, \"D5256\" for name_pcode_nf, and \"M65\" for surname_pcode, with a unique md5sum of \"cbe7841cfa9a0d799920450418fc2a06\". She plays the role of an actress, portraying the character Samantha, whose name_pcode_nf is \"S53\" and md5sum is \"a457529c4fc8ca95e65012a109661826\". The cast information is provided as an empty object. The movie titled \"Botticelli Murders\" features Nicola Posener, identified by the name codes P2565 and N2412, with a surname code of P256 and an md5sum of f589bd3ddb656f0ccc98983dd6952915. She is a female actress who plays the character Simonetta Vespucci, associated with the name code S5312, surname code V212, and md5sum 65691db66c7a9d7e4ccbd61fcc8f9f85. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Leila Reid, identified by the name codes R34 and L463, with a surname code R3 and a unique md5sum of f12597839691131dc1d0fe7bab4ecf94. She is an actress, playing the character Lady Claretta, whose name code is L3246, surname code C463, and md5sum 2ce92dce7bc5628ecd7241be610c7a8e. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" features Lucinda Rhodes-Flaherty, identified by the name codes R3214 and L2536, with a gender designation of female and an md5sum of ff6da72182b3b2cf7365939f4684266b. She plays the role of an actress, portraying the character Edwige Gautier, whose name code is E3236, surname code is G36, and md5sum is 9c2e936f2b5805bb6cfad618d1e3dde9. The cast information is provided in a structured format. The movie titled \"Botticelli Murders\" is categorized as a movie. Fernanda Romero, identified with the IMDb index \"II\" and gender \"f\", is involved in this film. Her name codes are \"R5616\" for name_pcode_cf, \"F6536\" for name_pcode_nf, and \"R56\" for surname_pcode, with an md5sum of \"7516b125dd9737566e1be0d25c40ee39\". She plays the role of an actress, portraying the character Sofia Costanzo. The character's name codes are \"S1235\" for name_pcode_nf and \"C2352\" for surname_pcode, with an md5sum of \"08e600887864650e1bf4a71972a22743\". The cast information is provided as an empty object. The movie titled \"Botticelli Murders\" features a person named Rusciano, Rita, who is identified as female. Her name codes are R2563 for name_pcode_cf and R3625 for name_pcode_nf, with a surname_pcode of R25 and an md5sum of d17a7c8e4b54aaa091e50c37d140e12f. She plays the role of an actress in the film, portraying the character Semiramide Appiani. The character's name code is S5653 for name_pcode_nf, with a surname_pcode of A15 and an md5sum of d81fa4347ffbbf473f257acb4b4899df. The cast info section is currently empty. The movie titled \"Botticelli Murders\" is categorized as a \"movie.\" Involved in its production is Marzia Pissilli, identified by the name codes \"P2456\" and \"M6212,\" with a surname code \"P24\" and an md5sum of \"16b4df89bd1dc7d4f77cb57809f824e2.\" Marzia Pissilli, a female, contributed to the film in the role of a producer, specifically noted as an \"associate producer.\" The movie titled \"Botticelli Murders\" features Marco Werba, identified by name codes W6156 and M6261, with a surname code of W61 and an md5sum of 899e025a1829798774a6dc333d7affd5, in the role of composer. The cast information is provided as an empty list. The movie titled \"Botticelli Murders\" features Katherine Burchill, identified by name codes B6242 and K3651, with a surname code of B624 and an md5sum of 734df15f0393cd31145ae8abb8843e00, in the role of a costume designer. The cast information is provided in a structured format.\n\nThe structured data contains a keyword entry with the keyword \"the-secret-of-botticelli\" and its associated phonetic code \"T2631\".\n\nThe movie company involved is Jcp, identified as a production company. It is associated with the country code [gb]. The name_pcode_nf for Jcp is J21, while the name_pcode_sf is J2121. The md5sum for this entry is c7b04d449316b73aadca9f56506a0c12.\n\n"
    },
    {
        "title": "B.O.O.: Bureau of Otherworldly Operations",
        "dict_description": "The movie titled \"B.O.O.: Bureau of Otherworldly Operations\" has an ID of 1706213 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"B1613.\" The md5sum associated with this title is \"9913b1dd0046e54ca8df86d3da0d59bc.\"\n\nThe movie, released in the USA on 25 September 2015, is in English and originates from the USA. It is presented in color and falls under the genres of Animation, Comedy, and Family.\n\nThe movie titled \"B.O.O.: Bureau of Otherworldly Operations\" is categorized as a \"movie.\" In this film, Seth Rogen, identified by the name codes \"R2523\" and \"S3625,\" with the surname code \"R25\" and the md5sum \"b95a397f03b87a9092f8e6c0eb30c7ab,\" participates in the role of an \"actor.\" Seth Rogen is male, as indicated by the gender \"m.\" The cast information is provided as an empty list, denoted by [{}]. The movie titled \"B.O.O.: Bureau of Otherworldly Operations\" features Maryann Garger, identified by the name codes G6265 and M6526, with a surname code of G626 and an md5sum of c33c435434d5f4c65c3aa7a8a4736e5e. She is a female associated with the role of producer, as noted in the cast information with the specific note \"(producer)\". The movie titled \"B.O.O.: Bureau of Otherworldly Operations\" is categorized as a \"movie.\" The person associated with this title is Tom Wheeler, identified with the IMDb index \"II.\" He is male, with name codes \"W4635\" for name_pcode_cf, \"T546\" for name_pcode_nf, and \"W46\" for surname_pcode. His md5sum is \"41d1c8bea660617644cd53923e339313.\" Tom Wheeler's role in this movie is as a writer, specifically noted for the \"screenplay.\" The movie titled \"B.O.O.: Bureau of Otherworldly Operations\" is categorized as a \"movie.\" Involved in this project is a person named Yong Duk Jhun, identified by the name_pcode_cf \"J5232\" and name_pcode_nf \"Y5232,\" with a surname_pcode of \"J5\" and an md5sum of \"321c303263cc91ba4a8ec51dd7e378bb.\" Yong Duk Jhun's role in this movie is as a cinematographer. The cast information is provided as an empty list, denoted by [{}]. The movie titled \"B.O.O.: Bureau of Otherworldly Operations\" is categorized as a \"movie.\" It involves Anthony Leondis, identified by the name codes \"L5325\" and \"A5354,\" with a surname code \"L532\" and an MD5 checksum of \"850871e4469a41a4e34879faa00eda5b.\" Anthony Leondis, whose gender is male, is associated with the role of \"director\" for this film. The cast information is currently empty, as indicated by the empty dictionary in the \"cast info\" section.\n\nThe structured IMDb data contains keyword information with two entries. The first entry has the keyword \"period-in-title\" and is associated with the phonetic code \"P6353\". The second entry features the keyword \"title-ends-with-period\" linked to the phonetic code \"T3453\".\n\nThe movie companies involved include DreamWorks Animation and Twentieth Century Fox Film Corporation, both based in the United States. DreamWorks Animation appears twice in the data: once as a distributor and once as a production company, with the same identifiers, name_pcode_nf and name_pcode_sf, both being \"D6562\" and sharing the md5sum \"c9e4cf22c86c6a0dd26008c9068bd894\". Twentieth Century Fox Film Corporation is listed as a distributor, also from the United States, with name_pcode_nf and name_pcode_sf as \"T5325\" and an md5sum of \"db4d2c15bfaec32cb702f4b147c0aeef\".\n\nThe alternate title data includes a single entry with the ID 47496, associated with the movie ID 1706213. The title is \"Boo U.\" and it is classified under kind ID 1. This title was used as a working title in the USA for a production year of 2015. The phonetic code for this title is \"B,\" and it is identified by the MD5 checksum be65830d12ca457211fbdc36232fe34a.\n\n"
    },
    {
        "title": "Tiger's Curse",
        "dict_description": "The structured data describes a movie titled \"Tiger's Curse,\" identified by the ID 2436113. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of \"T2626\" and an MD5 checksum of \"5f2452b13ce28c5889cf11f84b1f6319.\"\n\nThe movie is associated with the country \"USA\" and falls under the genre \"Fantasy.\"\n\nThe movie titled \"Tiger's Curse\" is categorized as a \"movie.\" A person involved in this project is Raphael Kryszek, identified by the name codes \"K6261\" for name_pcode_cf, \"R1426\" for name_pcode_nf, and \"K62\" for surname_pcode, with an md5sum of \"85d486089139b3505b613346389f0ee3.\" Raphael Kryszek's role in the movie is listed as a \"producer,\" with a specific note indicating \"(producer).\" The movie titled \"Tiger's Curse\" is categorized as a \"movie.\" Mary Parent, identified by the name codes \"P6535\" and \"M6165\" and the surname code \"P653,\" with a gender of \"f\" and an md5sum of \"37d67333cd3b0da47d4c7a690ed26be0,\" is associated with this film. She is credited in the role of \"producer,\" as noted in the cast information with the specification \"(producer).\" The movie titled \"Tiger's Curse\" features Colleen Houck, identified by name codes H245 and C452, with a surname code of H2 and an md5sum of cb976c55903a11131b1580448f71d4bb, as a writer. The cast information notes that the movie is based on the novel \"Tiger's Curse.\" The movie titled \"Tiger's Curse\" is categorized as a \"movie.\" Julie Plec, identified by the name codes \"P424\" and \"J4142\" and the surname code \"P42,\" with an MD5 checksum of \"f5b70ff1bfc5f99f9564482e6aeffd04,\" is associated with this film. She is female and contributed to the project in the role of a writer, specifically noted for the \"screenplay.\"\n\nThe structured IMDb data includes several keywords, each with a corresponding phonetic code. The keyword \"animal-in-title\" is associated with the phonetic code \"A5453.\" The keyword \"apostrophe-in-title\" has the phonetic code \"A1236.\" For \"based-on-book,\" the phonetic code is \"B2351.\" The keyword \"curse\" is linked to the phonetic code \"C62.\" The term \"epic\" corresponds to the phonetic code \"E12.\" Additionally, \"punctuation-in-title\" is paired with the phonetic code \"P5235,\" and the keyword \"tiger\" is associated with the phonetic code \"T26.\" Each keyword and its phonetic code are presented in a structured format, allowing for precise identification and retrieval.\n\nThe movie companies involved are Disruption Entertainment, Ineffable Pictures, and Paramount Pictures, all based in the United States. Disruption Entertainment, identified by name_pcode_nf and name_pcode_sf as \"D2613\" and with an md5sum of \"77fd33f6af144d95e6871d6879ce2aeb,\" is categorized under production companies. Similarly, Ineffable Pictures, with name_pcode_nf and name_pcode_sf as \"I5141\" and an md5sum of \"abb4b02127a88b8e700f6c8cfbbc251e,\" also falls under production companies. Paramount Pictures, sharing the same category, is marked by name_pcode_nf and name_pcode_sf as \"P6531\" and has an md5sum of \"366857dfcb81be550d76b5ac30b38935.\"\n\n"
    },
    {
        "title": "Out of Sight",
        "dict_description": "The structured data describes a movie titled \"Out of Sight,\" identified by the ID 2183279. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of \"O3123\" and an MD5 checksum of \"b516f77bf5ac0b704750149cb331dac5.\"\n\nThe documentary film, released in the USA in 2015 with a limited release, is titled \"Out of Sight\" and explores the effects of ignorance, particularly focusing on how society treats adolescents suffering from depression or those at risk of suicide. The tagline for the film is \"A documentary about what we would rather not notice - inside the effects of ignorance.\" The film was produced with a budget of $50,000 and is presented in color. It was filmed in Bethlehem and Allentown, Pennsylvania, USA, and is in the English language. The sound mix is Dolby Digital, and the technical specifications include the use of cameras such as the Canon 5D, Canon XF300, and Panasonic AG-HVX200. The post-production process involved a Digital Intermediate, and the film is presented in a digital format with an aspect ratio of 1.78:1. The genre of the film is documentary, and it originates from the USA.\n\nThe movie titled \"Out of Sight\" features Leo Behe, a male actor, in the role of \"Himself.\" The structured data provides specific identifiers for Leo Behe, including name_pcode_cf \"B4,\" name_pcode_nf \"L1,\" surname_pcode \"B,\" and md5sum \"faab9a4c12a884cebe9f7d0e4cf85761.\" His character, \"Himself,\" is associated with name_pcode_nf \"H5241\" and md5sum \"6d46b1d5d80d20a7780e4d353df679d2.\" The cast information is included but not detailed further. The movie titled \"Out of Sight\" is categorized as a \"movie.\" In this film, Manny Griffiths, identified by the IMDb index \"I,\" contributes as an actor. Manny Griffiths is male, with name codes \"G6132\" and \"M5261,\" and an md5sum of \"1a07e785736524baa356558c5dfd89a0.\" He portrays the character \"Himself,\" which is associated with the name code \"H5241\" and an md5sum of \"6d46b1d5d80d20a7780e4d353df679d2.\" The cast information is provided in an empty list format. The movie titled \"Out of Sight\" features Aimee Bender, identified by the IMDb index \"II,\" as an actress. Aimee Bender, a female, is associated with the name_pcode_cf \"B5365,\" name_pcode_nf \"A5153,\" and surname_pcode \"B536,\" with a unique md5sum of \"1179d363c0d9be86a08da9282b5d25b7.\" In this film, she plays the character \"Herself,\" which is linked to the name_pcode_nf \"H6241\" and has an md5sum of \"af6cabaac0e8d397e9e7bc4317398d8e.\" The cast information is provided in an empty object. The movie titled \"Out of Sight,\" classified as a movie, features Molly Louise Hudelson, identified by the name codes H3425 and M4234, with a gender designation of female and an md5sum of 912612fea762c86708370ddc54155294. She is credited in the role of an actress. In this film, she portrays the character named \"Herself,\" which is associated with the name code H6241 and an md5sum of af6cabaac0e8d397e9e7bc4317398d8e. The cast information is provided in an empty structure. The movie titled \"Out of Sight,\" categorized as a movie, features Carly Marina, a female actress. Her name codes are M6526 for full name and C6456 for first name, with a surname code of M65, and her md5sum is 47d54334314a345f80b11b4e52965e51. In this film, she plays the character \"Herself,\" which has a name code of H6241 and an md5sum of af6cabaac0e8d397e9e7bc4317398d8e. The cast information is provided but contains no additional details. The movie titled \"Out of Sight\" features Jessie Minor, a female, who is involved in the film industry as an actress, producer, and director. In this movie, she plays the character \"Herself.\" The cast information includes a note indicating her role as a producer. Jessie's name is encoded with the following codes: name_pcode_cf \"M562,\" name_pcode_nf \"J256,\" and surname_pcode \"M56.\" Her unique identifier is the md5sum \"f9279e87b6f4b61657a4151f60e43382.\" The character \"Herself\" is associated with the name_pcode_nf \"H6241\" and has the md5sum \"af6cabaac0e8d397e9e7bc4317398d8e.\" The movie titled \"Out of Sight,\" categorized as a movie, features Hanna Lee Reehl, a female, in the role of an actress. In this film, she portrays the character named \"Herself.\" The structured data includes specific identifiers for Hanna Lee Reehl, such as name_pcode_cf: \"R454,\" name_pcode_nf: \"H5464,\" surname_pcode: \"R4,\" and md5sum: \"308bb3ac6962e6ec4c3008e06c2fb039.\" Additionally, the character \"Herself\" is associated with name_pcode_nf: \"H6241\" and md5sum: \"af6cabaac0e8d397e9e7bc4317398d8e.\" The cast information is provided in an empty list format. The movie titled \"Out of Sight\" features Karla Feldstein, identified by name_pcode_cf \"F4323\" and name_pcode_nf \"K6414\", with an md5sum of \"9321b9ff68df02aefcfdf2954d08cc4a\", in the role of a producer. Her specific contribution is noted as \"(associate producer)\". The movie titled \"Out of Sight\" features Kyle Mahaney, identified by name codes M524 and K45, with a surname code M5 and an md5sum of 3c2d382283a70a62be4ba028fdf8a155. Mahaney is credited with multiple roles in the film, specifically as a producer, cinematographer, director, and editor. Notably, the role of producer is accompanied by a specific note: \"(producer).\"\n\nThe structured data contains a list of keywords related to various themes, each accompanied by a specific phonetic code. The keyword \"depression\" is associated with the phonetic code \"D1625.\" The term \"mental-illness\" corresponds to the phonetic code \"M5345.\" Additionally, \"parenting\" is linked to the phonetic code \"P6535.\" The keyword \"teen-suicide\" is paired with the phonetic code \"T523,\" and finally, \"treatment\" is connected to the phonetic code \"T6353.\" Each keyword and its respective phonetic code are presented in a precise and organized manner.\n\nThe movie company involved is Five Blade Productions, identified by the name_pcode_nf and name_pcode_sf as F1431, and is based in the United States, denoted by the country code [us]. This company is categorized under production companies and is associated with the md5sum d29c6a4a0660b993f0fd302a49e8cf8c.\n\n"
    },
    {
        "title": "Portofino",
        "dict_description": "The structured IMDb data describes a movie titled \"Portofino,\" identified by the ID 2211981. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of \"P6315\" and an MD5 checksum of \"d97bf8e31f607b061307aef29c3614e0.\"\n\nThe movie was released in the USA in 2015, as indicated by the release dates information. It is associated with the country USA, according to the countries data. The film falls under the Thriller genre, as specified in the genres information.\n\nThe movie titled \"Portofino\" is categorized as a \"movie.\" Leonardo DiCaprio, identified by the name codes \"D2164\" and \"L5632\" and the surname code \"D216,\" with an MD5 checksum of \"8cf18ac2e9c350012ee5e6244ccf6f97,\" is associated with this film. He is male and serves in the role of \"producer.\" The cast information includes a note specifying his role as \"(producer).\" The movie titled \"Portofino\" is categorized as a \"movie.\" Jennifer Davisson Killoran is associated with this film, identified by the name codes \"K4652\" and \"J5163,\" and the surname code \"K465,\" with an MD5 checksum of \"3b9fec8a86320bea0e3ae6240abd34a0.\" She is credited in the role of \"producer,\" with a specific note indicating her role as \"(producer).\" The movie titled \"Portofino\" is categorized as a \"movie.\" It involves J.C. Chandor, a male, who is associated with the project in the role of a writer. His name is encoded with the following codes: name_pcode_cf \"C5362,\" name_pcode_nf \"J2536,\" and surname_pcode \"C536.\" Additionally, his md5sum is \"49223df025dad89d510cbe8e326db793.\" The cast information is currently unspecified, as indicated by an empty list.\n\nThe structured data contains a keyword entry with the keyword \"one-word-title\" and its associated phonetic code \"O5634\".\n\nThe movie companies involved include Appian Way and Warner Bros, both based in the United States, denoted by the country code \"[us]\". Appian Way is identified with the name_pcode_nf \"A15\" and name_pcode_sf \"A152\", and has an md5sum of \"1a4077797774cd5aae70a09bc560980d\". Warner Bros shares the same country code and is identified with the name_pcode_nf and name_pcode_sf \"W6561\", with an md5sum of \"66536c1169ac249b63418a1e03a02ed4\". Both companies are categorized under the type \"production companies\".\n\n"
    },
    {
        "title": "The Fantastic Four",
        "dict_description": "The structured data describes a movie titled \"The Fantastic Four,\" identified by the ID 2367607. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of \"F5323\" and an MD5 checksum of \"92e112d2284d66d75df6a9bf93c981e9.\"\n\nThe movie, filmed in Vancouver, British Columbia, Canada, is in English and was released in the USA on 6 March 2015. Filming took place from 17 June 2013 to an unspecified date in September 2013. It is presented in color and originates from the USA. The film belongs to the genres of Action, Fantasy, and Sci-Fi.\n\nThe movie titled \"The Fantastic Four\" is categorized as a \"movie.\" Gregory Goodman, identified by name codes G3526 and G6262, with a surname code G35 and an md5sum of d10eb1702a7aa4410bcd9f430f05c3d8, is associated with this film. He is credited in the role of \"producer,\" as noted in the cast information with the specific note \"(producer).\" The movie titled \"The Fantastic Four\" is categorized as a \"movie.\" A person named Cliff Lanning, identified as male, is associated with this film. His name codes are \"L5241\" for name_pcode_cf, \"C4145\" for name_pcode_nf, and \"L52\" for surname_pcode, with an md5sum of \"ce7706b5e1750ee074c9fdc5d3810330.\" Cliff Lanning's role in the movie is listed as \"producer,\" specifically noted as \"(associate producer).\" The movie titled \"The Fantastic Four\" features Mark Millar, identified by the IMDb index \"I\" and gender \"m\", as a producer. His name codes are M4656 for name_pcode_cf, M6254 for name_pcode_nf, and M46 for surname_pcode, with a unique md5sum of 41d1e5116999a1ef4827d49935644bf4. Additionally, he is noted as a creative consultant in the cast info. The movie titled \"The Fantastic Four\" is categorized as a \"movie.\" Involved in this production is Matthew Vaughn, identified by the IMDb index \"I,\" with a gender designation of \"m.\" His name codes are \"V253\" for name_pcode_cf, \"M3125\" for name_pcode_nf, and \"V25\" for surname_pcode, with a unique md5sum of \"6d46bcb7ff28959bf2fe6beb9fabbfbb.\" Vaughn's role in this project is listed as [\"producer\"], with a specific note indicating \"(producer).\" The movie titled \"The Fantastic Four\" features Seth Grahame-Smith, identified by the name codes G6525 and S3265, with a gender designation of male and an md5sum of 9827463a91233f2a7219b0663a7b4c1d, in the role of a writer. His contribution includes revisions, as noted in the cast information. The movie titled \"The Fantastic Four\" features Jack Kirby, identified by the IMDb index \"I\" and gender \"m\", as a writer. His name codes are K612 for name_pcode_cf, J261 for name_pcode_nf, and K61 for surname_pcode, with a md5sum of 0e38e73d4e526baa027620dc3f62620d. His role is specified as \"writer\" with a note indicating \"(characters)\". The movie titled \"The Fantastic Four\" features Stan Lee, identified by the IMDb index \"I\" and gender \"m\", as a writer. His name codes are L235 for name_pcode_cf, S354 for name_pcode_nf, and L for surname_pcode, with a unique md5sum of 1fa8146a0008d4fed226779377a154df. His role is specified with the note \"(characters)\". The movie titled \"The Fantastic Four\" is categorized as a \"movie.\" A person associated with this film is Ashley Miller, identified with the IMDb index \"II\" and gender \"m.\" His name codes are \"M4624\" for name_pcode_cf, \"A2454\" for name_pcode_nf, and \"M46\" for surname_pcode, with a unique md5sum of \"fcf466a0f314da4042a3d6e334d97a47.\" Ashley Miller's role in this movie is listed as [\"writer\"]. The cast information is provided as an empty dictionary [{}]. The movie titled \"The Fantastic Four\" features Jeremy Slater, identified by IMDb index \"I\" and name codes \"S4362\" and \"J6524,\" with a surname code \"S436\" and md5sum \"f7e4626aecc7bb4e2b0fa8cee945dec0,\" as a writer. His roles include \"writer\" with notes \"(screenplay)\" and \"(story).\" The movie titled \"The Fantastic Four\" features Zack Stentz, identified by the name codes S3532 and Z2353, as a writer. Stentz, a male, is associated with the md5sum dbe7e777f6dc6081a5b2f5c43be41ccf. The cast information is provided but contains no additional details. The movie titled \"The Fantastic Four\" is categorized as a \"movie.\" Josh Trank, identified by the name codes \"T652\" and \"J2365\" and the md5sum \"96d14d7724e06f06f641087f0d145443,\" is associated with this film. He is male and contributed to the project in the roles of both \"writer\" and \"director,\" with a specific note indicating his involvement in the \"(story).\"\n\nThe structured data contains a list of keywords, each paired with a phonetic code. The keywords include \"based-on-comic\" and \"based-on-comic-book,\" both sharing the phonetic code \"B2352.\" The keyword \"digit-in-title\" is associated with the phonetic code \"D2353,\" while \"group-name-in-title\" corresponds to \"G6153.\" The terms \"marvel-comics\" and \"marvel-entertainment\" have phonetic codes \"M6142\" and \"M6145,\" respectively. The keyword \"number-in-title\" is linked to \"N5165.\" The terms \"re-boot\" and \"remake\" are associated with phonetic codes \"R13\" and \"R52,\" respectively. Additionally, \"super-villain\" has the phonetic code \"S1614,\" \"superhero\" is linked to \"S16,\" \"superhero-team\" corresponds to \"S1635,\" and \"superheroine\" is associated with \"S165.\"\n\nThe movie companies involved include \"20th Century Fox Film Corporation\" from the United States, identified by the name codes \"T2536\" for both full and short forms, and the md5sum \"1ab47b532b68b90de9f1ddf77ca23f23\". This company serves as both a distributor and a production company.\n\nThe alternate title \"Henry Street\" is associated with the ID 294498 and is linked to the movie ID 2367607. This title is categorized under kind ID 1 and was produced in the year 2015. It has a phonetic code of \"H5623\" and carries a note indicating it is a \"(USA) (fake working title).\" The MD5 checksum for this entry is \"ecb17ae2c5848c0bb051305c8e6fd17c.\"\n\n"
    },
    {
        "title": "The Last Day",
        "dict_description": "The movie titled \"The Last Day\" has an ID of 2384233 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"L23\". The md5sum associated with this title is \"192999989e22cdd6a383dc4f7bff5ae6\".\n\nThe movie was released in the USA in 2015 and had a budget of $10,000,000. It belongs to the genres of Action, Horror, and Sci-Fi.\n\nThe movie titled \"The Last Day\" is categorized as a \"movie.\" A person involved in this project is Bobby Breed, identified by name codes: name_pcode_cf \"B631,\" name_pcode_nf \"B163,\" and surname_pcode \"B63,\" with an md5sum of \"5525eb680d5c2bb6ae10f25b1025aae9.\" Bobby Breed's role in the movie is listed as \"producer,\" specifically noted as \"(co-producer).\" The movie titled \"The Last Day\" features Jimmy Bridges, identified by the name codes B6325 and J5163, with a surname code of B632 and an md5sum of ec47f65b394f56bf6183472e3dc0f77b. Jimmy Bridges, a male, contributed to the film in the role of a producer, as noted in the cast information with the specific note \"(producer)\". The movie titled \"The Last Day\" is categorized as a \"movie.\" Cassandra Cooper, identified by name codes C1625 and C2536, with a surname code C16 and an md5sum of 066cd994b3619a67f23e57cc7e5e322e, is associated with this film. She holds the role of \"producer,\" specifically noted as an \"(executive producer).\" The movie titled \"The Last Day\" is categorized as a \"movie.\" A person involved in this project is Jason Durdon, identified by the name codes \"D6352\" and \"J2536,\" with a surname code \"D635\" and an MD5 checksum of \"959c59a5b9c11657a88537987e5cb791.\" Jason Durdon, who is male, contributed to the film in the role of a producer, as noted in the cast information with the annotation \"(producer).\" The movie titled \"The Last Day\" features James Duval, identified with the IMDb index \"II\" and gender \"m\", as a key contributor. His name codes are \"D1425\" for name_pcode_cf, \"J5231\" for name_pcode_nf, and \"D14\" for surname_pcode, with a md5sum of \"338c3d8f6152895b09465f8c95251631\". Duval holds the roles of producer and writer, specifically noted as \"(executive producer)\" and \"(writer)\" in the cast information. The movie titled \"The Last Day\" is categorized as a \"movie.\" A person named Shashawnee Hall, identified as male, is associated with this film. His name codes are \"H425\" for name_pcode_cf, \"S254\" for name_pcode_nf, and \"H4\" for surname_pcode, with a unique md5sum of \"abb8982cd381957bd1eb9432b4931353.\" Shashawnee Hall's role in the movie is listed as a producer, with a specific note indicating \"(producer).\" The movie titled \"The Last Day\" features Kenneth Nowling, identified by the name codes N4525 and K5354, with a surname code of N452 and an md5sum of e9b282b7f6d7d79398a0f99bc71f89fe. Kenneth Nowling, a male, contributed to the film in the role of a producer, specifically noted as an executive producer. The movie titled \"The Last Day\" is categorized as a \"movie.\" A person involved in this project is Danny Torres, identified with the IMDb index \"II,\" name_pcode_cf \"T6235,\" name_pcode_nf \"D5362,\" surname_pcode \"T62,\" and md5sum \"cda8dfd610bc07fea8bdcbbb793e8820.\" Danny Torres is credited in the role of \"producer,\" with a specific note indicating \"(producer).\" The movie titled \"The Last Day\" is categorized as a \"movie.\" Richard Scott, identified by the IMDb index \"XIII,\" is associated with this film. He is male, with name codes \"S2362\" and \"R2632,\" and a surname code \"S23.\" His unique identifier is the MD5 sum \"cb515ff78d945a5455fa7414861b8f7c.\" Richard Scott's role in the movie is as a writer, with a specific note indicating \"(writer).\"\n\nThe structured data contains a list of keywords, each paired with a phonetic code. The first keyword is \"apocalypse\" with the phonetic code \"A1241.\" The second keyword is \"neo-noir,\" associated with the phonetic code \"N56.\" The third keyword is \"second-coming,\" which has the phonetic code \"S2532.\" Lastly, the keyword \"suspense\" is linked to the phonetic code \"S2152.\"\n\nThe movie companies involved include Continuum Motion Pictures, MCTV, Matriarch Multimedia Group, and DVFilmworks, all based in the United States. Continuum Motion Pictures serves as both a distributor and a production company, identified by the code C5353 and md5sum 508c08b575867268d690cf5b5eeec4d4. MCTV, also a distributor, is marked with the code M231 and md5sum 56e0e869aaea945980677f0a2622ba0e. Matriarch Multimedia Group functions as both a distributor and a production company, with the code M3625 and md5sum f7a71724f30bbe4a6fcbaa9dfbe59586. Lastly, DVFilmworks is a production company, identified by the code D1456 and md5sum abdc538a9407440d32dbfd878a53e3f0.\n\n"
    },
    {
        "title": "Legacy",
        "dict_description": "The structured data describes a movie titled \"Legacy,\" identified by the ID 2064532. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of \"L2\" and an MD5 checksum of \"f34ed58807c3d8de8d58430a6c94c54d.\"\n\nThe movie, released in the USA in 2015, is an action-drama set in Chicago, Illinois, USA, and features English as its language. It follows the plot of Lucas Caine, who awakens mysteriously in Tibet with no memory of how he got there and later discovers his involvement in a centuries-old conflict between warring immortals. The tagline for the film is \"The most powerful light is found within the shadows...\" It was produced in color and utilizes a Dolby Digital sound mix with the RCA Sound System. The technical specifications include the use of Panavision Cameras and Lenses, a 35 mm film format, and a 2.35:1 aspect ratio. The film originates from the USA.\n\nThe movie titled \"Legacy\" features Jon Lee Brody, a male, who is involved in multiple roles including actor, producer, and writer. In this film, he portrays the character known as \"The Mystery Man.\" The cast information includes a note indicating his role as a producer. The structured data provides specific codes for identification: Brody's name_pcode_cf is B6325, name_pcode_nf is J5416, and surname_pcode is B63, with an md5sum of bc1260ae065b23378b5b44af43e0636f. The character \"The Mystery Man\" has a name_pcode_nf of T5236, a surname_pcode of M5, and an md5sum of 83750698fa77f69127bfafa63ce88a25. The movie titled \"Legacy\" features Lester Speight, a male actor, in two roles. In this film, he portrays the characters Terrence and The Maestro. The character Terrence is identified with the name code \"T652\" and has an md5sum of \"18ed147554abcaddf04399188916434c\". The character The Maestro is associated with the name code \"T5236\", surname code \"M236\", and an md5sum of \"b62417ab1ecb0c78dc57fec983b74d54\". Lester Speight's personal identifiers include name code \"S1234\", name code \"L2362\", surname code \"S123\", and an md5sum of \"ffb2f4469471936a7dc3c35d34d2c5ae\". The cast information is represented by two empty objects. The movie titled \"Legacy\" is categorized as a \"movie.\" A person associated with this film is Jon Knitter, whose name is encoded with the codes \"K5362\" for name_pcode_cf, \"J5253\" for name_pcode_nf, and \"K536\" for surname_pcode, with an md5sum of \"13330074d3fce669def9f8db88d3eba6.\" Jon Knitter is credited in the role of \"writer.\" The cast information is provided as an empty list, denoted by [{}]. The movie titled \"Legacy\" features Ric Waite, a male, who contributed as a cinematographer. His involvement is specifically noted as the director of photography. The movie titled \"Legacy\" features Greg C. Gonsky, identified by name codes G5262 and G6252, with a surname code of G52 and an md5sum of 152e494d96fe5776c4bf6db7f2fe881e, as part of the miscellaneous crew. His specific role is noted as \"(one sheet designer).\"\n\nThe structured data contains a keyword entry with the keyword \"one-word-title\" and its associated phonetic code \"O5634\".\n\nThe movie companies involved are Iron Will Productions, Kayln Ryane Entertainment, and Keepsake Productions, all based in the United States. Iron Will Productions, identified by the codes I6541 for both name_pcode_nf and name_pcode_sf, has an md5sum of 2f1acd392a226d111574003dd6355e83 and is categorized under production companies. Similarly, Kayln Ryane Entertainment, with the codes K4565 for both name_pcode_nf and name_pcode_sf, has an md5sum of 89e12cc8fcb0d428c6a850409aea1ad5, also listed as a production company. Lastly, Keepsake Productions, marked by the codes K1216 for both name_pcode_nf and name_pcode_sf, holds an md5sum of bd55a59552f2589e3c17872a97c973af and is classified as a production company.\n\n"
    },
    {
        "title": "Tennison Hopps",
        "dict_description": "The structured data describes a movie titled \"Tennison Hopps,\" identified by the ID 2338491. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of T5251 and an md5sum of 4509904d8d1e0eb97ed9da8ff6e01e64.\n\nThe movie \"TENNISON HOPPS\" was released in the USA in 2015. It is a coming-of-age, action/western tale produced by Agape Productions, set in 1889 New Mexico. The plot revolves around a 16-year-old boy who, after losing his family to a vicious act of violence, embarks on a desperate mission to rescue his 10-year-old brother, the only family he has left. The film is categorized under the Western genre and was produced in the USA.\n\nThe movie titled \"Tennison Hopps\" features Bruce Dern, a male actor, who is rumored to play the character Sheriff John William. Bruce Dern's identifiers include name_pcode_cf: D6516, name_pcode_nf: B6236, surname_pcode: D65, and md5sum: d3c0582e0a8c11fec0d6340f037d774c. The character Sheriff John William is associated with name_pcode_nf: S6125, surname_pcode: W45, and md5sum: 4c4fc6dffa9baddf79ec62a178f590dd. The cast information notes that Bruce Dern's involvement is rumored. The movie titled \"Tennison Hopps\" features Kevin Sorbo, identified by the name codes S6121 and K1526, with a surname code of S61 and an md5sum of c1fba84ff8095716856f3de066426cb3. Kevin Sorbo, a male actor, is part of the cast in this film. The role he plays is categorized under \"actor,\" and the cast information is provided as an empty set. The movie titled \"Tennison Hopps\" features Cole Claassen, identified by name codes C4252 and C4242, and surname code C425, with an md5sum of 7e93d0dad59bb37f991a21e9c8742405, as a key contributor. Claassen holds multiple roles in the film, serving as a producer, writer, and director. The cast information specifically notes his role as a producer. The movie titled \"Tennison Hopps\" is categorized as a \"movie.\" Involved in its production is Dave Ross, identified by the IMDb index \"I\" and name codes \"R231\" and \"D162,\" with a surname code \"R2\" and an MD5 checksum of \"99a67d9facc917586d423dffc3013ec3.\" Dave Ross served in the role of \"producer,\" specifically noted as an \"(executive producer).\" The movie titled \"Tennison Hopps\" features Jim Schmidt, identified by the IMDb index \"I,\" as a producer. Jim Schmidt is a male, with name codes S2532 and J5253, and a surname code S253. His unique identifier is the MD5 sum \"40c63b22cbe9976208be4778621b0d5d.\" The role he plays in this movie is specifically noted as \"producer.\" The movie titled \"Tennison Hopps\" features John Schmidt, identified with the IMDb index \"II\" and name codes \"S2532\" and \"J5253,\" with a surname code \"S253\" and an MD5 checksum of \"84beef68682c7d4205c6ee075a7bd777,\" in the role of a producer. His specific contribution is noted as \"(executive producer).\" The movie titled \"Tennison Hopps\" features Tim Hosman, identified by name_pcode_cf \"H2535\", name_pcode_nf \"T525\", and surname_pcode \"H25\", with an md5sum of \"9a7a85dfd5fc82a523833cfba8041150\", in the role of composer. The cast info is provided as an empty list.\n\nThe structured IMDb data includes a list of keywords, each paired with a phonetic code. The keywords are: \"10-year-old\" with the phonetic code \"Y643\", \"16-year-old\" also with the phonetic code \"Y643\", \"coming-of-age\" with the phonetic code \"C5212\", \"new-mexico\" with the phonetic code \"N52\", \"two-word-title\" with the phonetic code \"T634\", and \"year-1889\" with the phonetic code \"Y6\". Each keyword and its corresponding phonetic code are presented as distinct pairs, allowing for precise identification and retrieval.\n\nThe movie companies involved include Cole Claassen's Agape Productions, Jim Schmidt Entertainment, and Rambunctious Films, all based in the United States. Cole Claassen's Agape Productions is identified with the name codes C4242 for both name_pcode_nf and name_pcode_sf, and has an md5sum of 921a0c91253d5f10524a105c8d5d13c8. Jim Schmidt Entertainment shares the name codes J5253 for both name_pcode_nf and name_pcode_sf, with an md5sum of 9d87996ee3b759e3735b169e3f1ac79f. Rambunctious Films is associated with the name codes R5152 for both name_pcode_nf and name_pcode_sf, and has an md5sum of ac79589f2553b30873ba5c3f414682fb. All three entities are categorized as production companies.\n\n"
    },
    {
        "title": "Trapezoid",
        "dict_description": "The movie titled \"Trapezoid,\" identified by the ID 2447827, was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of T6123. The md5sum associated with this title is 3d14e4385028cb47853666b31f5631d2.\n\nThe movie was filmed in Los Angeles, California, USA, and Toronto, Ontario, Canada. It was released in the USA in 2015. The film is from the USA and falls under the genres of Action, Sci-Fi, and Thriller.\n\nThe movie titled \"Trapezoid\" features Michael Gianfriddo, identified by name codes G5163 and M2425, with an md5sum of e0373ccae36262989993faa53f4cffb5, in the roles of producer and producer. His contributions are noted as (executive producer) and (producer). The movie titled \"Trapezoid,\" classified as a movie, features Jim Hays, identified by the IMDb index \"I\" and name codes \"H25\" and \"J52,\" with a surname code \"H2\" and an MD5 checksum of \"861e5e0b93fb3172cb5c151292ad6e5d.\" Jim Hays is credited in the role of a producer, with the cast information noting this role specifically as \"(producer).\" The movie titled \"Trapezoid\" is categorized as a movie. Diana Kemp, identified by the IMDb index \"I\" and gender \"f\", is associated with this film. Her name codes are \"K5135\" for name_pcode_cf, \"D5251\" for name_pcode_nf, and \"K51\" for surname_pcode, with a md5sum of \"59471296ea45a9dbb4022d1c6b8cc0a9\". She contributed to the film in the roles of producer and writer, with a specific note indicating her role as a producer. The movie titled \"Trapezoid\" is categorized as a \"movie\" and features Daniel A. Sherkow, identified by name codes S6235 and D5426, with a surname code of S62 and an md5sum of 588bc9db6bd3427b5d29018420d2d64c, in the role of a producer. His specific contribution is noted as \"(executive producer)\" in the cast information. The movie titled \"Trapezoid\" is categorized as a \"movie\" and features Harvey Lowry, identified by the name code \"L61\" and name pcode \"H6146,\" with a surname pcode of \"L6\" and an md5sum of \"af21eec999f948d03be01392ab0a4dcb.\" Harvey Lowry, a male, is credited in the role of \"director.\" The cast information is currently unspecified, as indicated by an empty list.\n\nThe structured data contains keyword information with two entries. The first keyword is \"mercenary\" with a phonetic code of \"M6256.\" The second keyword is \"one-word-title\" with a phonetic code of \"O5634.\"\n\nThe movie companies involved include Dominant Entertainment and Shadowland Productions, both based in the United States. Dominant Entertainment serves dual roles as both a distributor and a production company, identified by the name code \"D5353\" and the md5sum \"d79dc230b1752e43c87fd6536c49be69.\" Shadowland Productions operates solely as a production company, with the name code \"S3453\" and the md5sum \"bef3723a1d7b4a531e8aa0971ccab60e.\"\n\n"
    },
    {
        "title": "Taming the Beast",
        "dict_description": "The structured data describes a movie titled \"Taming the Beast\" with an ID of 2332102. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of T5231 and an md5sum of 632f418fb255eabc8929f408fb3509b9.\n\nThe film, set in the USA, was released on 26 October 2015 and is presented in English. It was filmed up to 1 September 2010 and has a budget of $500,000. The copyright holder is Thurane AungKhin. The movie is a color production and spans the genres of Crime, Drama, History, Horror, and Thriller. It includes quotes such as, \"[... only a body is in prison. At my will, I walk your streets and am right out there among you. -Charles Manson]\" and \"[Stone souls, prowling the neighborhoods, out on the town, for a bloodbath. Five or six people get murdered and everybody panics. So what's the big deal? People die every day.\\\" -Lynette \\\"Squeaky\\\" Fromme]\". The film is adapted from Edward George with Dary Matera's book, \"Taming The Beast: Charles Manson's Life Behind Bars,\" published by St. Martin's Press on 1 January 1999, ISBN-10: 0312209703. The screenplay, \"Taming The Beast,\" by AungKhin, Thurane, appears in \"Taming The Beast: Charles Manson's Life Behind Bars,\" dated 25 November 2006, on page 120. A printed media review by Bugliosi, Vincent, describes it as \"A valuable book which gives additional insights into the criminal mind of Charles Manson,\" found in \"Helter Skelter,\" dated 3 March 1998.\n\nThe movie titled \"Taming the Beast\" features Gil Andrews, identified with the IMDb index \"II\" and gender \"m\", as an actor. In this film, he plays the character named \"Inmate\". The structured data includes specific codes and identifiers: Gil Andrews has a name_pcode_cf of \"A5362\", a name_pcode_nf of \"G4536\", and an md5sum of \"3e345fd08bad6167dafc9b53b52300ea\". The character \"Inmate\" is associated with a name_pcode_nf of \"I53\" and an md5sum of \"de492f25da2c5f96c43457bc315d3821\". The cast information is provided in a structured format. The movie titled \"Taming the Beast\" features Thurane AungKhin, a male, who contributes as an actor, writer, and composer. In the film, he plays the character \"Prison Guard.\" His involvement as a writer includes an adaptation, as noted in the cast information. The movie titled \"Taming the Beast\" is categorized as a movie. In this film, Marcus Jordan, identified by the IMDb index \"I\" and gender \"m\", plays a role as an actor. His name is encoded with the codes \"J6356\" for name_pcode_cf, \"M6263\" for name_pcode_nf, and \"J635\" for surname_pcode, with a unique identifier md5sum \"805ef36b044d5c0f4c9c85d6da891290\". He portrays the character \"Medical Staff\", which is encoded with the name_pcode_nf \"M3242\" and surname_pcode \"S31\", and has an md5sum of \"54370fffaa6529c79fe4068ebab05bab\". The cast information is provided in an empty list format. The movie titled \"Taming the Beast\" features James Leatherman, identified by the name codes L3652 and J5243, with a surname code of L365 and an md5sum of f6b8011f43fd559249889f7795a67cd7. He is a male actor who plays the character \"Inmate,\" which is associated with the name code I53 and an md5sum of de492f25da2c5f96c43457bc315d3821. The cast information is provided in a structured format. The movie titled \"Taming the Beast\" features a person named Tracy Motley, identified as male, with name codes M3436 and T6253, and surname code M34, having an md5sum of b0bcf8f3c4aab9f01c260f865cfdd2c7. Tracy Motley plays the role of an actor, portraying the character \"Prison Guard,\" who is associated with name code P6252 and surname code G63, with an md5sum of 66bd2b0f7e67da90152c23d7410ab3e0. The cast information is provided in an empty structure. The movie titled \"Taming the Beast\" is categorized as a movie. In this film, Steve Rogan, identified with the IMDb index \"II\" and gender \"m\", plays the role of an actor. His name codes are \"R2523\" for name_pcode_cf, \"S3162\" for name_pcode_nf, and \"R25\" for surname_pcode, with a md5sum of \"75d388d1eec835c89b3e50e65db4ba6f\". He portrays the character \"Inmate\", which has a name_pcode_nf of \"I53\" and a md5sum of \"de492f25da2c5f96c43457bc315d3821\". The cast information is provided as an empty object. The movie titled \"Taming the Beast\" features Andrew M. Rose, a male actor, who plays the character \"Hippie.\" His involvement in the film is noted as uncredited. The structured data includes specific codes and identifiers: Andrew M. Rose's name_pcode_cf is \"R2536,\" name_pcode_nf is \"A5365,\" and surname_pcode is \"R2,\" with an md5sum of \"8ed63194aa604a0cde7ec91a397f3d93.\" The character \"Hippie\" has a name_pcode_nf of \"H1\" and an md5sum of \"f69f7f7cd2190850dbbbe4d7cd416744.\" The movie titled \"Taming the Beast\" features Andy Rose, identified by IMDb index \"IV\" and gender \"m\", in the role of an actor. In this film, he portrays the character \"Prison Guard\". The character's name is encoded with the name_pcode_nf \"P6252\" and surname_pcode \"G63\", with a unique md5sum \"66bd2b0f7e67da90152c23d7410ab3e0\". Andy Rose's personal identifiers include name_pcode_cf \"R253\", name_pcode_nf \"A5362\", and surname_pcode \"R2\", with a md5sum \"c0912783a07d3b0c23217c19968560a2\". The cast information is provided in a structured format. The movie titled \"Taming the Beast\" features Corey Schmidt, identified by the IMDb index \"V\" and gender \"m\", with name codes \"S2532\" and \"C6253\", and surname code \"S253\". His md5sum is \"242c4a9c3efa94b2e82e78afc580db86\". Corey Schmidt plays the role of an actor, portraying the character \"Inmate\", which has the name code \"I53\" and md5sum \"de492f25da2c5f96c43457bc315d3821\". The cast information is provided in an empty object. The movie titled \"Taming the Beast\" features Scott L. Schwartz, a male actor, in the role of \"Pin Cushion.\" The structured data identifies Schwartz with name codes S2632 and S2342, and an md5sum of afe3d7f2390765c4f8879e3af1bedd2a. His character, \"Pin Cushion,\" is associated with name code P525, surname code C25, and an md5sum of 9d572757894736f48acb097b26fbed63. The cast information is provided in a structured format. The movie titled \"Taming the Beast\" features Torin Sixx, a male actor, in the role of a Prison Guard. The structured data identifies the movie as a \"movie\" and provides specific codes for Torin Sixx, including name_pcode_cf \"S2365\", name_pcode_nf \"T652\", surname_pcode \"S2\", and md5sum \"f29520499d309f6fc1c8cd592cf064d8\". His role is listed as \"actor\". The character he portrays, Prison Guard, is associated with name_pcode_nf \"P6252\", surname_pcode \"G63\", and md5sum \"66bd2b0f7e67da90152c23d7410ab3e0\". The cast information is noted but not detailed further. The movie titled \"Taming the Beast\" features Annie Boon, a female actress, in the role of \"Hippie Chick.\" Annie Boon's name is encoded with the name_pcode_cf \"B5\" and name_pcode_nf \"A515,\" with an md5sum of \"ac92ec1d8b7449e9927188faf53082df.\" Her character, \"Hippie Chick,\" is identified by the name_pcode_nf \"H12\" and surname_pcode \"C2,\" with an md5sum of \"9b0603264d6a29e6e761a6f96a0abaee.\" The cast information is provided in a structured format. The movie titled \"Taming the Beast\" features Christina Jo'Leigh, a female actress, who plays the character Beth George. Christina Jo'Leigh is credited as \"Christina Leigh\" in the cast. Her name codes are J4262 for name_pcode_cf, C6235 for name_pcode_nf, and J42 for surname_pcode, with a md5sum of 9ef529742ee0dd0e1a571d0a5cbe5c46. The character Beth George has a name_pcode_nf of B3262, a surname_pcode of G62, and a md5sum of db5bd0145b2b1a08eb8cab3983b061a9. The movie titled \"Taming the Beast\" features Kimber Leigh, a female actress, in the role of \"Medical Staff.\" Her name is encoded with the codes L2516 and K5164, and her surname is encoded as L2, with a unique identifier of 23029f101abb8307794df8b6b7bd0485. The character \"Medical Staff\" is encoded with the codes M3242 and S31, and has a unique identifier of 54370fffaa6529c79fe4068ebab05bab. The cast information is provided in a structured format. The movie titled \"Taming the Beast\" features Cathy Rankin, identified by the name codes R5252 and C3652, with a surname code R525 and an md5sum of 33006f8ba06bc66c7788bf8bdf9d6b6e. Cathy Rankin, a female actress, plays the character Sandra Good, whose name code is S5362, surname code G3, and md5sum f6b6f53c0dce2d9ff8a52b6e7d2ff376. The cast information is provided in a structured format. The movie titled \"Taming the Beast\" is categorized as a movie. Wayne Cole, identified by the IMDb index \"I\" and name codes \"C45\" and \"W524,\" with a surname code \"C4\" and an MD5 checksum of \"89f84f46d19f04cab2a0f141089ba4f0,\" is associated with this film. He served in the role of a producer, specifically noted as a co-executive producer. The movie titled \"Taming the Beast\" features Bonnie Kanner, identified by the name codes K5615 and B5256, with a surname code of K56 and an md5sum of 93ce7f70c24ce0555e18161fbd0b0346. She is a female involved in the role of a producer, as noted in the cast information with the specific note \"(producer)\". The movie titled \"Taming the Beast\" features Todd H. Mathus, a male, who contributed as a producer. His involvement is specifically noted as an associate producer. The structured data includes identifiers for Mathus: name_pcode_cf is \"M323\", name_pcode_nf is \"T3532\", surname_pcode is \"M32\", and md5sum is \"257308a33dd254774474b14d58e83719\". The movie titled \"Taming the Beast\" is categorized as a movie. Sandy Wasserman, identified by IMDb index \"I\" and name codes \"W2652\" and \"S5326,\" with a surname code \"W265\" and an MD5 checksum of \"28ea47e90fe1c6df8738aa2f59119a6f,\" is associated with this film. Wasserman's role in the movie is listed as a producer, specifically noted as a \"(co-executive producer).\" The movie titled \"Taming the Beast\" features Kenneth W. Long Jr., identified by the name codes L5262 and K5345, with a surname code of L526 and an md5sum of a0492bedc459597d3ec34c013d599f9b. He is a male contributing writer for this film. The movie titled \"Taming the Beast\" is categorized as a movie. Involved in this project is Dary Matera, identified by the name codes M3636 and D6536, with a surname code of M36 and an md5sum of 1c611f870fdd0b475ccb6ceceba19f32. Dary Matera contributed to the film in the role of a writer, specifically noted as a developer. The movie titled \"Taming the Beast\" features Dan Radlauer, identified by name codes R3463 and D5634, with a surname code R346 and an md5sum of 67f799e65504ff0cc3adcfbe7dd07cbe, in the role of composer. The cast information is provided as an empty list. The movie titled \"Taming the Beast\" features John Cones, identified by name codes C525 and J5252, with a surname code of C52 and an md5sum of 1b502245ce006a035ff75b5ad09e81e1, as part of the miscellaneous crew. His role includes a specific note: \"(finance legal)\". The movie titled \"Taming the Beast\" features Stephen Wade Nebgen, identified by the name codes N1252 and S3153, with a surname code of N125 and an md5sum of 579fd42a19d3b05fdca8df9ed586d39d. He is a male involved in the project as part of the miscellaneous crew, specifically noted as an entertainment lawyer.\n\nThe structured data contains a list of keywords related to specific topics, each paired with a phonetic code. The first keyword is \"charles-manson\" with the phonetic code \"C6425.\" Following this, the keyword \"helter-skelter\" is associated with the phonetic code \"H4362.\" Additionally, the keyword \"manson\" is linked to the phonetic code \"M525.\" Lastly, the keyword \"manson-family\" corresponds to the phonetic code \"M5251.\" Each keyword and its respective phonetic code are presented in a precise and structured manner.\n\nThe movie companies involved are Microbudget Films and TKH Productions, both based in the United States, denoted by the country code \"[us]\". Microbudget Films is identified by the name_pcode_nf \"M2613\" and name_pcode_sf \"M2613\", with an md5sum of \"7b140048629c2c1b5521563d56865cea\", and is categorized under \"production companies\". Similarly, TKH Productions is identified by the name_pcode_nf \"T2163\" and name_pcode_sf \"T2163\", with an md5sum of \"c4626bc61824416039d6afbf58350d6d\", also classified as a \"production company\".\n\n"
    },
    {
        "title": "Big Jack",
        "dict_description": "The structured data describes a movie titled \"Big Jack,\" identified by the ID 1727496. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of \"B2\" and an MD5 checksum of \"6bd9a1c26269950f316405ae7474a29c.\"\n\nThe movie was filmed in various locations including Easton, Pennsylvania, USA; Las Vegas, Nevada, USA; Manitoba, Canada; and Winnipeg, Manitoba, Canada. It utilized the CAM:Red One Camera for its production. The film was released in the USA on 8 June 2015 and is copyrighted by Sheldon Robins. Filming took place from 28 February 2012 onwards, while production started on 8 December 2012. The budget for the movie was $27,000,000. It is presented in color and falls under the genres of Drama and Sport.\n\nThe movie titled \"Big Jack\" features Sheldon Robins, identified by the name codes R1524 and S4356, with a surname code R152 and an md5sum of 793fc33e8fb0e1e2b8ed53f16508ff33. He is a male involved in the film as both a producer and a writer. His roles are specified with notes: as an executive producer and for screenplay & story.\n\nThe structured data contains a keyword entry with the keyword \"two-word-title\" and its associated phonetic code \"T634\".\n\nThe movie companies involved include \"Big Jack Movie\" and \"Upper Laventile Productions,\" both based in the United States, as indicated by the country code \"[us].\" \"Big Jack Movie\" is identified with the name_pcode_nf \"B251\" and name_pcode_sf \"B2512,\" and has an md5sum of \"cb6bbd24d2b1311fd1dccf416d4e3de1.\" Similarly, \"Upper Laventile Productions\" is associated with the name_pcode_nf \"U1641\" and name_pcode_sf \"U1641,\" with an md5sum of \"eab6bc1e97a7acc28ba1dbca93a2e238.\" Both entities are categorized under \"production companies.\"\n\n"
    },
    {
        "title": "Riders on the Storm",
        "dict_description": "The structured data describes a movie titled \"Riders on the Storm,\" identified by the ID 2243643. This film was produced in the year 2015 and is categorized under the kind \"movie.\" It has a phonetic code of \"R3625\" and an MD5 checksum of \"fd1703018d3873de3e7f7a11ca471102.\"\n\nThe movie is associated with the country \"USA\" and falls under the \"Action\" genre.\n\nThe movie titled \"Riders on the Storm\" is categorized as a \"movie.\" A person involved in this film is John Davis, identified by the IMDb index \"I,\" with a gender of \"m.\" His name codes are \"D125\" for name_pcode_cf, \"J5312\" for name_pcode_nf, and \"D12\" for surname_pcode, with a unique md5sum of \"df6a66e23dda51ebd34dc3b37e9f35a9.\" John Davis served in the role of \"producer,\" as noted in the cast info with the specification \"(producer).\" The movie titled \"Riders on the Storm\" is categorized as a movie. A person involved in this project is John Fox, identified with the IMDb index \"XXII\" and name codes \"F25\" for name_pcode_cf, \"J512\" for name_pcode_nf, and \"F2\" for surname_pcode, with a unique md5sum of \"3e8fba30c481da897c7f701b349c379f\". John Fox's role in this movie is as a producer, as noted in the cast info with the specification \"(producer)\". The movie titled \"Riders on the Storm\" features Richard Leibowitz, identified by name codes L1326 and R2634, with a surname code of L132 and an md5sum of b3abc33d08cf75de88404b15cf7489b8, in the role of a producer. The cast information includes a note specifying his role as \"(producer).\" The movie titled \"Riders on the Storm\" is categorized as a \"movie.\" Sean O'Keefe, identified by the IMDb index \"I\" and name codes \"O2125\" and \"S521,\" with a surname code \"O21\" and an MD5 checksum of \"bf9163d35a8b999464834a92c5579d31,\" is associated with this film. He contributed in the role of a writer, specifically noted for the \"screenplay.\"\n\nThe structured data contains a list of keywords related to a theme. The first keyword is \"heist\" with a phonetic code of \"H23.\" The second keyword is \"theft,\" associated with the phonetic code \"T13.\" Lastly, the keyword \"thief\" is included, carrying the phonetic code \"T1.\" Each keyword is paired with its respective phonetic code, allowing for precise identification and categorization.\n\nThe movie companies involved include Davis Entertainment, Twentieth Century Fox Film Corporation, and Union Entertainment, all based in the United States. Davis Entertainment, identified by the codes D1253 for both name_pcode_nf and name_pcode_sf, has an md5sum of 3480383500fa996f3fb7408cb05d0ada and is categorized under production companies. Twentieth Century Fox Film Corporation, with the codes T5325 for both name_pcode_nf and name_pcode_sf, has an md5sum of db4d2c15bfaec32cb702f4b147c0aeef, also listed as a production company. Union Entertainment shares the same category, with codes U5363 for both name_pcode_nf and name_pcode_sf, and an md5sum of 64727e2094b2cbdc1292d73089ce4880.\n\n"
    },
    {
        "title": "My Duty",
        "dict_description": "The movie titled \"My Duty\" is identified by the ID 2137880 and was produced in the year 2015. It is categorized under the kind \"movie\" and has a phonetic code of \"M3\". The MD5 checksum associated with this title is 88ab0d71112c3bfed0f70885fdbb2263.\n\nThe film, released in the UK in 2015, is a color production with a budget of £25,000,000. It features a runtime of 185 minutes and is categorized under the genres of Action, Biography, Drama, and War. The plot revolves around an old man in a care home who befriends his carer and recounts his life story, detailing his experiences as an infantry soldier during World War II and his challenges in readjusting to civilian life with his family. The tagline for the movie is \"We fought for freedom and democracy...We achieved no such thing.\" The film was shot in various locations, including London, England, UK; Berlin, Germany; Rome, Lazio, Italy; Algeria; and Morocco. It includes dialogues in English, German, Italian, and Afrikaans. The country of origin is the UK.\n\nThe movie titled \"My Duty\" features Jay Cosme, a male, who is involved in multiple roles including actor, producer, writer, and director. In the film, he portrays the character John Jones. The cast information includes notes indicating his role as a producer and an attachment to the project. Jay Cosme's identifiers include name_pcode_cf: C252, name_pcode_nf: J25, surname_pcode: C25, and md5sum: 129da1cf0d368be4f8209b57e7803d81. The character John Jones is identified by name_pcode_nf: J5252, surname_pcode: J52, and md5sum: 59180e080965bf8eebf9134f8f7f525f. The movie titled \"My Duty\" features Charly Mae Nelson, identified by the name codes N4252 and C6454, and surname code N425, with a unique md5sum of fc6728024422851d2c3fa08fb913f537. She is a female involved in the roles of producer and director. Her participation is noted as \"(producer)\" and \"(attached)\" in the cast information.\n\nThe structured data contains a list of keywords, each paired with a phonetic code. The first keyword is \"battle\" with the phonetic code \"B34.\" Next is \"bomb,\" associated with the phonetic code \"B51.\" Following that, the keyword \"gun\" is linked to the phonetic code \"G5.\" Lastly, the keyword \"soldier\" corresponds to the phonetic code \"S436.\"\n\nThe movie companies involved include ProductiveFilm, which operates in the United Kingdom, denoted by the country code [gb]. This company is identified by the name_pcode_nf and name_pcode_sf as P6323, with an md5sum of dc3670d60e26ab6bd46c1a19995943ac. ProductiveFilm serves dual roles as both a distributor and a production company.\n\n"
    }
]